Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: The headers received with the request.
es: Las cabeceras recibidas con la solicitud.

source: The address of the client sending the request.
es: La dirección del cliente que envía la solicitud.

source: This is a proxy. See :ref:`notes-on-proxies` for more information.
es: Se trata de un proxy. Consulte :ref:`notes-on-proxies` para obtener más información.

source: The request object is an instance of a :class:`~flask.Request`.
es: El objeto request es una instancia de una :class:`~flask.Request`.

source: Response Objects
es: Objetos de respuesta

source: The response object that is used by default in Flask. Works like the response object from Werkzeug but is set to have an HTML mimetype by default. Quite often you don't have to create this object yourself because :meth:`~flask.Flask.make_response` will take care of that for you.
es: El objeto de respuesta que se utiliza por defecto en Flask. Funciona como el objeto de respuesta de Werkzeug pero está configurado para tener un mimetype HTML por defecto. A menudo no tienes que crear este objeto tú mismo porque :meth:`~flask.Flask.make_response` se encargará de ello por ti.

source: If you want to replace the response object used you can subclass this and set :attr:`~flask.Flask.response_class` to your subclass.
es: Si quieres reemplazar el objeto de respuesta utilizado puedes subclasificar esto y establecer :attr:`~flask.Flask.response_class` a tu subclase.

source: JSON support is added to the response, like the request. This is useful when testing to get the test client response data as JSON.
es: El soporte JSON se añade a la respuesta, al igual que la solicitud. Esto es útil cuando se hacen pruebas para obtener los datos de respuesta del cliente de prueba como JSON.

source: Added :attr:`max_cookie_size`.
es: Añadido :attr:`max_cookie_size`.

source: The `Accept-Ranges` header. Even though the name would indicate that multiple values are supported, it must be one string token only.
es: La cabecera `Accept-Ranges`. Aunque el nombre indique que se admiten varios valores, debe ser un solo token de cadena.

source: The values ``'bytes'`` and ``'none'`` are common.
es: Los valores "bytes" y ``'none'`` son comunes.

source: Whether credentials can be shared by the browser to JavaScript code. As part of the preflight request it indicates whether credentials can be used on the cross origin request.
es: Si las credenciales pueden ser compartidas por el navegador al código JavaScript. Como parte de la solicitud de verificación previa, indica si las credenciales se pueden utilizar en la solicitud de origen cruzado.

source: Which headers can be sent with the cross origin request.
es: Qué cabeceras se pueden enviar con la solicitud de origen cruzado.

source: Which methods can be used for the cross origin request.
es: Qué métodos se pueden utilizar para la solicitud de origen cruzado.

source: The origin or '*' for any origin that may make cross origin requests.
es: El origen o '*' para cualquier origen que pueda hacer peticiones de origen cruzado.

source: Which headers can be shared by the browser to JavaScript code.
es: Qué cabeceras pueden ser compartidas por el navegador al código JavaScript.

source: The maximum age in seconds the access control settings can be cached for.
es: La edad máxima en segundos que la configuración del control de acceso puede ser almacenada en caché.

source: Add an etag for the current response if there is none yet.
es: Añade una etiqueta electrónica para la respuesta actual si todavía no hay ninguna.

source: SHA-1 is used to generate the value. MD5 may not be available in some environments.
es: Se utiliza SHA-1 para generar el valor. MD5 puede no estar disponible en algunos entornos.

source: The Age response-header field conveys the sender's estimate of the amount of time since the response (or its revalidation) was generated at the origin server.
es: El campo de encabezado de respuesta Age transmite la estimación del remitente sobre el tiempo transcurrido desde que se generó la respuesta (o su revalidación) en el servidor de origen.

source: Age values are non-negative decimal integers, representing time in seconds.
es: Los valores de edad son enteros decimales no negativos que representan el tiempo en segundos.

source: The Allow entity-header field lists the set of methods supported by the resource identified by the Request-URI. The purpose of this field is strictly to inform the recipient of valid methods associated with the resource. An Allow header field MUST be present in a 405 (Method Not Allowed) response.
es: El campo Allow entity-header enumera el conjunto de métodos admitidos por el recurso identificado por la Request-URI. El propósito de este campo es estrictamente informar al destinatario de los métodos válidos asociados con el recurso. Un campo de cabecera Allow DEBE estar presente en una respuesta 405 (Method Not Allowed).

source: The Cache-Control general-header field is used to specify directives that MUST be obeyed by all caching mechanisms along the request/response chain.
es: El campo Cache-Control general-header se utiliza para especificar las directivas que DEBEN ser obedecidas por todos los mecanismos de almacenamiento en caché a lo largo de la cadena de solicitud/respuesta.

source: Returns the content length if available or `None` otherwise.
es: Devuelve la longitud del contenido si está disponible o `None` en caso contrario.

source: Adds a function to the internal list of functions that should be called as part of closing down the response. Since 0.7 this function also returns the function that was passed so that this can be used as a decorator.
es: Añade una función a la lista interna de funciones que deben ser llamadas como parte del cierre de la respuesta. Desde la versión 0.7 esta función también devuelve la función que se pasó para que esta pueda ser utilizada como un decorador.

source: Close the wrapped response if possible. You can also use the object in a with statement which will automatically close it.
es: Cierre la respuesta envuelta si es posible. También puedes utilizar el objeto en una sentencia with que lo cerrará automáticamente.

source: Can now be used in a with statement.
es: Ahora se puede utilizar en una declaración con.

source: The Content-Language entity-header field describes the natural language(s) of the intended audience for the enclosed entity. Note that this might not be equivalent to all the languages used within the entity-body.
es: El campo Content-Language de la cabecera de la entidad describe la(s) lengua(s) natural(es) de los destinatarios de la entidad adjunta. Tenga en cuenta que esto podría no ser equivalente a todos los idiomas utilizados dentro del cuerpo de la entidad.

source: The Content-Length entity-header field indicates the size of the entity-body, in decimal number of OCTETs, sent to the recipient or, in the case of the HEAD method, the size of the entity-body that would have been sent had the request been a GET.
es: El campo Content-Length de la cabecera de la entidad indica el tamaño del cuerpo de la entidad, en número decimal de OCTETs, enviado al destinatario o, en el caso del método HEAD, el tamaño del cuerpo de la entidad que se habría enviado si la petición hubiera sido un GET.

source: The Content-Location entity-header field MAY be used to supply the resource location for the entity enclosed in the message when that entity is accessible from a location separate from the requested resource's URI.
es: El campo de cabecera de entidad Content-Location PUEDE utilizarse para proporcionar la ubicación del recurso para la entidad incluida en el mensaje cuando dicha entidad es accesible desde una ubicación distinta del URI del recurso solicitado.

source: The ``Content-Range`` header as a :class:`~werkzeug.datastructures.ContentRange` object. Available even if the header is not set.
es: La cabecera ``Content-Range`` como objeto :class:`~werkzeug.datastructures.ContentRange`. Disponible incluso si la cabecera no está establecida.

source: The ``Content-Security-Policy`` header as a :class:`~werkzeug.datastructures.ContentSecurityPolicy` object. Available even if the header is not set.
es: La cabecera ``Content-Security-Policy`` como objeto :class:`~werkzeug.datastructures.ContentSecurityPolicy`. Disponible incluso si la cabecera no está establecida.

source: The Content-Security-Policy header adds an additional layer of security to help detect and mitigate certain types of attacks.
es: La cabecera Content-Security-Policy añade una capa adicional de seguridad para ayudar a detectar y mitigar ciertos tipos de ataques.

source: The ``Content-Security-policy-report-only`` header as a :class:`~werkzeug.datastructures.ContentSecurityPolicy` object. Available even if the header is not set.
es: La cabecera ``Content-Security-policy-report-only`` como objeto :class:`~werkzeug.datastructures.ContentSecurityPolicy`. Disponible incluso si la cabecera no está establecida.

source: The Content-Security-Policy-Report-Only header adds a csp policy that is not enforced but is reported thereby helping detect certain types of attacks.
es: La cabecera Content-Security-Policy-Report-Only añade una política csp que no se aplica, pero que se notifica, ayudando así a detectar ciertos tipos de ataques.

source: Prevents a document from loading any cross-origin resources that do not explicitly grant the document permission. Values must be a member of the :class:`werkzeug.http.COEP` enum.
es: Evita que un documento cargue cualquier recurso de origen cruzado que no conceda explícitamente el permiso al documento. Los valores deben ser miembros de la clase :class:`werkzeug.http.COEP` enum.

source: Allows control over sharing of browsing context group with cross-origin documents. Values must be a member of the :class:`werkzeug.http.COOP` enum.
es: Permite controlar el uso compartido del grupo de contexto de navegación con documentos de origen cruzado. Los valores deben ser miembros de la clase :class:`werkzeug.http.COOP` enum.

source: A descriptor that calls :meth:`get_data` and :meth:`set_data`.
es: Un descriptor que llama a :meth:`get_data` y :meth:`set_data`.

source: Delete a cookie. Fails silently if key doesn't exist.
es: Borrar una cookie. Falla silenciosamente si la clave no existe.

source: the key (name) of the cookie to be deleted.
es: la clave (nombre) de la cookie que se va a eliminar.

source: if the cookie that should be deleted was limited to a path, the path has to be defined here.
es: si la cookie que debe ser eliminada estaba limitada a una ruta, la ruta tiene que ser definida aquí.

source: if the cookie that should be deleted was limited to a domain, that domain has to be defined here.
es: si la cookie que debe ser eliminada estaba limitada a un dominio, ese dominio tiene que ser definido aquí.

source: If ``True``, the cookie will only be available via HTTPS.
es: Si es ``True``, la cookie sólo estará disponible a través de HTTPS.

source: Disallow JavaScript access to the cookie.
es: No permitir el acceso de JavaScript a la cookie.

source: Limit the scope of the cookie to only be attached to requests that are "same-site".
es: Limitar el alcance de la cookie para que sólo se adjunte a las solicitudes que son "del mismo sitio".

source: The Expires entity-header field gives the date/time after which the response is considered stale. A stale cache entry may not normally be returned by a cache.
es: El campo "Expires entity-header" indica la fecha/hora a partir de la cual la respuesta se considera antigua. Una entrada de caché obsoleta normalmente no puede ser devuelta por una caché.

source: Enforce that the WSGI response is a response object of the current type. Werkzeug will use the :class:`Response` internally in many situations like the exceptions. If you call :meth:`get_response` on an exception you will get back a regular :class:`Response` object, even if you are using a custom subclass.
es: Hacer que la respuesta WSGI sea un objeto de respuesta de la clase actual. Werkzeug utilizará la :class:`Response` internamente en muchas situaciones como las excepciones. Si llamas a :meth:`get_response` en una excepción obtendrás un objeto :class:`Response` normal, incluso si estás usando una subclase personalizada.

source: This method can enforce a given response type, and it will also convert arbitrary WSGI callables into response objects if an environ is provided::
es: Este método puede imponer un tipo de respuesta dado, y también convertirá callables WSGI arbitrarios en objetos de respuesta si se proporciona un entorno::

source: This is especially useful if you want to post-process responses in the main dispatcher and use functionality provided by your subclass.
es: Esto es especialmente útil si quieres posprocesar las respuestas en el despachador principal y utilizar la funcionalidad proporcionada por tu subclase.

source: Keep in mind that this will modify response objects in place if possible!
es: ¡Tenga en cuenta que esto modificará los objetos de respuesta en su lugar si es posible!

source: a response object or wsgi application.
es: un objeto de respuesta o aplicación wsgi.

source: a WSGI environment object.
es: un objeto de entorno WSGI.

source: a response object.
es: un objeto de respuesta.

source: Make the response object ready to be pickled. Does the following:
es: Prepara el objeto de respuesta para ser decapado. Hace lo siguiente:

source: Buffer the response into a list, ignoring :attr:`implicity_sequence_conversion` and :attr:`direct_passthrough`.
es: Almacena la respuesta en una lista, ignorando :attr:`implicity_sequence_conversion` y :attr:`direct_passthrough`.

source: Set the ``Content-Length`` header.
es: Establece la cabecera ``Content-Length``.

source: Generate an ``ETag`` header if one is not already set.
es: Genera una cabecera ``ETag`` si aún no se ha establecido una.

source: Removed the ``no_etag`` parameter.
es: Se ha eliminado el parámetro ``no_etag``.

source: The ``Content-Length`` header is set.
es: La cabecera ``Content-Length`` se ha establecido.

source: Create a new response object from an application output. This works best if you pass it an application that returns a generator all the time. Sometimes applications may use the `write()` callable returned by the `start_response` function. This tries to resolve such edge cases automatically. But if you don't get the expected output you should set `buffered` to `True` which enforces buffering.
es: Crea un nuevo objeto de respuesta a partir de la salida de una aplicación. Esto funciona mejor si le pasas una aplicación que devuelva un generador todo el tiempo. A veces las aplicaciones pueden utilizar la llamada `write()` devuelta por la función `start_response`. Esto trata de resolver estos casos extremos automáticamente. Pero si no obtienes la salida esperada, deberías poner `buffered` a `True`, lo que refuerza el buffering.

source: the WSGI application to execute.
es: la aplicación WSGI a ejecutar.

source: the WSGI environment to execute against.
es: el entorno WSGI contra el que se va a ejecutar.

source: set to `True` to enforce buffering.
es: se establece como `True` para reforzar el buffering.

source: Returns the application iterator for the given environ. Depending on the request method and the current status code the return value might be an empty response rather than the one from the response.
es: Devuelve el iterador de la solicitud para el entorno dado. Dependiendo del método de solicitud y del código de estado actual, el valor de retorno podría ser una respuesta vacía en lugar de la de la respuesta.

source: If the request method is `HEAD` or the status code is in a range where the HTTP specification requires an empty response, an empty iterable is returned.
es: Si el método de solicitud es `HEAD` o el código de estado está en un rango en el que la especificación HTTP requiere una respuesta vacía, se devuelve un iterable vacío.

source: the WSGI environment of the request.
es: el entorno WSGI de la solicitud.

source: a response iterable.
es: un iterable de respuesta.

source: The string representation of the response body. Whenever you call this property the response iterable is encoded and flattened. This can lead to unwanted behavior if you stream big data.
es: La representación en forma de cadena del cuerpo de la respuesta. Cada vez que se llama a esta propiedad, el iterable de la respuesta se codifica y se aplana. Esto puede dar lugar a un comportamiento no deseado si se transmiten grandes datos.

source: This behavior can be disabled by setting :attr:`implicit_sequence_conversion` to `False`.
es: Este comportamiento puede desactivarse estableciendo :attr:`implicit_sequence_conversion` a `False`.

source: Return a tuple in the form ``(etag, is_weak)``. If there is no ETag the return value is ``(None, None)``.
es: Devuelve una tupla de la forma ``(etag, is_weak)``. Si no hay ETag el valor de retorno es ``(None, None)``.

source: Parse :attr:`data` as JSON. Useful during testing.
es: Analiza :attr:`data` como JSON. Útil durante las pruebas.

source: If the mimetype does not indicate JSON (:mimetype:`application/json`, see :attr:`is_json`), this returns ``None``.
es: Si el mimetype no indica JSON (:mimetype:`application/json`, véase :attr:`is_json`), devuelve ``None``.

source: Unlike :meth:`Request.get_json`, the result is not cached.
es: A diferencia de :meth:`Request.get_json`, el resultado no se almacena en caché.

source: Silence parsing errors and return ``None`` instead.
es: Silencia los errores de análisis y devuelve ``None`` en su lugar.

source: This is automatically called right before the response is started and returns headers modified for the given environment. It returns a copy of the headers from the response with some modifications applied if necessary.
es: Se llama automáticamente justo antes de que se inicie la respuesta y devuelve las cabeceras modificadas para el entorno dado. Devuelve una copia de las cabeceras de la respuesta con algunas modificaciones aplicadas si es necesario.

source: For example the location header (if present) is joined with the root URL of the environment. Also the content length is automatically set to zero here for certain status codes.
es: Por ejemplo, la cabecera location (si está presente) se une a la URL raíz del entorno. También la longitud del contenido se pone automáticamente a cero aquí para ciertos códigos de estado.

source: Previously that function was called `fix_headers` and modified the response object in place. Also since 0.6, IRIs in location and content-location headers are handled properly.
es: Anteriormente esa función se llamaba `fix_headers` y modificaba el objeto de respuesta en su lugar. Además, desde la versión 0.6, los IRIs en las cabeceras location y content-location se manejan correctamente.

source: Also starting with 0.6, Werkzeug will attempt to set the content length if it is able to figure it out on its own. This is the case if all the strings in the response iterable are already encoded and the iterable is buffered.
es: También a partir de la versión 0.6, Werkzeug intentará establecer la longitud del contenido si es capaz de averiguarlo por sí mismo. Este es el caso si todas las cadenas en el iterable de respuesta ya están codificadas y el iterable está en el buffer.

source: returns a new :class:`~werkzeug.datastructures.Headers` object.
es: devuelve un nuevo objeto :class:`~werkzeug.datastructures.Headers`.

source: Returns the final WSGI response as tuple. The first item in the tuple is the application iterator, the second the status and the third the list of headers. The response returned is created specially for the given environment. For example if the request method in the WSGI environment is ``'HEAD'`` the response will be empty and only the headers and status code will be present.
es: Devuelve la respuesta final de WSGI como una tupla. El primer elemento de la tupla es el iterador de la aplicación, el segundo el estado y el tercero la lista de cabeceras. La respuesta devuelta se crea especialmente para el entorno dado. Por ejemplo, si el método de solicitud en el entorno WSGI es ``'HEAD'`` la respuesta estará vacía y sólo estarán presentes las cabeceras y el código de estado.

source: If the iterator is buffered, this property will be `True`. A response object will consider an iterator to be buffered if the response attribute is a list or tuple.
es: Si el iterador se almacena en un buffer, esta propiedad será `True`. Un objeto de respuesta considerará que un iterador está almacenado en buffer si el atributo de la respuesta es una lista o tupla.

source: If the response is streamed (the response is not an iterable with a length information) this property is `True`. In this case streamed means that there is no information about the number of iterations. This is usually `True` if a generator is passed to the response object.
es: Si la respuesta es "streamed" (la respuesta no es un iterable con información de longitud) esta propiedad es `True`. En este caso, streamed significa que no hay información sobre el número de iteraciones. Normalmente es `True` si se pasa un generador al objeto de respuesta.

source: This is useful for checking before applying some sort of post filtering that should not take place for streamed responses.
es: Esto es útil para comprobar antes de aplicar algún tipo de filtrado de correos que no debería tener lugar para las respuestas transmitidas.

source: Iter the response encoded with the encoding of the response. If the response object is invoked as WSGI application the return value of this method is used as application iterator unless :attr:`direct_passthrough` was activated.
es: Itera la respuesta codificada con la codificación de la respuesta. Si el objeto de respuesta se invoca como aplicación WSGI, el valor de retorno de este método se utiliza como iterador de la aplicación, a menos que se haya activado :attr:`direct_passthrough`.

source: The Last-Modified entity-header field indicates the date and time at which the origin server believes the variant was last modified.
es: El campo de cabecera de entidad Last-Modified indica la fecha y hora en la que el servidor de origen cree que la variante fue modificada por última vez.

source: The Location response-header field is used to redirect the recipient to a location other than the Request-URI for completion of the request or identification of a new resource.
es: El campo Location response-header se utiliza para redirigir al destinatario a una ubicación distinta de la Request-URI para completar la solicitud o identificar un nuevo recurso.

source: Make the response conditional to the request. This method works best if an etag was defined for the response already. The `add_etag` method can be used to do that. If called without etag just the date header is set.
es: Hacer que la respuesta esté condicionada a la solicitud. Este método funciona mejor si ya se ha definido una etiqueta electrónica para la respuesta. El método `add_etag` puede utilizarse para ello. Si se llama sin etag sólo se establece la cabecera de la fecha.

source: This does nothing if the request method in the request or environ is anything but GET or HEAD.
es: Esto no hace nada si el método de solicitud en la petición o el entorno es cualquier cosa que no sea GET o HEAD.
