Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: When used in combination with a ``with`` statement this opens a session transaction. This can be used to modify the session that the test client uses. Once the ``with`` block is left the session is stored back.
es: Cuando se utiliza en combinación con una sentencia ``with`` se abre una transacción de sesión. Esto se puede utilizar para modificar la sesión que utiliza el cliente de prueba. Una vez que se abandona el bloque ``with`` se vuelve a guardar la sesión.

source: Internally this is implemented by going through a temporary test request context and since session handling could depend on request variables this function accepts the same arguments as :meth:`~flask.Flask.test_request_context` which are directly passed through.
es: Internamente esto se implementa pasando por un contexto de solicitud de prueba temporal y como el manejo de la sesión podría depender de las variables de la solicitud, esta función acepta los mismos argumentos que :meth:`~flask.Flask.test_request_context` que se pasan directamente.

source: Generate an environ dict from the given arguments, make a request to the application using it, and return the response.
es: Genera un environ dict a partir de los argumentos dados, realiza una petición a la aplicación que lo utiliza y devuelve la respuesta.

source: Passed to :class:`EnvironBuilder` to create the environ for the request. If a single arg is passed, it can be an existing :class:`EnvironBuilder` or an environ dict.
es: Se pasa a :class:`EnvironBuilder` para crear el entorno para la solicitud. Si se pasa un solo arg, puede ser un :class:`EnvironBuilder` existente o un environ dict.

source: Convert the iterator returned by the app into a list. If the iterator has a ``close()`` method, it is called automatically.
es: Convierte el iterador devuelto por la aplicación en una lista. Si el iterador tiene un método ``close()``, se llama automáticamente.

source: Make additional requests to follow HTTP redirects until a non-redirect status is returned. :attr:`TestResponse.history` lists the intermediate responses.
es: Realiza peticiones adicionales para seguir las redirecciones HTTP hasta que se devuelva un estado de no redirección. :attr:`TestResponse.history` lista las respuestas intermedias.

source: Removed the ``as_tuple`` parameter.
es: Se ha eliminado el parámetro ``as_tuple``.

source: The request input stream is closed when calling ``response.close()``. Input streams for redirects are automatically closed.
es: El flujo de entrada de la solicitud se cierra al llamar a ``response.close()``. Los flujos de entrada para las redirecciones se cierran automáticamente.

source: If a dict is provided as file in the dict for the ``data`` parameter the content type has to be called ``content_type`` instead of ``mimetype``. This change was made for consistency with :class:`werkzeug.FileWrapper`.
es: Si se proporciona un dict como archivo en el dict para el parámetro ``data`` el tipo de contenido debe llamarse ``content_type`` en lugar de ``mimetype``. Este cambio se ha realizado por coherencia con :class:`werkzeug.FileWrapper`.

source: Added the ``follow_redirects`` parameter.
es: Se ha añadido el parámetro ``follow_redirects``.

source: A :class:`~click.testing.CliRunner` for testing a Flask app's CLI commands. Typically created using :meth:`~flask.Flask.test_cli_runner`. See :ref:`testing-cli`.
es: Un :class:`~click.testing.CliRunner` para probar los comandos CLI de una aplicación Flask. Normalmente se crea usando :meth:`~flask.Flask.test_cli_runner`. Ver :ref:`testing-cli`.

source: Invokes a CLI command in an isolated environment. See :meth:`CliRunner.invoke <click.testing.CliRunner.invoke>` for full method documentation. See :ref:`testing-cli` for examples.
es: Invoca un comando CLI en un entorno aislado. Ver :meth:`CliRunner.invoke <click.testing.CliRunner.invoke>` para la documentación completa del método. Consulte :ref:`testing-cli` para ver ejemplos.

source: If the ``obj`` argument is not given, passes an instance of :class:`~flask.cli.ScriptInfo` that knows how to load the Flask app being tested.
es: Si el argumento ``obj`` no se da, pasa una instancia de :class:`~flask.cli.ScriptInfo` que sabe cómo cargar la aplicación Flask que se está probando.

source: Command object to invoke. Default is the app's :attr:`~flask.app.Flask.cli` group.
es: Objeto de comando a invocar. Por defecto es el grupo :attr:`~flask.app.Flask.cli` de la aplicación.

source: List of strings to invoke the command with.
es: Lista de cadenas para invocar el comando.

source: a :class:`~click.testing.Result` object.
es: un objeto :class:`~click.testing.Result`.

source: Application Globals
es: Globales de aplicación

source: A namespace object that can store data during an :doc:`application context </appcontext>`. This is an instance of :attr:`Flask.app_ctx_globals_class`, which defaults to :class:`ctx._AppCtxGlobals`.
es: Un objeto de espacio de nombres que puede almacenar datos durante un :doc:`contexto de aplicación </appcontext>`. Es una instancia de :attr:`Flask.app_ctx_globals_class`, que por defecto es :class:`ctx._AppCtxGlobals`.

source: This is a good place to store resources during a request. For example, a ``before_request`` function could load a user object from a session id, then set ``g.user`` to be used in the view function.
es: Este es un buen lugar para almacenar recursos durante una petición. Por ejemplo, una función ``before_request`` podría cargar un objeto de usuario a partir de un id de sesión, y luego establecer ``g.user`` para ser utilizado en la función de vista.

source: Bound to the application context instead of the request context.
es: Vinculado al contexto de la aplicación en lugar del contexto de la solicitud.

source: A plain object. Used as a namespace for storing data during an application context.
es: Un objeto simple. Se utiliza como espacio de nombres para almacenar datos durante un contexto de aplicación.

source: Creating an app context automatically creates this object, which is made available as the :data:`g` proxy.
es: La creación de un contexto de aplicación crea automáticamente este objeto, que se pone a disposición como proxy :data:`g`.

source: Check whether an attribute is present.
es: Comprueba si un atributo está presente.

source: Return an iterator over the attribute names.
es: Devuelve un iterador sobre los nombres de atributos.

source: Get an attribute by name, or a default value. Like :meth:`dict.get`.
es: Obtener un atributo por su nombre, o un valor por defecto. Como :meth:`dict.get`.

source: Name of attribute to get.
es: Nombre del atributo a obtener.

source: Value to return if the attribute is not present.
es: Valor a devolver si el atributo no está presente.

source: Get and remove an attribute by name. Like :meth:`dict.pop`.
es: Obtener y eliminar un atributo por su nombre. Como :meth:`dict.pop`.

source: Name of attribute to pop.
es: Nombre del atributo a reventar.

source: Value to return if the attribute is not present, instead of raising a ``KeyError``.
es: Valor a devolver si el atributo no está presente, en lugar de lanzar un ``KeyError``.

source: Get the value of an attribute if it is present, otherwise set and return a default value. Like :meth:`dict.setdefault`.
es: Obtiene el valor de un atributo si está presente, en caso contrario establece y devuelve un valor por defecto. Como :meth:`dict.setdefault`.

source: Value to set and return if the attribute is not present.
es: Valor a establecer y devolver si el atributo no está presente.

source: Useful Functions and Classes
es: Funciones y clases útiles

source: A proxy to the application handling the current request. This is useful to access the application without needing to import it, or if it can't be imported, such as when using the application factory pattern or in blueprints and extensions.
es: Un proxy de la aplicación que gestiona la solicitud actual. Esto es útil para acceder a la aplicación sin necesidad de importarla, o si no se puede importar, como cuando se utiliza el patrón de fábrica de aplicaciones o en blueprints y extensiones.

source: This is only available when an :doc:`application context </appcontext>` is pushed. This happens automatically during requests and CLI commands. It can be controlled manually with :meth:`~flask.Flask.app_context`.
es: Esto sólo está disponible cuando un :doc:`contexto de aplicación </appcontext>` es empujado. Esto ocurre automáticamente durante las solicitudes y los comandos CLI. Se puede controlar manualmente con :meth:`~flask.Flask.app_context`.

source: If you have code that wants to test if a request context is there or not this function can be used. For instance, you may want to take advantage of request information if the request object is available, but fail silently if it is unavailable.
es: Si usted tiene código que quiere probar si un contexto de solicitud está o no esta función puede ser utilizada. Por ejemplo, puede querer aprovechar la información de la solicitud si el objeto de solicitud está disponible, pero fallar silenciosamente si no está disponible.

source: Alternatively you can also just test any of the context bound objects (such as :class:`request` or :class:`g`) for truthness::
es: También puede comprobar la veracidad de cualquiera de los objetos vinculados al contexto (como :class:`request` o :class:`g`):

source: A helper function that decorates a function to retain the current request context. This is useful when working with greenlets. The moment the function is decorated a copy of the request context is created and then pushed when the function is called. The current session is also included in the copied request context.
es: Una función de ayuda que decora una función para retener el contexto de la solicitud actual. Esto es útil cuando se trabaja con greenlets. En el momento en que la función es decorada, se crea una copia del contexto de la solicitud y luego se empuja cuando la función es llamada. La sesión actual también se incluye en el contexto de solicitud copiado.

source: Example::
es: Ejemplo::

source: Works like :func:`has_request_context` but for the application context. You can also just do a boolean check on the :data:`current_app` object instead.
es: Funciona como :func:`has_request_context` pero para el contexto de la aplicación. También puede hacer una comprobación booleana en el objeto :data:`current_app`.

source: This requires an active request or application context, and calls :meth:`current_app.url_for() <flask.Flask.url_for>`. See that method for full documentation.
es: Esto requiere una solicitud activa o un contexto de aplicación, y llama a :meth:`current_app.url_for() <flask.Flask.url_for>`. Consulte ese método para ver la documentación completa.

source: Calls ``current_app.url_for``, allowing an app to override the behavior.
es: Llama a ``current_app.url_for``, permitiendo que una aplicación anule el comportamiento.

source: The ``_scheme`` parameter was added.
es: Se ha añadido el parámetro ``scheme``.

source: The ``_anchor`` and ``_method`` parameters were added.
es: Se han añadido los parámetros ``_anchor`` y ``_method``.

source: Calls ``app.handle_url_build_error`` on build errors.
es: Llama a ``app.handle_url_build_error`` en los errores de construcción.

source: Raise an :exc:`~werkzeug.exceptions.HTTPException` for the given status code.
es: Lanza una :exc:`~werkzeug.exceptions.HTTPException` para el código de estado dado.

source: If :data:`~flask.current_app` is available, it will call its :attr:`~flask.Flask.aborter` object, otherwise it will use :func:`werkzeug.exceptions.abort`.
es: Si :data:`~flask.current_app` está disponible, llamará a su objeto :attr:`~flask.Flask.aborter`, en caso contrario utilizará :func:`werkzeug.exceptions.abort`.

source: The status code for the exception, which must be registered in ``app.aborter``.
es: El código de estado de la excepción, que debe registrarse en ``app.aborter``.

source: Passed to the exception.
es: Pasó a la excepción.

source: Calls ``current_app.aborter`` if available instead of always using Werkzeug's default ``abort``.
es: Llama a ``current_app.aborter`` si está disponible en lugar de utilizar siempre el ``abort`` por defecto de Werkzeug.

source: If :data:`~flask.current_app` is available, it will use its :meth:`~flask.Flask.redirect` method, otherwise it will use :func:`werkzeug.utils.redirect`.
es: Si :data:`~flask.current_app` está disponible, utilizará su método :meth:`~flask.Flask.redirect`, en caso contrario utilizará :func:`werkzeug.utils.redirect`.

source: The response class to use. Not used when ``current_app`` is active, which uses ``app.response_class``.
es: La clase de respuesta a utilizar. No se utiliza cuando está activa ``current_app``, que utiliza ``app.response_class``.

source: Calls ``current_app.redirect`` if available instead of always using Werkzeug's default ``redirect``.
es: Llama a ``current_app.redirect`` si está disponible en lugar de usar siempre el ``redirect`` por defecto de Werkzeug.

source: Sometimes it is necessary to set additional headers in a view. Because views do not have to return response objects but can return a value that is converted into a response object by Flask itself, it becomes tricky to add headers to it. This function can be called instead of using a return and you will get a response object which you can use to attach headers.
es: A veces es necesario establecer cabeceras adicionales en una vista. Dado que las vistas no tienen que devolver objetos de respuesta sino que pueden devolver un valor que es convertido en un objeto de respuesta por el propio Flask, resulta complicado añadirle cabeceras. Se puede llamar a esta función en lugar de utilizar un retorno y se obtendrá un objeto respuesta que se puede utilizar para adjuntar cabeceras.

source: If view looked like this and you want to add a new header::
es: Si la vista tuviera este aspecto y quisiera añadir un nuevo encabezado::

source: You can now do something like this::
es: Ahora puedes hacer algo así::

source: This function accepts the very same arguments you can return from a view function. This for example creates a response with a 404 error code::
es: Esta función acepta los mismos argumentos que puede devolver una función de vista. Esto, por ejemplo, crea una respuesta con un código de error 404::

source: The other use case of this function is to force the return value of a view function into a response which is helpful with view decorators::
es: El otro caso de uso de esta función es forzar el valor de retorno de una función de vista en una respuesta que es útil con los decoradores de vista::

source: Internally this function does the following things:
es: Internamente esta función hace lo siguiente:

source: if no arguments are passed, it creates a new response argument
es: si no se pasan argumentos, crea un nuevo argumento de respuesta

source: if one argument is passed, :meth:`flask.Flask.make_response` is invoked with it.
es: si se pasa un argumento, se invoca :meth:`flask.Flask.make_response` con él.

source: if more than one argument is passed, the arguments are passed to the :meth:`flask.Flask.make_response` function as tuple.
es: si se pasa más de un argumento, los argumentos se pasan a la función :meth:`flask.Flask.make_response` como tupla.

source: Executes a function after this request. This is useful to modify response objects. The function is passed the response object and has to return the same or a new one.
es: Ejecuta una función después de esta solicitud. Esto es útil para modificar los objetos de respuesta. A la función se le pasa el objeto de respuesta y tiene que devolver el mismo o uno nuevo.

source: This is more useful if a function other than the view function wants to modify a response. For instance think of a decorator that wants to add some headers without converting the return value into a response object.
es: Esto es más útil si una función distinta de la función de la vista quiere modificar una respuesta. Por ejemplo, piensa en un decorador que quiera añadir algunas cabeceras sin convertir el valor de retorno en un objeto de respuesta.

source: Send the contents of a file to the client.
es: Enviar el contenido de un archivo al cliente.

source: The first argument can be a file path or a file-like object. Paths are preferred in most cases because Werkzeug can manage the file and get extra information from the path. Passing a file-like object requires that the file is opened in binary mode, and is mostly useful when building a file in memory with :class:`io.BytesIO`.
es: El primer argumento puede ser una ruta de archivo o un objeto similar a un archivo. Las rutas son preferibles en la mayoría de los casos porque Werkzeug puede gestionar el archivo y obtener información extra de la ruta. Pasar un objeto tipo archivo requiere que el archivo se abra en modo binario, y es mayormente útil cuando se construye un archivo en memoria con :class:`io.BytesIO`.

source: Never pass file paths provided by a user. The path is assumed to be trusted, so a user could craft a path to access a file you didn't intend. Use :func:`send_from_directory` to safely serve user-requested paths from within a directory.
es: Nunca pases rutas de archivos proporcionadas por un usuario. Se asume que la ruta es de confianza, por lo que un usuario podría elaborar una ruta para acceder a un archivo que no era su intención. Utilice :func:`send_from_directory` para servir de forma segura las rutas solicitadas por el usuario desde un directorio.

source: If the WSGI server sets a ``file_wrapper`` in ``environ``, it is used, otherwise Werkzeug's built-in wrapper is used. Alternatively, if the HTTP server supports ``X-Sendfile``, configuring Flask with ``USE_X_SENDFILE = True`` will tell the server to send the given path, which is much more efficient than reading it in Python.
es: Si el servidor WSGI establece un ``file_wrapper`` en ``environ``, se utiliza, de lo contrario se utiliza el wrapper incorporado de Werkzeug. Alternativamente, si el servidor HTTP soporta ``X-Sendfile``, configurando Flask con ``USE_X_SENDFILE = True`` le dirá al servidor que envíe la ruta dada, lo cual es mucho más eficiente que leerla en Python.

source: The path to the file to send, relative to the current working directory if a relative path is given. Alternatively, a file-like object opened in binary mode. Make sure the file pointer is seeked to the start of the data.
es: La ruta del archivo a enviar, relativa al directorio de trabajo actual si se da una ruta relativa. Alternativamente, un objeto tipo archivo abierto en modo binario. Asegúrese de que el puntero del archivo se busque al principio de los datos.

source: The MIME type to send for the file. If not provided, it will try to detect it from the file name.
es: El tipo MIME a enviar para el archivo. Si no se proporciona, intentará detectarlo a partir del nombre del archivo.

source: Indicate to a browser that it should offer to save the file instead of displaying it.
es: Indicar a un navegador que debe ofrecer guardar el archivo en lugar de mostrarlo.

source: The default name browsers will use when saving the file. Defaults to the passed file name.
es: El nombre por defecto que utilizarán los navegadores al guardar el archivo. El nombre por defecto es el nombre del archivo pasado.

source: Enable conditional and range responses based on request headers. Requires passing a file path and ``environ``.
es: Habilitar respuestas condicionales y de rango basadas en las cabeceras de las peticiones. Requiere pasar una ruta de archivo y ``environ``.

source: Calculate an ETag for the file, which requires passing a file path. Can also be a string to use instead.
es: Calcula un ETag para el archivo, que requiere pasar una ruta de archivo. También puede ser una cadena para usar en su lugar.

source: The last modified time to send for the file, in seconds. If not provided, it will try to detect it from the file path.
es: La última hora de modificación para enviar el archivo, en segundos. Si no se proporciona, intentará detectarla a partir de la ruta del archivo.

source: How long the client should cache the file, in seconds. If set, ``Cache-Control`` will be ``public``, otherwise it will be ``no-cache`` to prefer conditional caching.
es: El tiempo que el cliente debe almacenar en caché el archivo, en segundos. Si se establece, ``Cache-Control`` será ``public``, de lo contrario será ``no-cache`` para preferir el almacenamiento en caché condicional.

source: ``download_name`` replaces the ``attachment_filename`` parameter. If ``as_attachment=False``, it is passed with ``Content-Disposition: inline`` instead.
es: ``download_name`` sustituye al parámetro ``attachment_filename``. Si ``as_attachment=False``, se pasa con ``Content-Disposition: inline`` en su lugar.

source: ``max_age`` replaces the ``cache_timeout`` parameter. ``conditional`` is enabled and ``max_age`` is not set by default.
es: ``max_age`` sustituye al parámetro ``cache_timeout``. El parámetro ``conditional`` está activado y ``max_age`` no está establecido por defecto.

source: ``etag`` replaces the ``add_etags`` parameter. It can be a string to use instead of generating one.
es: ``etag`` sustituye al parámetro ``add_etags``. Puede ser una cadena para usar en lugar de generar una.

source: Passing a file-like object that inherits from :class:`~io.TextIOBase` will raise a :exc:`ValueError` rather than sending an empty file.
es: Al pasar un objeto tipo archivo que herede de :class:`~io.TextIOBase` se producirá un :exc:`ValueError` en lugar de enviar un archivo vacío.

source: Moved the implementation to Werkzeug. This is now a wrapper to pass some Flask-specific arguments.
es: Se ha trasladado la implementación a Werkzeug. Ahora es una envoltura para pasar algunos argumentos específicos de Flask.

source: ``filename`` may be a :class:`~os.PathLike` object.
es: ``filename`` puede ser un objeto :class:`~os.PathLike`.

source: Passing a :class:`~io.BytesIO` object supports range requests.
es: Pasar un objeto :class:`~io.BytesIO` soporta solicitudes de rango.

source: Filenames are encoded with ASCII instead of Latin-1 for broader compatibility with WSGI servers.
es: Los nombres de los archivos se codifican con ASCII en lugar de Latin-1 para una mayor compatibilidad con los servidores WSGI.

source: UTF-8 filenames as specified in :rfc:`2231` are supported.
es: Se admiten los nombres de archivo UTF-8 especificados en :rfc:`2231`.

source: The filename is no longer automatically inferred from file objects. If you want to use automatic MIME and etag support, pass a filename via ``filename_or_fp`` or ``attachment_filename``.
es: El nombre del archivo ya no se infiere automáticamente de los objetos de archivo. Si quieres utilizar el soporte automático de MIME y etags, pasa un nombre de archivo a través de ``filename_or_fp`` o ``attachment_filename``.

source: ``attachment_filename`` is preferred over ``filename`` for MIME detection.
es: Se prefiere ``attachment_filename`` a ``filename`` para la detección de MIME.

source: ``cache_timeout`` defaults to :meth:`Flask.get_send_file_max_age`.
es: ``cache_timeout`` por defecto es :meth:`Flask.get_send_file_max_age`.

source: The ``add_etags``, ``cache_timeout`` and ``conditional`` parameters were added. The default behavior is to add etags.
es: Se han añadido los parámetros ``add_etags``, ``cache_timeout`` y ``conditional``. El comportamiento por defecto es añadir etags.

source: Send a file from within a directory using :func:`send_file`.
es: Enviar un archivo desde un directorio utilizando :func:`send_file`.
