Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: List of languages this client accepts as :class:`~werkzeug.datastructures.LanguageAccept` object.
es: Lista de idiomas que este cliente acepta como objeto :class:`~werkzeug.datastructures.LanguageAccept`.

source: List of mimetypes this client supports as :class:`~werkzeug.datastructures.MIMEAccept` object.
es: Lista de mimetypes que este cliente soporta como objeto :class:`~werkzeug.datastructures.MIMEAccept`.

source: Sent with a preflight request to indicate which headers will be sent with the cross origin request. Set :attr:`~CORSResponseMixin.access_control_allow_headers` on the response to indicate which headers are allowed.
es: Se envía con una solicitud de verificación previa para indicar qué cabeceras se enviarán con la solicitud de origen cruzado. Establece :attr:`~CORSResponseMixin.access_control_allow_headers` en la respuesta para indicar qué cabeceras están permitidas.

source: Sent with a preflight request to indicate which method will be used for the cross origin request. Set :attr:`~CORSResponseMixin.access_control_allow_methods` on the response to indicate which methods are allowed.
es: Enviado con una solicitud de preflight para indicar qué método se utilizará para la solicitud de origen cruzado. Establece :attr:`~CORSResponseMixin.access_control_allow_methods` en la respuesta para indicar qué métodos están permitidos.

source: If a forwarded header exists this is a list of all ip addresses from the client ip to the last proxy server.
es: Si existe una cabecera de reenvío esta es una lista de todas las direcciones ip desde la ip del cliente hasta el último servidor proxy.

source: Decorate a function as responder that accepts the request as the last argument. This works like the :func:`responder` decorator but the function is passed the request object as the last argument and the request object will be closed automatically::
es: Decora una función como respondedor que acepta la petición como último argumento. Esto funciona como el decorador :func:`responder` pero a la función se le pasa el objeto request como último argumento y el objeto request se cerrará automáticamente::

source: As of Werkzeug 0.14 HTTP exceptions are automatically caught and converted to responses instead of failing.
es: A partir de Werkzeug 0.14 las excepciones HTTP se capturan automáticamente y se convierten en respuestas en lugar de fallar.

source: the WSGI callable to decorate
es: la llamada WSGI para decorar

source: a new WSGI callable
es: una nueva llamada WSGI

source: The parsed URL parameters (the part in the URL after the question mark).
es: Los parámetros de la URL analizados (la parte de la URL después del signo de interrogación).

source: By default an :class:`~werkzeug.datastructures.ImmutableMultiDict` is returned from this function. This can be changed by setting :attr:`parameter_storage_class` to a different type. This might be necessary if the order of the form data is important.
es: Por defecto, esta función devuelve una :class:`~werkzeug.datastructures.ImmutableMultiDict`. Esto puede cambiarse estableciendo :attr:`parameter_storage_class` a un tipo diferente. Esto puede ser necesario si el orden de los datos del formulario es importante.

source: Like :attr:`url` but without the query string.
es: Como :attr:`url` pero sin la cadena de consulta.

source: A :class:`~werkzeug.datastructures.RequestCacheControl` object for the incoming cache control headers.
es: Un objeto :class:`~werkzeug.datastructures.RequestCacheControl` para las cabeceras de control de caché entrantes.

source: Closes associated resources of this request object. This closes all file handles explicitly. You can also use the request object in a with statement which will automatically close it.
es: Cierra los recursos asociados a este objeto de petición. Esto cierra todos los manejadores de archivo explícitamente. También puede utilizar el objeto request en una sentencia with que lo cerrará automáticamente.

source: The Content-Encoding entity-header field is used as a modifier to the media-type. When present, its value indicates what additional content codings have been applied to the entity-body, and thus what decoding mechanisms must be applied in order to obtain the media-type referenced by the Content-Type header field.
es: El campo de cabecera de entidad Content-Encoding se utiliza como modificador del tipo de medio. Cuando está presente, su valor indica qué codificaciones de contenido adicionales se han aplicado al cuerpo de la entidad y, por tanto, qué mecanismos de descodificación deben aplicarse para obtener el tipo de medio al que se refiere el campo de cabecera Content-Type.

source: The Content-Length entity-header field indicates the size of the entity-body in bytes or, in the case of the HEAD method, the size of the entity-body that would have been sent had the request been a GET.
es: El campo Content-Length de la cabecera de la entidad indica el tamaño del cuerpo de la entidad en bytes o, en el caso del método HEAD, el tamaño del cuerpo de la entidad que se habría enviado si la solicitud hubiera sido un GET.

source: The Content-MD5 entity-header field, as defined in RFC 1864, is an MD5 digest of the entity-body for the purpose of providing an end-to-end message integrity check (MIC) of the entity-body. (Note: a MIC is good for detecting accidental modification of the entity-body in transit, but is not proof against malicious attacks.)
es: El campo de cabecera de entidad Content-MD5, tal y como se define en el RFC 1864, es un compendio MD5 del cuerpo de la entidad con el fin de proporcionar una comprobación de integridad del mensaje de extremo a extremo (MIC) del cuerpo de la entidad. (Nota: un MIC es bueno para detectar modificaciones accidentales del cuerpo de la entidad en tránsito, pero no es a prueba de ataques maliciosos).

source: The Content-Type entity-header field indicates the media type of the entity-body sent to the recipient or, in the case of the HEAD method, the media type that would have been sent had the request been a GET.
es: El campo Content-Type de la cabecera de la entidad indica el tipo de medio del cuerpo de la entidad enviado al destinatario o, en el caso del método HEAD, el tipo de medio que se habría enviado si la solicitud hubiera sido un GET.

source: A :class:`dict` with the contents of all cookies transmitted with the request.
es: Un :class:`dict` con el contenido de todas las cookies transmitidas con la solicitud.

source: The Date general-header field represents the date and time at which the message was originated, having the same semantics as orig-date in RFC 822.
es: El campo de cabecera general Date representa la fecha y hora en la que se originó el mensaje, teniendo la misma semántica que orig-date en RFC 822.

source: The datetime object is timezone-aware.
es: El objeto datetime tiene en cuenta la zona horaria.

source: :class:`~werkzeug.datastructures.MultiDict` object containing all uploaded files. Each key in :attr:`files` is the name from the ``<input type="file" name="">``. Each value in :attr:`files` is a Werkzeug :class:`~werkzeug.datastructures.FileStorage` object.
es: :class:`~werkzeug.datastructures.MultiDict` objeto que contiene todos los archivos subidos. Cada clave en :attr:`files` es el nombre del archivo ``<input type="file" name="">``. Cada valor en :attr:`files` es un objeto Werkzeug :class:`~werkzeug.datastructures.FileStorage`.

source: It basically behaves like a standard file object you know from Python, with the difference that it also has a :meth:`~werkzeug.datastructures.FileStorage.save` function that can store the file on the filesystem.
es: Básicamente se comporta como un objeto archivo estándar que conoces de Python, con la diferencia de que también tiene una función :meth:`~werkzeug.datastructures.FileStorage.save` que puede almacenar el archivo en el sistema de archivos.

source: Note that :attr:`files` will only contain data if the request method was POST, PUT or PATCH and the ``<form>`` that posted to the request had ``enctype="multipart/form-data"``. It will be empty otherwise.
es: Tenga en cuenta que :attr:`files` sólo contendrá datos si el método de solicitud fue POST, PUT o PATCH y el ``<form>`` que envió la solicitud tenía ``enctype="multipart/form-data"``. En caso contrario, estará vacío.

source: See the :class:`~werkzeug.datastructures.MultiDict` / :class:`~werkzeug.datastructures.FileStorage` documentation for more details about the used data structure.
es: Consulte la documentación de :class:`~werkzeug.datastructures.MultiDict` / :class:`~werkzeug.datastructures.FileStorage` para más detalles sobre la estructura de datos utilizada.

source: The form parameters. By default an :class:`~werkzeug.datastructures.ImmutableMultiDict` is returned from this function. This can be changed by setting :attr:`parameter_storage_class` to a different type. This might be necessary if the order of the form data is important.
es: Los parámetros del formulario. Por defecto, esta función devuelve una :class:`~werkzeug.datastructures.ImmutableMultiDict`. Esto puede cambiarse estableciendo :attr:`parameter_storage_class` a un tipo diferente. Esto puede ser necesario si el orden de los datos del formulario es importante.

source: Please keep in mind that file uploads will not end up here, but instead in the :attr:`files` attribute.
es: Por favor, tenga en cuenta que las subidas de archivos no acabarán aquí, sino en el atributo :attr:`files`.

source: Previous to Werkzeug 0.9 this would only contain form data for POST and PUT requests.
es: Antes de Werkzeug 0.9 esto sólo contenía datos de formulario para peticiones POST y PUT.

source: Create a new request object based on the values provided. If environ is given missing values are filled from there. This method is useful for small scripts when you need to simulate a request from an URL. Do not use this method for unittesting, there is a full featured client object (:class:`Client`) that allows to create multipart requests, support for cookies etc.
es: Crea un nuevo objeto de solicitud basado en los valores proporcionados. Si se da environ los valores que faltan se rellenan a partir de ahí. Este método es útil para pequeños scripts cuando se necesita simular una petición desde una URL. No utilice este método para pruebas unitarias, hay un objeto cliente completo (:class:`Client`) que permite crear peticiones multiparte, soporte para cookies, etc.

source: This accepts the same options as the :class:`~werkzeug.test.EnvironBuilder`.
es: Acepta las mismas opciones que el :class:`~werkzeug.test.EnvironBuilder`.

source: This method now accepts the same arguments as :class:`~werkzeug.test.EnvironBuilder`. Because of this the `environ` parameter is now called `environ_overrides`.
es: Este método acepta ahora los mismos argumentos que :class:`~werkzeug.test.EnvironBuilder`. Debido a esto el parámetro `environ` se llama ahora `environ_overrides`.

source: request object
es: objeto de la solicitud

source: Requested path, including the query string.
es: Ruta solicitada, incluyendo la cadena de consulta.

source: This reads the buffered incoming data from the client into one bytes object. By default this is cached but that behavior can be changed by setting `cache` to `False`.
es: Esto lee los datos entrantes en el buffer del cliente en un objeto de bytes. Por defecto se almacena en caché, pero este comportamiento puede cambiarse estableciendo `cache` a `False`.

source: Usually it's a bad idea to call this method without checking the content length first as a client could send dozens of megabytes or more to cause memory problems on the server.
es: Normalmente es una mala idea llamar a este método sin comprobar primero la longitud del contenido, ya que un cliente podría enviar docenas de megabytes o más y causar problemas de memoria en el servidor.

source: Note that if the form data was already parsed this method will not return anything as form data parsing does not cache the data like this method does. To implicitly invoke form data parsing function set `parse_form_data` to `True`. When this is done the return value of this method will be an empty string if the form parser handles the data. This generally is not necessary as if the whole data is cached (which is the default) the form parser will used the cached data to parse the form data. Please be generally aware of checking the content length first in any case before calling this method to avoid exhausting server memory.
es: Tenga en cuenta que si los datos del formulario ya han sido analizados, este método no devolverá nada, ya que el análisis de los datos del formulario no almacena en caché los datos como hace este método. Para invocar implícitamente la función de análisis de datos del formulario establezca `parse_form_data` a `True`. Cuando se hace esto el valor de retorno de este método será una cadena vacía si el analizador de formularios maneja los datos. Esto generalmente no es necesario, ya que si todos los datos se almacenan en caché (que es el valor predeterminado) el analizador de formularios utilizará los datos almacenados en caché para analizar los datos del formulario. Por favor, sea consciente de comprobar la longitud del contenido primero en cualquier caso antes de llamar a este método para evitar agotar la memoria del servidor.

source: If `as_text` is set to `True` the return value will be a decoded string.
es: Si `as_text` se establece como `True` el valor de retorno será una cadena decodificada.

source: Parse :attr:`data` as JSON.
es: Analiza :attr:`data` como JSON.

source: Ignore the mimetype and always try to parse JSON.
es: Ignora el mimetype e intenta siempre parsear JSON.

source: Silence mimetype and parsing errors, and return ``None`` instead.
es: Silencia los errores de mimetype y de parsing, y devuelve ``None`` en su lugar.

source: Store the parsed JSON to return for subsequent calls.
es: Almacena el JSON analizado para devolverlo en posteriores llamadas.

source: Raise a 400 error if the content type is incorrect.
es: Generar un error 400 si el tipo de contenido es incorrecto.

source: The host name the request was made to, including the port if it's non-standard. Validated with :attr:`trusted_hosts`.
es: El nombre del host al que se hizo la petición, incluyendo el puerto si no es estándar. Validado con :attr:`trusted_hosts`.

source: The request URL scheme and host only.
es: El esquema de la URL de la solicitud y el host solamente.

source: An object containing all the etags in the `If-Match` header.
es: Un objeto que contiene todas las etiquetas electrónicas de la cabecera `If-Match`.

source: The parsed `If-Modified-Since` header as a datetime object.
es: La cabecera `If-Modified-Since` analizada como un objeto datetime.

source: An object containing all the etags in the `If-None-Match` header.
es: Un objeto que contiene todas las etiquetas electrónicas de la cabecera `If-None-Match`.

source: The parsed ``If-Range`` header.
es: La cabecera ``If-Range`` analizada.

source: ``IfRange.date`` is timezone-aware.
es: ``IfRange.date`` tiene en cuenta la zona horaria.

source: The parsed `If-Unmodified-Since` header as a datetime object.
es: La cabecera `If-Unmodified-Since` analizada como un objeto datetime.

source: Check if the mimetype indicates JSON data, either :mimetype:`application/json` or :mimetype:`application/*+json`.
es: Comprueba si el mimetype indica datos JSON, ya sea :mimetype:`application/json` o :mimetype:`application/*+json`.

source: boolean that is `True` if the application is served by a WSGI server that spawns multiple processes.
es: booleano que es `True` si la aplicación es servida por un servidor WSGI que genera múltiples procesos.

source: boolean that is `True` if the application is served by a multithreaded WSGI server.
es: booleano que es `aTrue` si la aplicación es servida por un servidor WSGI multihilo.

source: boolean that is `True` if the application will be executed only once in a process lifetime. This is the case for CGI for example, but it's not guaranteed that the execution only happens one time.
es: booleano que es `True` si la aplicación se ejecutará sólo una vez en la vida del proceso. Este es el caso de CGI, por ejemplo, pero no está garantizado que la ejecución sólo se produzca una vez.

source: ``True`` if the request was made with a secure protocol (HTTPS or WSS).
es: ``True`` si la solicitud se hizo con un protocolo seguro (HTTPS o WSS).

source: The parsed JSON data if :attr:`mimetype` indicates JSON (:mimetype:`application/json`, see :attr:`is_json`).
es: Los datos JSON analizados si :attr:`mimetype` indica JSON (:mimetype:`application/json`, véase :attr:`is_json`).

source: Calls :meth:`get_json` with default arguments.
es: Llama a :meth:`get_json` con argumentos por defecto.

source: Creates the form data parser. Instantiates the :attr:`form_data_parser_class` with some parameters.
es: Crea el analizador de datos del formulario. Instala la clase :attr:`form_data_parser_class` con algunos parámetros.

source: The Max-Forwards request-header field provides a mechanism with the TRACE and OPTIONS methods to limit the number of proxies or gateways that can forward the request to the next inbound server.
es: El campo Max-Forwards de la cabecera de la petición proporciona un mecanismo con los métodos TRACE y OPTIONS para limitar el número de proxies o pasarelas que pueden reenviar la petición al siguiente servidor entrante.

source: Like :attr:`content_type`, but without parameters (eg, without charset, type etc.) and always lowercase. For example if the content type is ``text/HTML; charset=utf-8`` the mimetype would be ``'text/html'``.
es: Como :attr:`content_type`, pero sin parámetros (por ejemplo, sin charset, tipo, etc.) y siempre en minúsculas. Por ejemplo, si el tipo de contenido es ``text/HTML; charset=utf-8`` el mimetype sería ``'text/html'``.

source: The mimetype parameters as dict. For example if the content type is ``text/html; charset=utf-8`` the params would be ``{'charset': 'utf-8'}``.
es: Los parámetros de mimetype como dict. Por ejemplo, si el tipo de contenido es ``text/html; charset=utf-8`` los parámetros serían ``{'charset': 'utf-8'}``.

source: The host that the request originated from. Set :attr:`~CORSResponseMixin.access_control_allow_origin` on the response to indicate which origins are allowed.
es: El host desde el que se originó la solicitud. Establezca :attr:`~CORSResponseMixin.access_control_allow_origin` en la respuesta para indicar qué orígenes están permitidos.

source: The Pragma general-header field is used to include implementation-specific directives that might apply to any recipient along the request/response chain. All pragma directives specify optional behavior from the viewpoint of the protocol; however, some systems MAY require that behavior be consistent with the directives.
es: El campo Pragma general-header se utiliza para incluir directivas específicas de la implementación que podrían aplicarse a cualquier destinatario a lo largo de la cadena de solicitud/respuesta. Todas las directivas pragma especifican un comportamiento opcional desde el punto de vista del protocolo; sin embargo, algunos sistemas PUEDEN exigir que el comportamiento sea coherente con las directivas.

source: The parsed `Range` header.
es: La cabecera `Range` analizada.

source: The Referer[sic] request-header field allows the client to specify, for the server's benefit, the address (URI) of the resource from which the Request-URI was obtained (the "referrer", although the header field is misspelled).
es: El campo Referer[sic] request-header permite al cliente especificar, en beneficio del servidor, la dirección (URI) del recurso del que se obtuvo la Request-URI (el "referrer", aunque el campo de la cabecera está mal escrito).

source: If the server supports user authentication, and the script is protected, this attribute contains the username the user has authenticated as.
es: Si el servidor admite la autenticación del usuario, y el script está protegido, este atributo contiene el nombre de usuario con el que el usuario se ha autenticado.

source: The request URL scheme, host, and root path. This is the root that the application is accessed from.
es: El esquema de la URL de la solicitud, el host y la ruta raíz. Esta es la raíz desde la que se accede a la aplicación.

source: Alias for :attr:`self.root_path`. ``environ["SCRIPT_ROOT"]`` without a trailing slash.
es: Alias para :attr:`self.root_path`. ``environ["SCRIPT_ROOT"]`` sin una barra al final.

source: The full request URL with the scheme, host, root path, path, and query string.
es: La URL completa de la solicitud con el esquema, el host, la ruta raíz, la ruta y la cadena de consulta.

source: Alias for :attr:`root_url`. The URL with scheme, host, and root path. For example, ``https://example.com/app/``.
es: Alias de :attr:`root_url`. La URL con esquema, host y ruta raíz. Por ejemplo, ``https://example.com/app/``.

source: The user agent. Use ``user_agent.string`` to get the header value. Set :attr:`user_agent_class` to a subclass of :class:`~werkzeug.user_agent.UserAgent` to provide parsing for the other properties or other extended data.
es: El user agent. Utilice ``user_agent.string`` para obtener el valor de la cabecera. Establece :attr:`user_agent_class` a una subclase de :class:`~werkzeug.user_agent.UserAgent` para proporcionar el análisis de las otras propiedades u otros datos extendidos.

source: A :class:`werkzeug.datastructures.CombinedMultiDict` that combines :attr:`args` and :attr:`form`.
es: Una :class:`werkzeug.datastructures.CombinedMultiDict` que combina :attr:`args` y :attr:`form`.

source: For GET requests, only ``args`` are present, not ``form``.
es: En el caso de las peticiones GET, sólo están presentes los ``args``, no el ``form``.

source: ``True`` if the request method carries content. By default this is true if a ``Content-Type`` is sent.
es: ``True`` si el método de solicitud lleva contenido. Por defecto, esto es verdadero si se envía un ``Content-Type``.

source: The WSGI environment containing HTTP headers and information from the WSGI server.
es: El entorno WSGI que contiene las cabeceras HTTP y la información del servidor WSGI.

source: Set when creating the request object. If ``True``, reading from the request body will cause a ``RuntimeException``. Useful to prevent modifying the stream from middleware.
es: Se establece al crear el objeto de la petición. Si ``True``, la lectura del cuerpo de la petición causará una ``RuntimeException``. Útil para evitar la modificación del flujo desde el middleware.

source: The method the request was made with, such as ``GET``.
es: El método con el que se hizo la petición, como ``GET``.

source: The URL scheme of the protocol the request used, such as ``https`` or ``wss``.
es: El esquema de la URL del protocolo que la solicitud utilizó, como ``https`` o ``wss``.

source: The address of the server. ``(host, port)``, ``(path, None)`` for unix sockets, or ``None`` if not known.
es: La dirección del servidor. ``(host, port)``, ``(path, None)`` para sockets unix, o ``None`` si no se conoce.

source: The prefix that the application is mounted under, without a trailing slash. :attr:`path` comes after this.
es: El prefijo con el que se monta la aplicación, sin una barra al final. :attr:`path` viene después de esto.

source: The path part of the URL after :attr:`root_path`. This is the path used for routing within the application.
es: La parte de la ruta de la URL después de :attr:`root_path`. Esta es la ruta utilizada para el enrutamiento dentro de la aplicación.

source: The part of the URL after the "?". This is the raw value, use :attr:`args` for the parsed values.
es: La parte de la URL después del "?". Este es el valor bruto, utilice :attr:`args` para los valores analizados.
