Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: Do not attempt to use this class directly, instead use :meth:`~flask.Flask.test_request_context` and :meth:`~flask.Flask.request_context` to create this object.
es: No intente utilizar esta clase directamente, en su lugar utilice :meth:`~flask.Flask.test_request_context` y :meth:`~flask.Flask.request_context` para crear este objeto.

source: When the request context is popped, it will evaluate all the functions registered on the application for teardown execution (:meth:`~flask.Flask.teardown_request`).
es: Cuando el contexto de la petición se abre, evaluará todas las funciones registradas en la aplicación para la ejecución de teardown (:meth:`~flask.Flask.teardown_request`).

source: The request context is automatically popped at the end of the request. When using the interactive debugger, the context will be restored so ``request`` is still accessible. Similarly, the test client can preserve the context after the request ends. However, teardown functions may already have closed some resources such as database connections.
es: El contexto de la petición es automáticamente extraído al final de la petición. Cuando se utiliza el depurador interactivo, el contexto será restaurado para que ``request`` siga siendo accesible. Del mismo modo, el cliente de prueba puede preservar el contexto después de que la solicitud termine. Sin embargo, las funciones de desmontaje pueden haber cerrado ya algunos recursos, como las conexiones a la base de datos.

source: Creates a copy of this request context with the same request object. This can be used to move a request context to a different greenlet. Because the actual request object is the same this cannot be used to move a request context to a different thread unless access to the request object is locked.
es: Crea una copia de este contexto de solicitud con el mismo objeto de solicitud. Esto puede ser usado para mover un contexto de petición a un greenlet diferente. Debido a que el objeto de solicitud real es el mismo, esto no se puede utilizar para mover un contexto de solicitud a un hilo diferente a menos que el acceso al objeto de solicitud esté bloqueado.

source: The current session object is used instead of reloading the original data. This prevents `flask.session` pointing to an out-of-date object.
es: Se utiliza el objeto de sesión actual en lugar de recargar los datos originales. Esto evita que `flask.session` apunte a un objeto desactualizado.

source: Can be overridden by a subclass to hook into the matching of the request.
es: Puede ser sobrescrito por una subclase para engancharse a la coincidencia de la solicitud.

source: Pops the request context and unbinds it by doing that. This will also trigger the execution of functions registered by the :meth:`~flask.Flask.teardown_request` decorator.
es: Despliega el contexto de la solicitud y lo desvincula al hacerlo. Esto también desencadenará la ejecución de las funciones registradas por el decorador :meth:`~flask.Flask.teardown_request`.

source: Added the `exc` argument.
es: Se ha añadido el argumento `exc`.

source: The current :class:`~flask.ctx.RequestContext`. If a request context is not active, accessing attributes on this proxy will raise a ``RuntimeError``.
es: La :class:`~flask.ctx.RequestContext` actual. Si un contexto de solicitud no está activo, el acceso a los atributos de este proxy generará un ``RuntimeError``.

source: This is an internal object that is essential to how Flask handles requests. Accessing this should not be needed in most cases. Most likely you want :data:`request` and :data:`session` instead.
es: Este es un objeto interno que es esencial para la forma en que Flask maneja las solicitudes. En la mayoría de los casos no debería ser necesario acceder a él. Lo más probable es que quieras :data:`request` y :data:`session` en su lugar.

source: The app context contains application-specific information. An app context is created and pushed at the beginning of each request if one is not already active. An app context is also pushed when running CLI commands.
es: El contexto de la aplicación contiene información específica de la aplicación. Se crea un contexto de aplicación y se envía al principio de cada solicitud si no hay uno activo. También se envía un contexto de aplicación cuando se ejecutan comandos CLI.

source: Binds the app context to the current context.
es: Vincula el contexto de la aplicación al contexto actual.

source: Pops the app context.
es: Muestra el contexto de la aplicación.

source: The current :class:`~flask.ctx.AppContext`. If an app context is not active, accessing attributes on this proxy will raise a ``RuntimeError``.
es: La actual :class:`~flask.ctx.AppContext`. Si un contexto de aplicación no está activo, el acceso a los atributos de este proxy generará un ``RuntimeError``.

source: This is an internal object that is essential to how Flask handles requests. Accessing this should not be needed in most cases. Most likely you want :data:`current_app` and :data:`g` instead.
es: Este es un objeto interno que es esencial para la forma en que Flask maneja las solicitudes. En la mayoría de los casos no debería ser necesario acceder a él. Lo más probable es que quieras :data:`current_app` y :data:`g` en su lugar.

source: Temporary holder object for registering a blueprint with the application. An instance of this class is created by the :meth:`~flask.Blueprint.make_setup_state` method and later passed to all register callback functions.
es: Objeto portador temporal para registrar un blueprint con la aplicación. Una instancia de esta clase es creada por el método :meth:`~flask.Blueprint.make_setup_state` y posteriormente pasada a todas las funciones de callback de registro.

source: a reference to the current application
es: una referencia a la aplicación actual

source: a reference to the blueprint that created this setup state.
es: una referencia al plano que creó este estado de configuración.

source: a dictionary with all options that were passed to the :meth:`~flask.Flask.register_blueprint` method.
es: un diccionario con todas las opciones que se pasaron al método :meth:`~flask.Flask.register_blueprint`.

source: as blueprints can be registered multiple times with the application and not everything wants to be registered multiple times on it, this attribute can be used to figure out if the blueprint was registered in the past already.
es: como los blueprints pueden ser registrados varias veces en la aplicación y no todo quiere ser registrado varias veces en ella, este atributo puede ser utilizado para averiguar si el blueprint ya fue registrado en el pasado.

source: The subdomain that the blueprint should be active for, ``None`` otherwise.
es: El subdominio para el que debe estar activo el blueprint, ``None`` en caso contrario.

source: The prefix that should be used for all URLs defined on the blueprint.
es: El prefijo que debe usarse para todas las URLs definidas en el blueprint.

source: A dictionary with URL defaults that is added to each and every URL that was defined with the blueprint.
es: Un diccionario con los valores predeterminados de la URL que se añade a todas y cada una de las URL que se definieron con el plano.

source: A helper method to register a rule (and optionally a view function) to the application. The endpoint is automatically prefixed with the blueprint's name.
es: Un método de ayuda para registrar una regla (y opcionalmente una función de vista) en la aplicación. El punto final se prefija automáticamente con el nombre del blueprint.

source: Signals
es: Señales

source: Example subscriber::
es: Ejemplo de suscriptor::

source: This signal is sent before template rendering process. The signal is invoked with the instance of the template as `template` and the context as dictionary (named `context`).
es: Esta señal se envía antes del proceso de renderización de la plantilla. La señal se invoca con la instancia de la plantilla como `template` y el contexto como diccionario (llamado `context`).

source: This signal is sent right before the response is sent to the client. It is passed the response to be sent named `response`.
es: Esta señal se envía justo antes de que se envíe la respuesta al cliente. Se le pasa la respuesta a enviar llamada `response`.

source: This signal is sent when an unhandled exception happens during request processing, including when debugging. The exception is passed to the subscriber as ``exception``.
es: Esta señal se envía cuando se produce una excepción no controlada durante el procesamiento de la solicitud, incluso durante la depuración. La excepción se pasa al suscriptor como ``excepción``.

source: This signal is not sent for :exc:`~werkzeug.exceptions.HTTPException`, or other exceptions that have error handlers registered, unless the exception was raised from an error handler.
es: Esta señal no se envía para :exc:`~werkzeug.exceptions.HTTPException`, u otras excepciones que tengan manejadores de error registrados, a menos que la excepción haya sido lanzada desde un manejador de errores.

source: This example shows how to do some extra logging if a theoretical ``SecurityException`` was raised:
es: Este ejemplo muestra cómo hacer un registro extra si una teórica ``SecurityException`` fue levantada:

source: As of Flask 0.9, this will also be passed an `exc` keyword argument that has a reference to the exception that caused the teardown if there was one.
es: A partir de Flask 0.9, también se le pasará un argumento de la palabra clave `exc` que tiene una referencia a la excepción que causó el teardown si es que hubo una.

source: This will also be passed an `exc` keyword argument that has a reference to the exception that caused the teardown if there was one.
es: También se le pasará un argumento de la palabra clave `exc` que tiene una referencia a la excepción que causó el derribo si es que la hubo.

source: Example usage::
es: Ejemplo de uso::

source: And in the testcode::
es: Y en el testcode::

source: Class-Based Views
es: Vistas basadas en clases

source: Subclass this class and override :meth:`dispatch_request` to create a generic class-based view. Call :meth:`as_view` to create a view function that creates an instance of the class with the given arguments and calls its ``dispatch_request`` method with any URL variables.
es: Subclase de esta clase y anular :meth:`dispatch_request` para crear una vista genérica basada en la clase. Llame a :meth:`as_view` para crear una función de vista que cree una instancia de la clase con los argumentos dados y llame a su método ``dispatch_request`` con cualquier variable de la URL.

source: See :doc:`views` for a detailed guide.
es: Consulte :doc:`views` para obtener una guía detallada.

source: Set :attr:`methods` on the class to change what methods the view accepts.
es: Establezca :attr:`methods` en la clase para cambiar los métodos que acepta la vista.

source: Set :attr:`decorators` on the class to apply a list of decorators to the generated view function. Decorators applied to the class itself will not be applied to the generated view function!
es: Establezca :attr:`decorators` en la clase para aplicar una lista de decoradores a la función de vista generada ¡Los decoradores aplicados a la propia clase no se aplicarán a la función de vista generada!

source: Set :attr:`init_every_request` to ``False`` for efficiency, unless you need to store request-global data on ``self``.
es: Establece :attr:`init_every_request` a ``False`` para mayor eficiencia, a menos que necesites almacenar datos globales de la solicitud en ``self``.

source: The methods this view is registered for. Uses the same default (``["GET", "HEAD", "OPTIONS"]``) as ``route`` and ``add_url_rule`` by default.
es: Los métodos para los que se registra esta vista. Utiliza el mismo valor por defecto (``["GET", "HEAD", "OPTIONS"]``) que ``route`` y ``add_url_rule`` por defecto.

source: Control whether the ``OPTIONS`` method is handled automatically. Uses the same default (``True``) as ``route`` and ``add_url_rule`` by default.
es: Controla si el método ``OPTIONS`` se maneja automáticamente. Utiliza el mismo valor por defecto (``True``) que ``route`` y ``add_url_rule`` por defecto.

source: A list of decorators to apply, in order, to the generated view function. Remember that ``@decorator`` syntax is applied bottom to top, so the first decorator in the list would be the bottom decorator.
es: Una lista de decoradores para aplicar, en orden, a la función de vista generada. Recuerda que la sintaxis ``@decorator`` se aplica de abajo a arriba, por lo que el primer decorador de la lista sería el decorador inferior.

source: Create a new instance of this view class for every request by default. If a view subclass sets this to ``False``, the same instance is used for every request.
es: Crea una nueva instancia de esta clase de vista para cada solicitud por defecto. Si una subclase de la vista establece esto como ``False``, se utiliza la misma instancia para cada solicitud.

source: A single instance is more efficient, especially if complex setup is done during init. However, storing data on ``self`` is no longer safe across requests, and :data:`~flask.g` should be used instead.
es: Una sola instancia es más eficiente, especialmente si se realiza una configuración compleja durante el init. Sin embargo, el almacenamiento de datos en ``self`` ya no es seguro a través de las solicitudes, y :data:`~flask.g` debe ser utilizado en su lugar.

source: The actual view function behavior. Subclasses must override this and return a valid response. Any variables from the URL rule are passed as keyword arguments.
es: El comportamiento real de la función de la vista. Las subclases deben anular esto y devolver una respuesta válida. Cualquier variable de la regla de la URL se pasa como argumento de la palabra clave.

source: Convert the class into a view function that can be registered for a route.
es: Convierte la clase en una función de vista que puede ser registrada para una ruta.

source: By default, the generated view will create a new instance of the view class for every request and call its :meth:`dispatch_request` method. If the view class sets :attr:`init_every_request` to ``False``, the same instance will be used for every request.
es: Por defecto, la vista generada creará una nueva instancia de la clase view para cada petición y llamará a su método :meth:`dispatch_request`. Si la clase de vista establece :attr:`init_every_request` a ``False``, se utilizará la misma instancia para cada solicitud.

source: Added the ``init_every_request`` class attribute.
es: Añadido el atributo de clase ``init_every_request``.

source: Dispatches request methods to the corresponding instance methods. For example, if you implement a ``get`` method, it will be used to handle ``GET`` requests.
es: Envía los métodos de solicitud a los métodos de instancia correspondientes. Por ejemplo, si implementas un método ``get``, se utilizará para gestionar las peticiones ``GET``.

source: This can be useful for defining a REST API.
es: Esto puede ser útil para definir una API REST.

source: :attr:`methods` is automatically set based on the methods defined on the class.
es: :attr:`methods` se establece automáticamente en función de los métodos definidos en la clase.

source: URL Route Registrations
es: Registros de rutas URL

source: Generally there are three ways to define rules for the routing system:
es: En general, hay tres maneras de definir las reglas del sistema de enrutamiento:

source: You can use the :meth:`flask.Flask.route` decorator.
es: Puede utilizar el decorador :meth:`flask.Flask.route`.

source: You can use the :meth:`flask.Flask.add_url_rule` function.
es: Puedes utilizar la función :meth:`flask.Flask.add_url_rule`.

source: You can directly access the underlying Werkzeug routing system which is exposed as :attr:`flask.Flask.url_map`.
es: Puedes acceder directamente al sistema de enrutamiento subyacente de Werkzeug que se expone como :attr:`flask.Flask.url_map`.

source: Variable parts are passed to the view function as keyword arguments.
es: Las partes variables se pasan a la función de la vista como argumentos de palabra clave.

source: The following converters are available:
es: Están disponibles los siguientes convertidores:

source: accepts any text without a slash (the default)
es: acepta cualquier texto sin barra (por defecto)

source: accepts integers
es: acepta números enteros

source: like `int` but for floating point values
es: como `int` pero para valores de punto flotante

source: like the default but also accepts slashes
es: como el predeterminado, pero también acepta barras inclinadas

source: matches one of the items provided
es: coincide con uno de los elementos previstos

source: accepts UUID strings
es: acepta cadenas UUID

source: Custom converters can be defined using :attr:`flask.Flask.url_map`.
es: Los convertidores personalizados pueden ser definidos usando :attr:`flask.Flask.url_map`.

source: Here are some examples::
es: He aquí algunos ejemplos::

source: If a rule ends with a slash and is requested without a slash by the user, the user is automatically redirected to the same page with a trailing slash attached.
es: Si una regla termina con una barra y es solicitada sin barra por el usuario, éste es redirigido automáticamente a la misma página con una barra al final.

source: If a rule does not end with a trailing slash and the user requests the page with a trailing slash, a 404 not found is raised.
es: Si una regla no termina con una barra final y el usuario solicita la página con una barra final, se genera un 404 no encontrado.

source: This specifies that ``/users/`` will be the URL for page one and ``/users/page/N`` will be the URL for page ``N``.
es: Esto especifica que ``/users/`` será la URL de la página uno y ``/users/page/N`` será la URL de la página ``N``.

source: If a URL contains a default value, it will be redirected to its simpler form with a 301 redirect. In the above example, ``/users/page/1`` will be redirected to ``/users/``. If your route handles ``GET`` and ``POST`` requests, make sure the default route only handles ``GET``, as redirects can't preserve form data. ::
es: Si una URL contiene un valor por defecto, será redirigida a su forma más simple con una redirección 301. En el ejemplo anterior, ``/users/page/1`` será redirigida a ``/users/``. Si tu ruta maneja solicitudes ``GET`` y ``POST``, asegúrate de que la ruta por defecto sólo maneja ``GET``, ya que las redirecciones no pueden conservar los datos del formulario. ::

source: the URL rule as string
es: la regla URL como cadena

source: View Function Options
es: Ver opciones de funciones

source: For internal usage the view functions can have some attributes attached to customize behavior the view function would normally not have control over. The following attributes can be provided optionally to either override some defaults to :meth:`~flask.Flask.add_url_rule` or general behavior:
es: Para uso interno las funciones de vista pueden tener algunos atributos adjuntos para personalizar el comportamiento sobre el que la función de vista normalmente no tendría control. Los siguientes atributos se pueden proporcionar opcionalmente para anular algunos valores predeterminados de :meth:`~flask.Flask.add_url_rule` o el comportamiento general:

source: `required_methods`: if this attribute is set, Flask will always add these methods when registering a URL rule even if the methods were explicitly overridden in the ``route()`` call.
es: `required_methods`: Si se establece este atributo, Flask siempre añadirá estos métodos al registrar una regla de URL, incluso si los métodos fueron explícitamente anulados en la llamada a ``route()``.

source: Full example::
es: Ejemplo completo::

source: The `provide_automatic_options` functionality was added.
es: Se ha añadido la funcionalidad `provide_automatic_options`.

source: Command Line Interface
es: Interfaz de línea de comandos

source: Special subclass of the :class:`AppGroup` group that supports loading more commands from the configured Flask app. Normally a developer does not have to interface with this class but there are some very advanced use cases for which it makes sense to create an instance of this. see :ref:`custom-scripts`.
es: Subclase especial del grupo :class:`AppGroup` que soporta la carga de más comandos de la aplicación Flask configurada. Normalmente un desarrollador no tiene que interactuar con esta clase pero hay algunos casos de uso muy avanzados para los que tiene sentido crear una instancia de esto. ver :ref:`custom-scripts`.

source: if this is True then the default run and shell commands will be added.
es: si es True, se añadirán los comandos de ejecución y shell por defecto.

source: adds the ``--version`` option.
es: añade la opción ``--versión``.

source: an optional callback that is passed the script info and returns the loaded app.
es: un callback opcional al que se le pasa la información del script y devuelve la aplicación cargada.

source: An app context is pushed when running ``app.cli`` commands, so ``@with_appcontext`` is no longer required for those commands.
es: Al ejecutar los comandos ``app.cli`` se envía un contexto de aplicación, por lo que ``@with_appcontext`` ya no es necesario para esos comandos.

source: Given a context and a command name, this returns a :class:`Command` object if it exists or returns `None`.
es: Dado un contexto y un nombre de comando, devuelve un objeto :class:`Command` si existe o devuelve `None`.

source: Returns a list of subcommand names in the order they should appear.
es: Devuelve una lista de nombres de subcomandos en el orden en que deben aparecer.

source: This function when given an info name and arguments will kick off the parsing and create a new :class:`Context`. It does not invoke the actual command callback though.
es: Esta función, cuando se le da un nombre de información y argumentos, iniciará el análisis y creará un nuevo :class:`Context`. Sin embargo, no invoca la llamada de retorno del comando real.

source: To quickly customize the context class used without overriding this method, set the :attr:`context_class` attribute.
es: Para personalizar rápidamente la clase de contexto utilizada sin sobrescribir este método, establezca el atributo :attr:`context_class`.

source: the arguments to parse as list of strings.
es: los argumentos a analizar como lista de cadenas.

source: the parent context if available.
es: el contexto padre si está disponible.

source: extra keyword arguments forwarded to the context constructor.
es: argumentos clave extras enviados al constructor del contexto.

source: Added the :attr:`context_class` attribute.
es: Se ha añadido el atributo :attr:`context_class`.

source: Given a context and a list of arguments this creates the parser and parses the arguments, then modifies the context as necessary. This is automatically invoked by :meth:`make_context`.
es: Dado un contexto y una lista de argumentos, crea el analizador y analiza los argumentos, luego modifica el contexto según sea necesario. Esto es invocado automáticamente por :meth:`make_context`.

source: This works similar to a regular click :class:`~click.Group` but it changes the behavior of the :meth:`command` decorator so that it automatically wraps the functions in :func:`with_appcontext`.
es: Esto funciona de forma similar a un clic normal :class:`~click.Group` pero cambia el comportamiento del decorador :meth:`command` para que envuelva automáticamente las funciones en :func:`with_appcontext`.

source: Not to be confused with :class:`FlaskGroup`.
es: No debe confundirse con :class:`FlaskGroup`.
