Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: A decorator that is used to register a custom template global function. You can specify a name for the global function, otherwise the function name will be used. Example::
es: Un decorador que se utiliza para registrar una función global de plantilla personalizada. Puede especificar un nombre para la función global, de lo contrario se utilizará el nombre de la función. Ejemplo::

source: A decorator that is used to register custom template test. You can specify a name for the test, otherwise the function name will be used. Example::
es: Un decorador que se utiliza para registrar la prueba de plantilla personalizada. Puede especificar un nombre para la prueba, de lo contrario se utilizará el nombre de la función. Ejemplo::

source: The :class:`~click.testing.CliRunner` subclass, by default :class:`~flask.testing.FlaskCliRunner` that is used by :meth:`test_cli_runner`. Its ``__init__`` method should take a Flask app object as the first argument.
es: La subclase :class:`~click.testing.CliRunner`, por defecto :class:`~flask.testing.FlaskCliRunner` que es utilizada por :meth:`test_cli_runner`. Su método ``__init__`` debe tomar un objeto de aplicación Flask como primer argumento.

source: The :meth:`test_client` method creates an instance of this test client class. Defaults to :class:`~flask.testing.FlaskClient`.
es: El método :meth:`test_client` crea una instancia de esta clase de cliente de pruebas. Por defecto es :class:`~flask.testing.FlaskClient`.

source: The testing flag. Set this to ``True`` to enable the test mode of Flask extensions (and in the future probably also Flask itself). For example this might activate test helpers that have an additional runtime cost which should not be enabled by default.
es: La bandera de prueba. Establece esto como ``True`` para activar el modo de prueba de las extensiones de Flask (y en el futuro probablemente también el propio Flask). Por ejemplo, esto podría activar los ayudantes de prueba que tienen un coste de tiempo de ejecución adicional que no debería estar habilitado por defecto.

source: If this is enabled and PROPAGATE_EXCEPTIONS is not changed from the default it's implicitly enabled.
es: Si se habilita y no se cambia PROPAGATE_EXCEPTIONS del valor por defecto, se habilita implícitamente.

source: This attribute can also be configured from the config with the ``TESTING`` configuration key. Defaults to ``False``.
es: Este atributo también se puede configurar desde la configuración con la clave de configuración ``TESTING``. El valor predeterminado es ``False``.

source: Checks if an HTTP exception should be trapped or not. By default this will return ``False`` for all exceptions except for a bad request key error if ``TRAP_BAD_REQUEST_ERRORS`` is set to ``True``. It also returns ``True`` if ``TRAP_HTTP_EXCEPTIONS`` is set to ``True``.
es: Comprueba si una excepción HTTP debe ser atrapada o no. Por defecto devuelve ``False`` para todas las excepciones excepto para un error de clave de petición si ``TRAP_BAD_REQUEST_ERRORS`` se establece como ``True``. También devuelve ``True`` si ``TRAP_HTTP_EXCEPTIONS`` es ``True``.

source: This is called for all HTTP exceptions raised by a view function. If it returns ``True`` for any exception the error handler for this exception is not called and it shows up as regular exception in the traceback. This is helpful for debugging implicitly raised HTTP exceptions.
es: Se llama para todas las excepciones HTTP lanzadas por una función de la vista. Si devuelve ``True`` para cualquier excepción, el manejador de errores para esta excepción no es llamado y se muestra como una excepción regular en el rastreo. Esto es útil para depurar excepciones HTTP implícitas.

source: Bad request errors are not trapped by default in debug mode.
es: Los errores de peticiones malas no se atrapan por defecto en el modo de depuración.

source: Callback function for URL defaults for all view functions of the application. It's called with the endpoint and values and should update the values passed in place.
es: Función de devolución de llamada para los valores predeterminados de la URL para todas las funciones de vista de la aplicación. Se llama con el endpoint y los valores y debe actualizar los valores pasados en su lugar.

source: Register a URL value preprocessor function for all view functions in the application. These functions will be called before the :meth:`before_request` functions.
es: Registrar una función de preprocesador de valores de URL para todas las funciones de vista en la aplicación. Estas funciones serán llamadas antes de las funciones :meth:`before_request`.

source: The function can modify the values captured from the matched url before they are passed to the view. For example, this can be used to pop a common language code value and place it in ``g`` rather than pass it to every view.
es: La función puede modificar los valores capturados de la url coincidente antes de pasarlos a la vista. Por ejemplo, se puede utilizar para hacer saltar un valor de código de lenguaje común y colocarlo en ``g`` en lugar de pasarlo a cada vista.

source: The function is passed the endpoint name and values dict. The return value is ignored.
es: A la función se le pasa el nombre del endpoint y el dictado de valores. El valor de retorno se ignora.

source: Holds the path to the instance folder.
es: Contiene la ruta de la carpeta de la instancia.

source: The configuration dictionary as :class:`Config`. This behaves exactly like a regular dictionary but supports additional methods to load a config from files.
es: El diccionario de configuración como :class:`Config`. Se comporta exactamente como un diccionario normal, pero admite métodos adicionales para cargar una configuración desde archivos.

source: An instance of :attr:`aborter_class` created by :meth:`make_aborter`. This is called by :func:`flask.abort` to raise HTTP errors, and can be called directly as well.
es: Una instancia de :attr:`aborter_class` creada por :meth:`make_aborter`. Es llamado por :func:`flask.abort` para lanzar errores HTTP, y también puede ser llamado directamente.

source: Moved from ``flask.abort``, which calls this object.
es: Movido de ``flask.abort``, que llama a este objeto.

source: A list of functions that are called by :meth:`handle_url_build_error` when :meth:`.url_for` raises a :exc:`~werkzeug.routing.BuildError`. Each function is called with ``error``, ``endpoint`` and ``values``. If a function returns ``None`` or raises a ``BuildError``, it is skipped. Otherwise, its return value is returned by ``url_for``.
es: Una lista de funciones que son llamadas por :meth:`handle_url_build_error` cuando :meth:`.url_for` genera un :exc:`~werkzeug.routing.BuildError`. Cada función es llamada con ``error``, ``endpoint`` y ``values``. Si una función devuelve ``None`` o genera un ``BuildError``, se omite. De lo contrario, su valor de retorno es devuelto por ``url_for``.

source: A list of functions that are called when the application context is destroyed. Since the application context is also torn down if the request ends this is the place to store code that disconnects from databases.
es: Una lista de funciones que son llamadas cuando el contexto de la aplicación es destruido. Dado que el contexto de la aplicación también se destruye si la solicitud termina, este es el lugar para almacenar el código que se desconecta de las bases de datos.

source: A list of shell context processor functions that should be run when a shell context is created.
es: Una lista de funciones del procesador de contextos de shell que deben ejecutarse cuando se crea un contexto de shell.

source: Maps registered blueprint names to blueprint objects. The dict retains the order the blueprints were registered in. Blueprints can be registered multiple times, this dict does not track how often they were attached.
es: Asigna nombres de planos registrados a objetos de planos. El dictado conserva el orden en que se registraron los planos. Los planos se pueden registrar varias veces, este dict no registra la frecuencia con la que se adjuntaron.

source: a place where extensions can store application specific state. For example this is where an extension could store database engines and similar things.
es: un lugar donde las extensiones pueden almacenar el estado específico de la aplicación. Por ejemplo, aquí es donde una extensión podría almacenar motores de bases de datos y cosas similares.

source: The key must match the name of the extension module. For example in case of a "Flask-Foo" extension in `flask_foo`, the key would be ``'foo'``.
es: La clave debe coincidir con el nombre del módulo de extensión. Por ejemplo, en el caso de una extensión "Flask-Foo" en `flask_foo`, la clave sería ``'foo'``.

source: The :class:`~werkzeug.routing.Map` for this instance. You can use this to change the routing converters after the class was created but before any routes are connected. Example::
es: La :class:`~werkzeug.routing.Map` para esta instancia. Se puede utilizar para cambiar los convertidores de enrutamiento después de la creación de la clase pero antes de que se conecte ninguna ruta. Ejemplo::

source: The name of the package or module that this object belongs to. Do not change this once it is set by the constructor.
es: El nombre del paquete o módulo al que pertenece este objeto. No lo cambie una vez que lo haya establecido el constructor.

source: The path to the templates folder, relative to :attr:`root_path`, to add to the template loader. ``None`` if templates should not be added.
es: La ruta a la carpeta de plantillas, relativa a :attr:`root_path`, para añadir al cargador de plantillas. ``None`` si no se deben añadir plantillas.

source: Absolute path to the package on the filesystem. Used to look up resources contained in the package.
es: Ruta absoluta del paquete en el sistema de archivos. Se utiliza para buscar los recursos contenidos en el paquete.

source: A dictionary mapping endpoint names to view functions.
es: Un diccionario que asigna los nombres de los endpoints a las funciones de la vista.

source: To register a view function, use the :meth:`route` decorator.
es: Para registrar una función de vista, utilice el decorador :meth:`route`.

source: This data structure is internal. It should not be modified directly and its format may change at any time.
es: Esta estructura de datos es interna. No debe modificarse directamente y su formato puede cambiar en cualquier momento.

source: A data structure of registered error handlers, in the format ``{scope: {code: {class: handler}}}``. The ``scope`` key is the name of a blueprint the handlers are active for, or ``None`` for all requests. The ``code`` key is the HTTP status code for ``HTTPException``, or ``None`` for other exceptions. The innermost dictionary maps exception classes to handler functions.
es: Una estructura de datos de los gestores de errores registrados, con el formato ``scope: {code: {class: handler}}``. La clave ``scope`` es el nombre de un plano para el que los manejadores están activos, o ``None`` para todas las peticiones. La clave ``code`` es el código de estado HTTP para ``HTTPException``, o ``None`` para otras excepciones. El diccionario más interno asigna las clases de excepción a las funciones de los manejadores.

source: To register an error handler, use the :meth:`errorhandler` decorator.
es: Para registrar un manejador de errores, utilice el decorador :meth:`errorhandler`.

source: A data structure of functions to call at the beginning of each request, in the format ``{scope: [functions]}``. The ``scope`` key is the name of a blueprint the functions are active for, or ``None`` for all requests.
es: Una estructura de datos de funciones a llamar al principio de cada petición, con el formato ``{scope: [functions]}``. La clave ``scope`` es el nombre de un plano para el que las funciones están activas, o ``None`` para todas las peticiones.

source: To register a function, use the :meth:`before_request` decorator.
es: Para registrar una función, utilice el decorador :meth:`before_request`.

source: A data structure of functions to call at the end of each request, in the format ``{scope: [functions]}``. The ``scope`` key is the name of a blueprint the functions are active for, or ``None`` for all requests.
es: Una estructura de datos de funciones a llamar al final de cada solicitud, con el formato ``{scope: [functions]}``. La clave ``scope`` es el nombre de un blueprint para el que las funciones están activas, o ``None`` para todas las peticiones.

source: To register a function, use the :meth:`after_request` decorator.
es: Para registrar una función, utilice el decorador :meth:`after_request`.

source: A data structure of functions to call at the end of each request even if an exception is raised, in the format ``{scope: [functions]}``. The ``scope`` key is the name of a blueprint the functions are active for, or ``None`` for all requests.
es: Una estructura de datos de funciones para llamar al final de cada solicitud, incluso si se produce una excepción, en el formato ``{scope: [funciones]}``. La clave ``scope`` es el nombre de un plano para el que las funciones están activas, o ``None`` para todas las peticiones.

source: To register a function, use the :meth:`teardown_request` decorator.
es: Para registrar una función, utilice el decorador :meth:`teardown_request`.

source: A data structure of functions to call to pass extra context values when rendering templates, in the format ``{scope: [functions]}``. The ``scope`` key is the name of a blueprint the functions are active for, or ``None`` for all requests.
es: Una estructura de datos de funciones a las que llamar para pasar valores de contexto adicionales al renderizar plantillas, con el formato ``{scope: [funciones]}``. La clave ``scope`` es el nombre de un plano para el que las funciones están activas, o ``None`` para todas las solicitudes.

source: To register a function, use the :meth:`context_processor` decorator.
es: Para registrar una función, utilice el decorador :meth:`context_processor`.

source: A data structure of functions to call to modify the keyword arguments passed to the view function, in the format ``{scope: [functions]}``. The ``scope`` key is the name of a blueprint the functions are active for, or ``None`` for all requests.
es: Una estructura de datos de funciones a las que llamar para modificar los argumentos de palabras clave pasados a la función de vista, con el formato ``{scope: [functions]}``. La clave ``scope`` es el nombre de un plano para el que las funciones están activas, o ``None`` para todas las solicitudes.

source: To register a function, use the :meth:`url_value_preprocessor` decorator.
es: Para registrar una función, utilice el decorador :meth:`url_value_preprocessor`.

source: A data structure of functions to call to modify the keyword arguments when generating URLs, in the format ``{scope: [functions]}``. The ``scope`` key is the name of a blueprint the functions are active for, or ``None`` for all requests.
es: Una estructura de datos de funciones a las que llamar para modificar los argumentos de las palabras clave al generar las URL, con el formato ``{scope: [funciones]}``. La clave ``scope`` es el nombre de un plano para el que las funciones están activas, o ``None`` para todas las solicitudes.

source: To register a function, use the :meth:`url_defaults` decorator.
es: Para registrar una función, utilice el decorador :meth:`url_defaults`.

source: Blueprint Objects
es: Objetos Blueprint

source: the optional name of the global, otherwise the function name will be used.
es: el nombre opcional del global, de lo contrario se utilizará el nombre de la función.

source: Creates an instance of :meth:`~flask.blueprints.BlueprintSetupState` object that is later passed to the register callback functions. Subclasses can override this to return a subclass of the setup state.
es: Crea una instancia del objeto :meth:`~flask.blueprints.BlueprintSetupState` que luego se pasa a las funciones de callback de registro. Las subclases pueden anular esto para devolver una subclase del estado de configuración.

source: Registers a function that is called when the blueprint is registered on the application. This function is called with the state as argument as returned by the :meth:`make_setup_state` method.
es: Registra una función que es llamada cuando el blueprint es registrado en la aplicación. Esta función se llama con el estado como argumento devuelto por el método :meth:`make_setup_state`.

source: Works like :meth:`record` but wraps the function in another function that will ensure the function is only called once. If the blueprint is registered a second time on the application, the function passed is not called.
es: Funciona como :meth:`record` pero envuelve la función en otra función que asegurará que la función sólo se llame una vez. Si el blueprint se registra una segunda vez en la aplicación, la función pasada no se llama.

source: Called by :meth:`Flask.register_blueprint` to register all views and callbacks registered on the blueprint with the application. Creates a :class:`.BlueprintSetupState` and calls each :meth:`record` callback with it.
es: Llamado por :meth:`Flask.register_blueprint` para registrar todas las vistas y callbacks registrados en el blueprint con la aplicación. Crea un :class:`.BlueprintSetupState` y llama a cada callback :meth:`record` con él.

source: The application this blueprint is being registered with.
es: La aplicación con la que se registra este blueprint.

source: Keyword arguments forwarded from :meth:`~Flask.register_blueprint`.
es: Argumentos de la palabra clave reenviados desde :meth:`~Flask.register_blueprint`.

source: Nested blueprints are registered with their dotted name. This allows different blueprints with the same name to be nested at different locations.
es: Los blueprints anidados se registran con su nombre punteado. Esto permite anidar diferentes blueprints con el mismo nombre en diferentes lugares.

source: Register a :class:`~flask.Blueprint` on this blueprint. Keyword arguments passed to this method will override the defaults set on the blueprint.
es: Registra una :class:`~flask.Blueprint` en este blueprint. Los argumentos de palabras clave pasados a este método anulan los valores predeterminados establecidos en el blueprint.

source: Incoming Request Data
es: Datos de la solicitud entrante

source: The request object used by default in Flask. Remembers the matched endpoint and view arguments.
es: El objeto de solicitud utilizado por defecto en Flask. Recuerda el endpoint coincidente y los argumentos de la vista.

source: It is what ends up as :class:`~flask.request`. If you want to replace the request object used you can subclass this and set :attr:`~flask.Flask.request_class` to your subclass.
es: Es lo que termina como :class:`~flask.request`. Si quieres reemplazar el objeto request usado puedes subclasificar esto y establecer :attr:`~flask.Flask.request_class` a tu subclase.

source: The request object is a :class:`~werkzeug.wrappers.Request` subclass and provides all of the attributes Werkzeug defines plus a few Flask specific ones.
es: El objeto request es una subclase :class:`~werkzeug.wrappers.Request` y proporciona todos los atributos que define Werkzeug más algunos específicos de Flask.

source: The internal URL rule that matched the request. This can be useful to inspect which methods are allowed for the URL from a before/after handler (``request.url_rule.methods``) etc. Though if the request's method was invalid for the URL rule, the valid list is available in ``routing_exception.valid_methods`` instead (an attribute of the Werkzeug exception :exc:`~werkzeug.exceptions.MethodNotAllowed`) because the request was never internally bound.
es: La regla interna de la URL que coincidió con la solicitud. Esto puede ser útil para inspeccionar qué métodos están permitidos para la URL desde un manejador before/after (``request.url_rule.methods``), etc. Aunque si el método de la petición no era válido para la regla de URL, la lista válida está disponible en ``routing_exception.valid_methods`` en su lugar (un atributo de la excepción de Werkzeug :exc:`~werkzeug.exceptions.MethodNotAllowed`) porque la petición nunca estuvo vinculada internamente.

source: A dict of view arguments that matched the request. If an exception happened when matching, this will be ``None``.
es: Un dictado de los argumentos de la vista que coinciden con la solicitud. Si se ha producido una excepción durante la búsqueda, será ``None``.

source: If matching the URL failed, this is the exception that will be raised / was raised as part of the request handling. This is usually a :exc:`~werkzeug.exceptions.NotFound` exception or something similar.
es: Si la coincidencia de la URL falló, esta es la excepción que se lanzará / se lanzó como parte del manejo de la solicitud. Normalmente es una excepción :exc:`~werkzeug.exceptions.NotFound` o algo similar.

source: The endpoint that matched the request URL.
es: El endpoint que coincide con la URL de la solicitud.

source: This will be ``None`` if matching failed or has not been performed yet.
es: Será ``None`` si la coincidencia ha fallado o no se ha realizado todavía.

source: This in combination with :attr:`view_args` can be used to reconstruct the same URL or a modified URL.
es: Esto en combinación con :attr:`view_args` puede utilizarse para reconstruir la misma URL o una URL modificada.

source: The registered name of the current blueprint.
es: El nombre registrado del blueprint actual.

source: This will be ``None`` if the endpoint is not part of a blueprint, or if URL matching failed or has not been performed yet.
es: Será ``None`` si el endpoint no forma parte de un blueprint, o si la coincidencia de la URL ha fallado o no se ha realizado todavía.

source: This does not necessarily match the name the blueprint was created with. It may have been nested, or registered with a different name.
es: Esto no coincide necesariamente con el nombre con el que se creó el blueprint. Puede haber sido anidado o registrado con un nombre diferente.

source: The registered names of the current blueprint upwards through parent blueprints.
es: Los nombres registrados del blueprint actual hacia arriba a través de los blueprints padre.

source: This will be an empty list if there is no current blueprint, or if URL matching failed.
es: Será una lista vacía si no hay ningún blueprint actual, o si la coincidencia de URLs ha fallado.

source: Called if :meth:`get_json` fails and isn't silenced.
es: Se llama si :meth:`get_json` falla y no se silencia.

source: If this method returns a value, it is used as the return value for :meth:`get_json`. The default implementation raises :exc:`~werkzeug.exceptions.BadRequest`.
es: Si este método devuelve un valor, se utiliza como valor de retorno para :meth:`get_json`. La implementación por defecto lanza :exc:`~werkzeug.exceptions.BadRequest`.

source: If parsing failed, this is the exception. It will be ``None`` if the content type wasn't ``application/json``.
es: Si el análisis sintáctico falló, esta es la excepción. Será ``None`` si el tipo de contenido no era ``application/json``.

source: List of charsets this client supports as :class:`~werkzeug.datastructures.CharsetAccept` object.
es: Lista de conjuntos de caracteres que soporta este cliente como objeto :class:`~werkzeug.datastructures.CharsetAccept`.

source: List of encodings this client accepts. Encodings in a HTTP term are compression encodings such as gzip. For charsets have a look at :attr:`accept_charset`.
es: Lista de codificaciones que acepta este cliente. Las codificaciones en un término HTTP son codificaciones de compresión como gzip. Para los conjuntos de caracteres, consulte :attr:`accept_charset`.
