Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: Always passes the ``InternalServerError`` instance to the handler, setting ``original_exception`` to the unhandled error.
es: Siempre pasa la instancia ``InternalServerError`` al manejador, estableciendo ``original_exception`` al error no manejado.

source: ``after_request`` functions and other finalization is done even for the default 500 response when there is no handler.
es: Las funciones ``after_request`` y otras finalizaciones se realizan incluso para la respuesta 500 por defecto cuando no hay un manejador.

source: Logs an exception. This is called by :meth:`handle_exception` if debugging is disabled and right before the handler is called. The default implementation logs the exception as error on the :attr:`logger`.
es: Registra una excepción. Es llamado por :meth:`handle_exception` si la depuración está deshabilitada y justo antes de llamar al manejador. La implementación por defecto registra la excepción como error en el :attr:`logger`.

source: Does the request dispatching. Matches the URL and returns the return value of the view or error handler. This does not have to be a response object. In order to convert the return value to a proper response object, call :func:`make_response`.
es: Realiza el envío de la solicitud. Coincide con la URL y devuelve el valor de retorno de la vista o del manejador de errores. Esto no tiene que ser un objeto de respuesta. Para convertir el valor de retorno en un objeto de respuesta adecuado, llame a :func:`make_response`.

source: This no longer does the exception handling, this code was moved to the new :meth:`full_dispatch_request`.
es: Esto ya no hace el manejo de excepciones, este código fue movido al nuevo :meth:`full_dispatch_request`.

source: Dispatches the request and on top of that performs request pre and postprocessing as well as HTTP exception catching and error handling.
es: Despacha la solicitud y, además, realiza el pre y postprocesamiento de la misma, así como la captura de excepciones HTTP y el manejo de errores.

source: Given the return value from a view function this finalizes the request by converting it into a response and invoking the postprocessing functions. This is invoked for both normal request dispatching as well as error handlers.
es: Dado el valor de retorno de una función de la vista, esto finaliza la solicitud convirtiéndola en una respuesta e invocando las funciones de posprocesamiento. Esto se invoca tanto para el envío normal de solicitudes como para los manejadores de errores.

source: Because this means that it might be called as a result of a failure a special safe mode is available which can be enabled with the `from_error_handler` flag. If enabled, failures in response processing will be logged and otherwise ignored.
es: Debido a que esto significa que podría ser llamado como resultado de un fallo, está disponible un modo seguro especial que puede ser habilitado con la bandera `from_error_handler`. Si se activa, los fallos en el procesamiento de la respuesta se registrarán y, en caso contrario, se ignorarán.

source: internal
es: interno

source: This method is called to create the default ``OPTIONS`` response. This can be changed through subclassing to change the default behavior of ``OPTIONS`` responses.
es: Este método es llamado para crear la respuesta ``OPTIONS`` por defecto. Esto se puede cambiar a través de la subclase para cambiar el comportamiento por defecto de las respuestas ``OPTIONS``.

source: Ensure that the function is synchronous for WSGI workers. Plain ``def`` functions are returned as-is. ``async def`` functions are wrapped to run and wait for the response.
es: Asegúrese de que la función es sincrónica para los trabajadores WSGI. Las funciones ``def`` simples se devuelven tal cual. Las funciones ``async def`` se envuelven para ejecutarse y esperar la respuesta.

source: Override this method to change how the app runs async views.
es: Anula este método para cambiar la forma en que la aplicación ejecuta las vistas asíncronas.

source: Return a sync function that will run the coroutine function.
es: Devuelve una función de sincronización que ejecutará la función coroutine.

source: Override this method to change how the app converts async code to be synchronously callable.
es: Sobrescribe este método para cambiar la forma en que la aplicación convierte el código asíncrono para que se pueda llamar de forma sincrónica.

source: Generate a URL to the given endpoint with the given values.
es: Genera una URL al endpoint dado con los valores indicados.

source: This is called by :func:`flask.url_for`, and can be called directly as well.
es: Esto es llamado por :func:`flask.url_for`, y puede ser llamado directamente también.

source: An *endpoint* is the name of a URL rule, usually added with :meth:`@app.route() <route>`, and usually the same name as the view function. A route defined in a :class:`~flask.Blueprint` will prepend the blueprint's name separated by a ``.`` to the endpoint.
es: Un *endpoint* es el nombre de una regla de URL, normalmente añadida con :meth:`@app.route() <route>`, y normalmente el mismo nombre que la función de la vista. Una ruta definida en un :class:`~flask.Blueprint` antepondrá el nombre del blueprint separado por un ``.`` al endpoint.

source: In some cases, such as email messages, you want URLs to include the scheme and domain, like ``https://example.com/hello``. When not in an active request, URLs will be external by default, but this requires setting :data:`SERVER_NAME` so Flask knows what domain to use. :data:`APPLICATION_ROOT` and :data:`PREFERRED_URL_SCHEME` should also be configured as needed. This config is only used when not in an active request.
es: En algunos casos, como en los mensajes de correo electrónico, quieres que las URLs incluyan el esquema y el dominio, como ``https://example.com/hello``. Cuando no está en una petición activa, las URLs serán externas por defecto, pero esto requiere configurar :data:`SERVER_NAME` para que Flask sepa qué dominio usar. :data:`APPLICATION_ROOT` y :data:`PREFERRED_URL_SCHEME` también deben configurarse según sea necesario. Esta configuración sólo se utiliza cuando no está en una solicitud activa.

source: Functions can be decorated with :meth:`url_defaults` to modify keyword arguments before the URL is built.
es: Las funciones pueden ser decoradas con :meth:`url_defaults` para modificar los argumentos de las palabras clave antes de construir la URL.

source: If building fails for some reason, such as an unknown endpoint or incorrect values, the app's :meth:`handle_url_build_error` method is called. If that returns a string, that is returned, otherwise a :exc:`~werkzeug.routing.BuildError` is raised.
es: Si la construcción falla por alguna razón, como un punto final desconocido o valores incorrectos, se llama al método :meth:`handle_url_build_error` de la aplicación. Si devuelve una cadena, se devuelve, de lo contrario se lanza un :exc:`~werkzeug.routing.BuildError`.

source: The endpoint name associated with the URL to generate. If this starts with a ``.``, the current blueprint name (if any) will be used.
es: El nombre del endpoint asociado a la URL a generar. Si empieza por ``.``, se utilizará el nombre del plano actual (si lo hay).

source: If given, append this as ``#anchor`` to the URL.
es: Si se proporciona, se añade como ``#anchor`` a la URL.

source: If given, generate the URL associated with this method for the endpoint.
es: Si se da, genera la URL asociada a este método para el punto final.

source: If given, the URL will have this scheme if it is external.
es: Si se da, la URL tendrá este esquema si es externa.

source: If given, prefer the URL to be internal (False) or require it to be external (True). External URLs include the scheme and domain. When not in an active request, URLs are external by default.
es: Si se da, prefiere que la URL sea interna (False) o requiere que sea externa (True). Las URLs externas incluyen el esquema y el dominio. Cuando no están en una solicitud activa, las URL son externas por defecto.

source: Values to use for the variable parts of the URL rule. Unknown keys are appended as query string arguments, like ``?a=b&c=d``.
es: Valores a utilizar para las partes variables de la regla URL. Las claves desconocidas se añaden como argumentos de la cadena de consulta, como ``?a=b&c=d``.

source: Moved from ``flask.url_for``, which calls this method.
es: Movido de ``flask.url_for``, que llama a este método.

source: Convert the return value from a view function to an instance of :attr:`response_class`.
es: Convierte el valor de retorno de una función de la vista en una instancia de :attr:`response_class`.

source: the return value from the view function. The view function must return a response. Returning ``None``, or the view ending without returning, is not allowed. The following types are allowed for ``view_rv``: ``str`` A response object is created with the string encoded to UTF-8 as the body. ``bytes`` A response object is created with the bytes as the body. ``dict`` A dictionary that will be jsonify'd before being returned. ``list`` A list that will be jsonify'd before being returned. ``generator`` or ``iterator`` A generator that returns ``str`` or ``bytes`` to be streamed as the response. ``tuple`` Either ``(body, status, headers)``, ``(body, status)``, or ``(body, headers)``, where ``body`` is any of the other types allowed here, ``status`` is a string or an integer, and ``headers`` is a dictionary or a list of ``(key, value)`` tuples. If ``body`` is a :attr:`response_class` instance, ``status`` overwrites the exiting value and ``headers`` are extended. :attr:`response_class` The object is returned unchanged. other :class:`~werkzeug.wrappers.Response` class The object is coerced to :attr:`response_class`. :func:`callable` The function is called as a WSGI application. The result is used to create a response object.
es: el valor de retorno de la función de la vista. La función de la vista debe devolver una respuesta. No se permite devolver ``None``, o que la vista termine sin devolver. Se permiten los siguientes tipos para ``view_rv``: ``str`` Se crea un objeto de respuesta con la cadena codificada en UTF-8 como cuerpo. Se crea un objeto de respuesta con los bytes como cuerpo. ``dict`` Un diccionario que será jsonificado antes de ser devuelto. Una lista que será jsonificada antes de ser devuelta. Un generador que devuelve ``str`` o ``bytes`` para ser transmitido como respuesta. Una tupla puede ser ``(body, status, header)``, ``(body, status)``, o ``(body, header)``, donde ``body`` es cualquiera de los otros tipos permitidos, ``state`` es una cadena o un entero, y ``header`` es un diccionario o una lista de tuplas ``(key, value)``. Si ``body`` es una instancia de :attr:`response_class`, ``status`` sobrescribe el valor de salida y ``headers`` se extiende. :attr:`response_class` El objeto se devuelve sin cambios. other :class:`~werkzeug.wrappers.Response` class El objeto se coacciona a :attr:`response_class`. :func:`callable` La función se llama como una aplicación WSGI. El resultado se utiliza para crear un objeto de respuesta.

source: A generator will be converted to a streaming response. A list will be converted to a JSON response.
es: Un generador se convertirá en una respuesta en streaming. Una lista se convertirá en una respuesta JSON.

source: A dict will be converted to a JSON response.
es: Un diccionario se convertirá en una respuesta JSON.

source: Previously a tuple was interpreted as the arguments for the response object.
es: Anteriormente se interpretaba una tupla como los argumentos del objeto de respuesta.

source: Called before the request is dispatched. Calls :attr:`url_value_preprocessors` registered with the app and the current blueprint (if any). Then calls :attr:`before_request_funcs` registered with the app and the blueprint.
es: Se llama antes de que se envíe la solicitud. Llama a :attr:`url_value_preprocessors` registrado con la app y el blueprint actual (si lo hay). Luego llama a :attr:`before_request_funcs` registrado con la app y el blueprint.

source: If any :meth:`before_request` handler returns a non-None value, the value is handled as if it was the return value from the view, and further request handling is stopped.
es: Si cualquier manejador :meth:`before_request` devuelve un valor que no es None, el valor se maneja como si fuera el valor de retorno de la vista, y se detiene el manejo posterior de la solicitud.

source: Can be overridden in order to modify the response object before it's sent to the WSGI server. By default this will call all the :meth:`after_request` decorated functions.
es: Puede ser sobreescrito para modificar el objeto de respuesta antes de que sea enviado al servidor WSGI. Por defecto, esto llamará a todas las funciones decoradas :meth:`after_request`.

source: As of Flask 0.5 the functions registered for after request execution are called in reverse order of registration.
es: A partir de Flask 0.5 las funciones registradas para después de la ejecución de la solicitud son llamadas en orden inverso al registro.

source: a :attr:`response_class` object.
es: un objeto :attr:`response_class`.

source: a new response object or the same, has to be an instance of :attr:`response_class`.
es: un nuevo objeto de respuesta o el mismo, tiene que ser una instancia de :attr:`response_class`.

source: Called after the request is dispatched and the response is returned, right before the request context is popped.
es: Se llama después de que se envíe la solicitud y se devuelva la respuesta, justo antes de que el contexto de la solicitud se vacíe.

source: This calls all functions decorated with :meth:`teardown_request`, and :meth:`Blueprint.teardown_request` if a blueprint handled the request. Finally, the :data:`request_tearing_down` signal is sent.
es: Esto llama a todas las funciones decoradas con :meth:`teardown_request`, y :meth:`Blueprint.teardown_request` si un blueprint manejó la solicitud. Finalmente, se envía la señal :data:`request_tearing_down`.

source: This is called by :meth:`RequestContext.pop() <flask.ctx.RequestContext.pop>`, which may be delayed during testing to maintain access to resources.
es: Esto es llamado por :meth:`RequestContext.pop() <flask.ctx.RequestContext.pop>`, que puede ser retrasado durante las pruebas para mantener el acceso a los recursos.

source: An unhandled exception raised while dispatching the request. Detected from the current exception information if not passed. Passed to each teardown function.
es: Una excepción no controlada que se ha producido durante el envío de la solicitud. Se detecta a partir de la información de excepción actual si no se pasa. Se pasa a cada función de desmontaje.

source: Added the ``exc`` argument.
es: Se ha añadido el argumento ``exc``.

source: Called right before the application context is popped.
es: Se llama justo antes de que aparezca el contexto de la aplicación.

source: When handling a request, the application context is popped after the request context. See :meth:`do_teardown_request`.
es: Cuando se maneja una solicitud, el contexto de la aplicación se despliega después del contexto de la solicitud. Véase :meth:`do_teardown_request`.

source: This calls all functions decorated with :meth:`teardown_appcontext`. Then the :data:`appcontext_tearing_down` signal is sent.
es: Esto llama a todas las funciones decoradas con :meth:`teardown_appcontext`. Entonces se envía la señal :data:`appcontext_tearing_down`.

source: This is called by :meth:`AppContext.pop() <flask.ctx.AppContext.pop>`.
es: Esto es llamado por :meth:`AppContext.pop() <flask.ctx.AppContext.pop>`.

source: Create an :class:`~flask.ctx.AppContext`. Use as a ``with`` block to push the context, which will make :data:`current_app` point at this application.
es: Crea un :class:`~flask.ctx.AppContext`. Úsalo como un bloque ``with`` para empujar el contexto, lo que hará que :data:`current_app` apunte a esta aplicación.

source: An application context is automatically pushed by :meth:`RequestContext.push() <flask.ctx.RequestContext.push>` when handling a request, and when running a CLI command. Use this to manually create a context outside of these situations.
es: Un contexto de aplicación es automáticamente empujado por :meth:`RequestContext.push() <flask.ctx.RequestContext.push>` cuando se maneja una solicitud, y cuando se ejecuta un comando CLI. Use esto para crear manualmente un contexto fuera de estas situaciones.

source: See :doc:`/appcontext`.
es: Véase :doc:`/appcontext`.

source: Create a :class:`~flask.ctx.RequestContext` representing a WSGI environment. Use a ``with`` block to push the context, which will make :data:`request` point at this request.
es: Crea un :class:`~flask.ctx.RequestContext` que represente un entorno WSGI. Utiliza un bloque ``with`` para empujar el contexto, lo que hará que :data:`request` apunte a esta solicitud.

source: See :doc:`/reqcontext`.
es: Véase :doc:`/reqcontext`.

source: Typically you should not call this from your own code. A request context is automatically pushed by the :meth:`wsgi_app` when handling a request. Use :meth:`test_request_context` to create an environment and context instead of this method.
es: Típicamente no deberías llamar a esto desde tu propio código. Un contexto de solicitud es automáticamente empujado por el :meth:`wsgi_app` cuando se maneja una solicitud. Utilice :meth:`test_request_context` para crear un entorno y un contexto en lugar de este método.

source: a WSGI environment
es: un entorno WSGI

source: Create a :class:`~flask.ctx.RequestContext` for a WSGI environment created from the given values. This is mostly useful during testing, where you may want to run a function that uses request data without dispatching a full request.
es: Crea un :class:`~flask.ctx.RequestContext` para un entorno WSGI creado a partir de los valores dados. Esto es útil sobre todo durante las pruebas, en las que se puede querer ejecutar una función que utilice datos de solicitud sin enviar una solicitud completa.

source: Use a ``with`` block to push the context, which will make :data:`request` point at the request for the created environment. ::
es: Utiliza un bloque ``with`` para empujar el contexto, lo que hará que :data:`request` apunte a la solicitud del entorno creado. ::

source: When using the shell, it may be easier to push and pop the context manually to avoid indentation. ::
es: Cuando se utiliza el intérprete de comandos, puede ser más fácil de empujar y saltar el contexto manualmente para evitar la indentación ::

source: Takes the same arguments as Werkzeug's :class:`~werkzeug.test.EnvironBuilder`, with some defaults from the application. See the linked Werkzeug docs for most of the available arguments. Flask-specific behavior is listed here.
es: Toma los mismos argumentos que el :class:`~werkzeug.test.EnvironBuilder` de Werkzeug, con algunos valores por defecto de la aplicación. Consulte la documentación de Werkzeug para conocer la mayoría de los argumentos disponibles. El comportamiento específico de Flask está listado aquí.

source: URL path being requested.
es: Ruta de la URL solicitada.

source: Base URL where the app is being served, which ``path`` is relative to. If not given, built from :data:`PREFERRED_URL_SCHEME`, ``subdomain``, :data:`SERVER_NAME`, and :data:`APPLICATION_ROOT`.
es: URL base donde se sirve la aplicación, a la que ``path`` es relativa. Si no se da, se construye a partir de :data:`PREFERRED_URL_SCHEME`, ``subdomain``, :data:`SERVER_NAME`, y :data:`APPLICATION_ROOT`.

source: Subdomain name to append to :data:`SERVER_NAME`.
es: Nombre del subdominio a añadir a :data:`SERVER_NAME`.

source: Scheme to use instead of :data:`PREFERRED_URL_SCHEME`.
es: Esquema a utilizar en lugar de :data:`PREFERRED_URL_SCHEME`.

source: The request body, either as a string or a dict of form keys and values.
es: El cuerpo de la solicitud, ya sea una cadena o un dictado de claves y valores del formulario.

source: If given, this is serialized as JSON and passed as ``data``. Also defaults ``content_type`` to ``application/json``.
es: Si se da, se serializa como JSON y se pasa como ``data``. Además, el tipo de contenido por defecto es ``application/json``.

source: other positional arguments passed to :class:`~werkzeug.test.EnvironBuilder`.
es: otros argumentos posicionales pasados a :class:`~werkzeug.test.EnvironBuilder`.

source: other keyword arguments passed to :class:`~werkzeug.test.EnvironBuilder`.
es: otros argumentos de palabra clave pasados a :class:`~werkzeug.test.EnvironBuilder`.

source: The actual WSGI application. This is not implemented in :meth:`__call__` so that middlewares can be applied without losing a reference to the app object. Instead of doing this::
es: La aplicación WSGI real. Esto no está implementado en :meth:`__call__` para que los middlewares puedan ser aplicados sin perder una referencia al objeto app. En lugar de hacer esto::

source: It's a better idea to do this instead::
es: Es mejor hacer esto en su lugar::

source: Then you still have the original application object around and can continue to call methods on it.
es: Entonces todavía tienes el objeto original de la aplicación y puedes seguir llamando a los métodos en él.

source: Teardown events for the request and app contexts are called even if an unhandled error occurs. Other events may not be called depending on when an error occurs during dispatch. See :ref:`callbacks-and-errors`.
es: Los eventos de desmontaje para los contextos de solicitud y de aplicación se llaman incluso si se produce un error no manejado. Otros eventos pueden no ser llamados dependiendo de cuándo se produzca un error durante el despacho. Véase :ref:`callbacks-and-errors`.

source: A WSGI environment.
es: Un entorno WSGI.

source: A callable accepting a status code, a list of headers, and an optional exception context to start the response.
es: Una llamada que acepta un código de estado, una lista de cabeceras y un contexto de excepción opcional para iniciar la respuesta.

source: Register a custom template filter. Works exactly like the :meth:`template_filter` decorator.
es: Registra un filtro de plantilla personalizado. Funciona exactamente igual que el decorador :meth:`template_filter`.

source: the optional name of the filter, otherwise the function name will be used.
es: el nombre opcional del filtro, de lo contrario se utilizará el nombre de la función.

source: Register a custom template global function. Works exactly like the :meth:`template_global` decorator.
es: Registra una función global de plantilla personalizada. Funciona exactamente igual que el decorador :meth:`template_global`.

source: the optional name of the global function, otherwise the function name will be used.
es: el nombre opcional de la función global, de lo contrario se utilizará el nombre de la función.

source: Register a custom template test. Works exactly like the :meth:`template_test` decorator.
es: Registra una prueba de plantilla personalizada. Funciona exactamente igual que el decorador :meth:`template_test`.

source: the optional name of the test, otherwise the function name will be used.
es: el nombre opcional de la prueba, de lo contrario se utilizará el nombre de la función.

source: Register a rule for routing incoming requests and building URLs. The :meth:`route` decorator is a shortcut to call this with the ``view_func`` argument. These are equivalent:
es: Registra una regla para enrutar las solicitudes entrantes y construir URLs. El decorador :meth:`route` es un atajo para llamar a esto con el argumento ``view_func``. Son equivalentes:

source: See :ref:`url-route-registrations`.
es: Véase :ref:`url-route-registrations`.
