Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: The endpoint name for the route defaults to the name of the view function if the ``endpoint`` parameter isn't passed. An error will be raised if a function has already been registered for the endpoint.
es: El nombre del endpoint de la ruta es por defecto el nombre de la función de la vista si no se pasa el parámetro ``endpoint``. Se producirá un error si ya se ha registrado una función para el endpoint.

source: The ``methods`` parameter defaults to ``["GET"]``. ``HEAD`` is always added automatically, and ``OPTIONS`` is added automatically by default.
es: El parámetro ``methods`` es por defecto ``["GET"]``. El parámetro ``HEAD`` siempre se añade automáticamente, y ``OPTIONS`` se añade automáticamente por defecto.

source: ``view_func`` does not necessarily need to be passed, but if the rule should participate in routing an endpoint name must be associated with a view function at some point with the :meth:`endpoint` decorator.
es: ``view_func`` no necesita ser pasado, pero si la regla debe participar en el enrutamiento un nombre del endpoint debe ser asociado con una función de vista en algún momento con el decorador :meth:`endpoint`.

source: If ``view_func`` has a ``required_methods`` attribute, those methods are added to the passed and automatic methods. If it has a ``provide_automatic_methods`` attribute, it is used as the default if the parameter is not passed.
es: Si ``view_func`` tiene un atributo ``required_methods``, esos métodos se añaden a los métodos pasados y automáticos. Si tiene el atributo ``provide_automatic_methods``, se utiliza como método por defecto si no se pasa el parámetro.

source: The URL rule string.
es: La cadena de reglas URL.

source: The endpoint name to associate with the rule and view function. Used when routing and building URLs. Defaults to ``view_func.__name__``.
es: El nombre del endpoint a asociar con la regla y la función de la vista. Se utiliza cuando se enrutan y construyen URLs. Por defecto es ``view_func.__name__``.

source: The view function to associate with the endpoint name.
es: La función de la vista a asociar con el nombre del endpoint.

source: Add the ``OPTIONS`` method and respond to ``OPTIONS`` requests automatically.
es: Añade el método ``OPTIONS`` y responde a las peticiones ``OPTIONS`` automáticamente.

source: Extra options passed to the :class:`~werkzeug.routing.Rule` object.
es: Opciones extra pasadas al objeto :class:`~werkzeug.routing.Rule`.

source: Register a function to run after each request to this object.
es: Registrar una función que se ejecute después de cada petición a este objeto.

source: The function is called with the response object, and must return a response object. This allows the functions to modify or replace the response before it is sent.
es: La función se llama con el objeto response, y debe devolver un objeto response. Esto permite que las funciones modifiquen o sustituyan la respuesta antes de ser enviada.

source: If a function raises an exception, any remaining ``after_request`` functions will not be called. Therefore, this should not be used for actions that must execute, such as to close resources. Use :meth:`teardown_request` for that.
es: Si una función lanza una excepción, cualquier función ``after_request`` restante no será llamada. Por lo tanto, esto no debe ser utilizado para las acciones que deben ejecutarse, como para cerrar los recursos. Utilice :meth:`teardown_request` para eso.

source: Tries to locate the instance path if it was not provided to the constructor of the application class. It will basically calculate the path to a folder named ``instance`` next to your main file or the package.
es: Intenta localizar la ruta de la instancia si no fue proporcionada al constructor de la clase de la aplicación. Básicamente calculará la ruta de una carpeta llamada ``instance`` junto a su archivo principal o al paquete.

source: Register a function to run before each request.
es: Registrar una función para ejecutar antes de cada solicitud.

source: For example, this can be used to open a database connection, or to load the logged in user from the session.
es: Por ejemplo, esto se puede utilizar para abrir una conexión a la base de datos, o para cargar el usuario conectado desde la sesión.

source: The function will be called without any arguments. If it returns a non-``None`` value, the value is handled as if it was the return value from the view, and further request handling is stopped.
es: La función será llamada sin ningún argumento. Si devuelve un valor que no sea ``None``, el valor se maneja como si fuera el valor de retorno de la vista, y se detiene el manejo de la solicitud.

source: Creates the loader for the Jinja2 environment. Can be used to override just the loader and keeping the rest unchanged. It's discouraged to override this function. Instead one should override the :meth:`jinja_loader` function instead.
es: Crea el cargador para el entorno Jinja2. Se puede utilizar para anular sólo el cargador y mantener el resto sin cambios. Se desaconseja anular esta función. En su lugar se debe sobrescribir la función :meth:`jinja_loader`.

source: The global loader dispatches between the loaders of the application and the individual blueprints.
es: El cargador global despacha entre los cargadores de la aplicación y los blueprints individuales.

source: **Do not enable debug mode when deploying in production.**
es: **No active el modo de depuración cuando se despliegue en producción.**

source: Shortcut for :meth:`route` with ``methods=["DELETE"]``.
es: Acceso directo a :meth:`route` con ``methods=["DELETE"]``.

source: Decorate a view function to register it for the given endpoint. Used if a rule is added without a ``view_func`` with :meth:`add_url_rule`.
es: Decora una función de vista para registrarla para el punto final dado. Se utiliza si se añade una regla sin una ``view_func`` con :meth:`add_url_rule`.

source: The endpoint name to associate with the view function.
es: El nombre del punto final a asociar con la función de la vista.

source: Register a function to handle errors by code or exception class.
es: Registrar una función para manejar errores por código o clase de excepción.

source: A decorator that is used to register a function given an error code. Example::
es: Un decorador que se utiliza para registrar una función dado un código de error. Ejemplo::

source: You can also register handlers for arbitrary exceptions::
es: También puedes registrar manejadores para excepciones arbitrarias::

source: Use :meth:`register_error_handler` instead of modifying :attr:`error_handler_spec` directly, for application wide error handlers.
es: Utilice :meth:`register_error_handler` en lugar de modificar :attr:`error_handler_spec` directamente, para los manejadores de error de toda la aplicación.

source: One can now additionally also register custom exception types that do not necessarily have to be a subclass of the :class:`~werkzeug.exceptions.HTTPException` class.
es: Ahora también se pueden registrar tipos de excepción personalizados que no necesariamente tienen que ser una subclase de la clase :class:`~werkzeug.exceptions.HTTPException`.

source: the code as integer for the handler, or an arbitrary exception
es: el código como entero para el manejador, o una excepción arbitraria

source: Shortcut for :meth:`route` with ``methods=["GET"]``.
es: Acceso directo a :meth:`route` con ``methods=["GET"]``.

source: Called by :meth:`.url_for` if a :exc:`~werkzeug.routing.BuildError` was raised. If this returns a value, it will be returned by ``url_for``, otherwise the error will be re-raised.
es: Llamada por :meth:`.url_for` si se ha producido un :exc:`~werkzeug.routing.BuildError`. Si esto devuelve un valor, será devuelto por ``url_for``, de lo contrario el error se volverá a lanzar.

source: Each function in :attr:`url_build_error_handlers` is called with ``error``, ``endpoint`` and ``values``. If a function returns ``None`` or raises a ``BuildError``, it is skipped. Otherwise, its return value is returned by ``url_for``.
es: Cada función en :attr:`url_build_error_handlers` es llamada con ``error``, ``endpoint`` y ``values``. Si una función devuelve ``None`` o genera un ``BuildError``, se omite. De lo contrario, su valor de retorno es devuelto por ``url_for``.

source: The active ``BuildError`` being handled.
es: El ``BuildError`` activo que se está manejando.

source: The endpoint being built.
es: El punto final que se construye.

source: The keyword arguments passed to ``url_for``.
es: Los argumentos de la palabra clave pasada a ``url_for``.

source: ``True`` if :attr:`static_folder` is set.
es: ``True`` si :attr:`static_folder` está establecido.

source: Injects the URL defaults for the given endpoint directly into the values dictionary passed. This is used internally and automatically called on URL building.
es: Inyecta los valores predeterminados de la URL para el punto final dado directamente en el diccionario de valores pasado. Esto se utiliza internamente y se llama automáticamente en la construcción de la URL.

source: Iterates over all blueprints by the order they were registered.
es: Itera sobre todos los planos por el orden en que fueron registrados.

source: The Jinja environment used to load templates.
es: El entorno Jinja utilizado para cargar las plantillas.

source: The environment is created the first time this property is accessed. Changing :attr:`jinja_options` after that will have no effect.
es: El entorno se crea la primera vez que se accede a esta propiedad. Cambiar :attr:`jinja_options` después no tendrá ningún efecto.

source: The Jinja loader for this object's templates. By default this is a class :class:`jinja2.loaders.FileSystemLoader` to :attr:`template_folder` if it is set.
es: El cargador de Jinja para las plantillas de este objeto. Por defecto es una clase :class:`jinja2.loaders.FileSystemLoader` a :attr:`template_folder` si se establece.

source: Options that are passed to the Jinja environment in :meth:`create_jinja_environment`. Changing these options after the environment is created (accessing :attr:`jinja_env`) will have no effect.
es: Opciones que se pasan al entorno Jinja en :meth:`create_jinja_environment`. Cambiar estas opciones después de crear el entorno (accediendo a :attr:`jinja_env`) no tendrá ningún efecto.

source: This is a ``dict`` instead of an ``ImmutableDict`` to allow easier configuration.
es: Es un ``dict`` en lugar de un ``ImmutableDict`` para permitir una configuración más fácil.

source: A standard Python :class:`~logging.Logger` for the app, with the same name as :attr:`name`.
es: Un :class:`~logging.Logger` estándar de Python para la aplicación, con el mismo nombre que :attr:`name`.

source: In debug mode, the logger's :attr:`~logging.Logger.level` will be set to :data:`~logging.DEBUG`.
es: En el modo de depuración, el :attr:`~logging.Logger.level` del registrador se establecerá en :data:`~logging.DEBUG`.

source: If there are no handlers configured, a default handler will be added. See :doc:`/logging` for more information.
es: Si no hay ningún gestor configurado, se añadirá un gestor por defecto. Consulte :doc:`/logging` para obtener más información.

source: The logger takes the same name as :attr:`name` rather than hard-coding ``"flask.app"``.
es: El registrador toma el mismo nombre que :attr:`name` en lugar de codificar con fuerza ``"flask.app"``.

source: Behavior was simplified. The logger is always named ``"flask.app"``. The level is only set during configuration, it doesn't check ``app.debug`` each time. Only one format is used, not different ones depending on ``app.debug``. No handlers are removed, and a handler is only added if no handlers are already configured.
es: Se ha simplificado el comportamiento. El registrador siempre se llama ``"flask.app"``. El nivel sólo se establece durante la configuración, no comprueba ``app.debug`` cada vez. Sólo se utiliza un formato, no diferentes dependiendo de ``app.debug``. No se eliminan manejadores, y sólo se añade un manejador si no hay ninguno ya configurado.

source: Create the object to assign to :attr:`aborter`. That object is called by :func:`flask.abort` to raise HTTP errors, and can be called directly as well.
es: Crea el objeto para asignar a :attr:`aborter`. Ese objeto es llamado por :func:`flask.abort` para levantar errores HTTP, y también puede ser llamado directamente.

source: By default, this creates an instance of :attr:`aborter_class`, which defaults to :class:`werkzeug.exceptions.Aborter`.
es: Por defecto, esto crea una instancia de :attr:`aborter_class`, que por defecto es :class:`werkzeug.exceptions.Aborter`.

source: Used to create the config attribute by the Flask constructor. The `instance_relative` parameter is passed in from the constructor of Flask (there named `instance_relative_config`) and indicates if the config should be relative to the instance path or the root path of the application.
es: Usado para crear el atributo config por el constructor de Flask. El parámetro `instance_relative` se pasa desde el constructor de Flask (allí llamado `instance_relative_config`) e indica si el config debe ser relativo a la ruta de la instancia o a la ruta raíz de la aplicación.

source: The name of the application. This is usually the import name with the difference that it's guessed from the run file if the import name is main. This name is used as a display name when Flask needs the name of the application. It can be set and overridden to change the value.
es: El nombre de la aplicación. Suele ser el nombre de importación con la diferencia de que se adivina a partir del archivo de ejecución si el nombre de importación es main. Este nombre se utiliza como nombre de visualización cuando Flask necesita el nombre de la aplicación. Se puede establecer y anular para cambiar el valor.

source: Shortcut for :meth:`route` with ``methods=["PATCH"]``.
es: Acceso directo a :meth:`route` con ``methods=["PATCH"]``.

source: A :class:`~datetime.timedelta` which is used to set the expiration date of a permanent session. The default is 31 days which makes a permanent session survive for roughly one month.
es: Una :class:`~datetime.timedelta` que se utiliza para establecer la fecha de expiración de una sesión permanente. El valor predeterminado es 31 días, lo que hace que una sesión permanente sobreviva aproximadamente un mes.

source: This attribute can also be configured from the config with the ``PERMANENT_SESSION_LIFETIME`` configuration key. Defaults to ``timedelta(days=31)``
es: Este atributo también se puede configurar desde la configuración con la clave de configuración ``PERMANENT_SESSION_LIFETIME``. Por defecto es ``timedelta(days=31)``

source: Shortcut for :meth:`route` with ``methods=["POST"]``.
es: Acceso directo a :meth:`route` con ``methods=["POST"]``.

source: Shortcut for :meth:`route` with ``methods=["PUT"]``.
es: Acceso directo a :meth:`route` con ``methods=["PUT"]``.

source: Create a redirect response object.
es: Crea un objeto de respuesta de redirección.

source: This is called by :func:`flask.redirect`, and can be called directly as well.
es: Esto es llamado por :func:`flask.redirect`, y puede ser llamado directamente también.

source: The URL to redirect to.
es: La URL a la que se redirige.

source: The status code for the redirect.
es: El código de estado de la redirección.

source: Moved from ``flask.redirect``, which calls this method.
es: Movido de ``flask.redirect``, que llama a este método.

source: Register a :class:`~flask.Blueprint` on the application. Keyword arguments passed to this method will override the defaults set on the blueprint.
es: Registra un :class:`~flask.Blueprint` en la aplicación. Los argumentos de palabras clave pasados a este método anulan los valores predeterminados establecidos en el plano.

source: Calls the blueprint's :meth:`~flask.Blueprint.register` method after recording the blueprint in the application's :attr:`blueprints`.
es: Llama al método :meth:`~flask.Blueprint.register` del blueprint después de registrar el blueprint en el :attr:`blueprints` de la aplicación.

source: The blueprint to register.
es: El blueprint para registrarse.

source: Blueprint routes will be prefixed with this.
es: Las rutas de los blueprint llevarán este prefijo.

source: Blueprint routes will match on this subdomain.
es: Las rutas Blueprint coincidirán en este subdominio.

source: Blueprint routes will use these default values for view arguments.
es: Las rutas Blueprint utilizarán estos valores por defecto para los argumentos de la vista.

source: Additional keyword arguments are passed to :class:`~flask.blueprints.BlueprintSetupState`. They can be accessed in :meth:`~flask.Blueprint.record` callbacks.
es: Los argumentos adicionales de la palabra clave se pasan a :class:`~flask.blueprints.BlueprintSetupState`. Se puede acceder a ellos en las llamadas de retorno de :meth:`~flask.Blueprint.record`.

source: The ``name`` option can be used to change the (pre-dotted) name the blueprint is registered with. This allows the same blueprint to be registered multiple times with unique names for ``url_for``.
es: La opción ``name`` se puede utilizar para cambiar el nombre (pre-punteado) con el que se registra el blueprint. Esto permite registrar el mismo plano varias veces con nombres únicos para ``url_for``.

source: Alternative error attach function to the :meth:`errorhandler` decorator that is more straightforward to use for non decorator usage.
es: Función alternativa de adición de errores al decorador :meth:`errorhandler` que es más sencilla de utilizar para el uso de no decoradores.

source: Decorate a view function to register it with the given URL rule and options. Calls :meth:`add_url_rule`, which has more details about the implementation.
es: Decora una función de la vista para registrarla con la regla de URL y las opciones dadas. Llama a :meth:`add_url_rule`, que tiene más detalles sobre la implementación.

source: The endpoint name for the route defaults to the name of the view function if the ``endpoint`` parameter isn't passed.
es: El nombre del endpoint de la ruta es por defecto el nombre de la función de la vista si no se pasa el parámetro ``endpoint``.

source: The ``methods`` parameter defaults to ``["GET"]``. ``HEAD`` and ``OPTIONS`` are added automatically.
es: El parámetro ``methods`` es por defecto ``["GET"]``. Los parámetros ``HEAD`` y ``OPTIONS`` se añaden automáticamente.

source: If a secret key is set, cryptographic components can use this to sign cookies and other things. Set this to a complex random value when you want to use the secure cookie for instance.
es: Si se establece una clave secreta, los componentes criptográficos pueden utilizarla para firmar cookies y otras cosas. Establece esto a un valor aleatorio complejo cuando quieras usar la cookie segura, por ejemplo.

source: This attribute can also be configured from the config with the :data:`SECRET_KEY` configuration key. Defaults to ``None``.
es: Este atributo también se puede configurar desde la configuración con la clave de configuración :data:`SECRET_KEY`. El valor predeterminado es ``None``.

source: Returns ``True`` if autoescaping should be active for the given template name. If no template name is given, returns `True`.
es: Devuelve ``True`` si el autoescapado debe estar activo para el nombre de la plantilla dada. Si no se da ningún nombre de plantilla, devuelve ``True``.

source: Registers a shell context processor function.
es: Registra una función de procesador de contexto del shell.

source: This is called to figure out if an error should be ignored or not as far as the teardown system is concerned. If this function returns ``True`` then the teardown handlers will not be passed the error.
es: Se llama para averiguar si un error debe ser ignorado o no en lo que respecta al sistema de desmontaje. Si esta función devuelve ``True``, los gestores de desmontaje no recibirán el error.

source: The absolute path to the configured static folder. ``None`` if no static folder is set.
es: La ruta absoluta a la carpeta estática configurada. ``None`` si no se ha configurado ninguna carpeta estática.

source: The URL prefix that the static route will be accessible from.
es: El prefijo de la URL desde la que se podrá acceder a la ruta estática.

source: If it was not configured during init, it is derived from :attr:`static_folder`.
es: Si no se ha configurado durante el init, se deriva de :attr:`static_folder`.

source: Registers a function to be called when the application context is popped. The application context is typically popped after the request context for each request, at the end of CLI commands, or after a manually pushed context ends.
es: Registra una función que será llamada cuando el contexto de la aplicación sea extraído. El contexto de la aplicación se abre normalmente después del contexto de solicitud de cada petición, al final de los comandos de la CLI, o después de que un contexto empujado manualmente termine.

source: When the ``with`` block exits (or ``ctx.pop()`` is called), the teardown functions are called just before the app context is made inactive. Since a request context typically also manages an application context it would also be called when you pop a request context.
es: Cuando el bloque ``with`` sale (o se llama a ``ctx.pop()``), las funciones de desmontaje son llamadas justo antes de que el contexto de aplicación se vuelva inactivo. Dado que un contexto de petición normalmente también gestiona un contexto de aplicación, también se llamará cuando se haga desaparecer un contexto de petición.

source: When a teardown function was called because of an unhandled exception it will be passed an error object. If an :meth:`errorhandler` is registered, it will handle the exception and the teardown will not receive it.
es: Cuando se llama a una función de desmontaje debido a una excepción no manejada, se le pasa un objeto de error. Si se registra un :meth:`errorhandler`, éste manejará la excepción y el teardown no la recibirá.

source: Teardown functions must avoid raising exceptions. If they execute code that might fail they must surround that code with a ``try``/``except`` block and log any errors.
es: Las funciones de desmontaje deben evitar lanzar excepciones. Si ejecutan código que puede fallar deben rodear ese código con un bloque ``try``/``except`` y registrar cualquier error.

source: The return values of teardown functions are ignored.
es: Los valores de retorno de las funciones de desmontaje se ignoran.

source: Register a function to be called when the request context is popped. Typically this happens at the end of each request, but contexts may be pushed manually as well during testing.
es: Registra una función para ser llamada cuando el contexto de la solicitud es empujado. Normalmente, esto ocurre al final de cada solicitud, pero los contextos pueden ser empujados manualmente también durante las pruebas.

source: When the ``with`` block exits (or ``ctx.pop()`` is called), the teardown functions are called just before the request context is made inactive.
es: Cuando el bloque ``with`` sale (o se llama a ``ctx.pop()``), las funciones de desmontaje son llamadas justo antes de que el contexto de la petición se vuelva inactivo.

source: A decorator that is used to register custom template filter. You can specify a name for the filter, otherwise the function name will be used. Example::
es: Un decorador que se utiliza para registrar un filtro de plantilla personalizado. Puede especificar un nombre para el filtro, de lo contrario se utilizará el nombre de la función. Ejemplo::
