Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: For optimal performance when handling range requests, it's recommended that your response data object implements `seekable`, `seek` and `tell` methods as described by :py:class:`io.IOBase`. Objects returned by :meth:`~werkzeug.wsgi.wrap_file` automatically implement those methods.
es: Para obtener un rendimiento óptimo en el manejo de las solicitudes de rango, se recomienda que su objeto de datos de respuesta implemente los métodos `seekable`, `seek` y `tell` como se describe en :py:class:`io.IOBase`. Los objetos devueltos por :meth:`~werkzeug.wsgi.wrap_file` implementan automáticamente estos métodos.

source: It does not remove the body of the response because that's something the :meth:`__call__` function does for us automatically.
es: No elimina el cuerpo de la respuesta porque eso es algo que la función :meth:`__call__` hace por nosotros automáticamente.

source: Returns self so that you can do ``return resp.make_conditional(req)`` but modifies the object in-place.
es: Devuelve self para que puedas hacer ``return resp.make_conditional(req)`` pero modificando el objeto en el lugar.

source: a request object or WSGI environment to be used to make the response conditional against.
es: un objeto de solicitud o entorno WSGI que se utilizará para condicionar la respuesta.

source: Will be used only in valid Range Requests. It will set `Content-Range` complete length value and compute `Content-Length` real value. This parameter is mandatory for successful Range Requests completion.
es: Se utilizará sólo en las solicitudes válidas de Range. Establecerá el valor de longitud completa de `Content-Range` y calculará el valor real de `Content-Length`. Este parámetro es obligatorio para completar con éxito las solicitudes de rango.

source: raises
es: levanta

source: :class:`~werkzeug.exceptions.RequestedRangeNotSatisfiable` if `Range` header could not be parsed or satisfied.
es: :class:`~werkzeug.exceptions.RequestedRangeNotSatisfiable` si la cabecera `Range` no ha podido ser analizada o satisfecha.

source: Range processing is skipped if length is 0 instead of raising a 416 Range Not Satisfiable error.
es: El procesamiento del rango se salta si la longitud es 0 en lugar de lanzar un error 416 de rango no satisfactorio.

source: Converts the response iterator in a list. By default this happens automatically if required. If `implicit_sequence_conversion` is disabled, this method is not automatically called and some properties might raise exceptions. This also encodes all the items.
es: Convierte el iterador de respuesta en una lista. Por defecto, esto ocurre automáticamente si es necesario. Si `implicit_sequence_conversion` está deshabilitado, este método no se llama automáticamente y algunas propiedades podrían lanzar excepciones. Esto también codifica todos los elementos.

source: The mimetype (content type without charset etc.)
es: El mimetype (tipo de contenido sin charset, etc.)

source: The mimetype parameters as dict. For example if the content type is ``text/html; charset=utf-8`` the params would be ``{'charset': 'utf-8'}``.
es: Los parámetros de mimetype como dict. Por ejemplo, si el tipo de contenido es ``text/html; charset=utf-8`` los parámetros serían ``{'charset': 'utf-8'}``.

source: The Retry-After response-header field can be used with a 503 (Service Unavailable) response to indicate how long the service is expected to be unavailable to the requesting client.
es: El campo Retry-After response-header puede utilizarse con una respuesta 503 (Service Unavailable) para indicar cuánto tiempo se espera que el servicio no esté disponible para el cliente solicitante.

source: Time in seconds until expiration or date.
es: Tiempo en segundos hasta el vencimiento o la fecha.

source: Sets a cookie.
es: Establece una cookie.

source: A warning is raised if the size of the cookie header exceeds :attr:`max_cookie_size`, but the header will still be set.
es: Se produce una advertencia si el tamaño de la cabecera de la cookie excede :attr:`max_cookie_size`, pero la cabecera seguirá siendo establecida.

source: the key (name) of the cookie to be set.
es: la clave (nombre) de la cookie que se va a establecer.

source: the value of the cookie.
es: el valor de la cookie.

source: should be a number of seconds, or `None` (default) if the cookie should last only as long as the client's browser session.
es: debe ser un número de segundos, o `None` (por defecto) si la cookie debe durar sólo mientras la sesión del navegador del cliente.

source: should be a `datetime` object or UNIX timestamp.
es: debe ser un objeto `datetime` o una marca de tiempo UNIX.

source: limits the cookie to a given path, per default it will span the whole domain.
es: limita la cookie a una ruta determinada, por defecto abarcará todo el dominio.

source: Sets a new string as response. The value must be a string or bytes. If a string is set it's encoded to the charset of the response (utf-8 by default).
es: Establece una nueva cadena como respuesta. El valor debe ser una cadena o bytes. Si se establece una cadena, se codifica con el conjunto de caracteres de la respuesta (utf-8 por defecto).

source: Set the etag, and override the old one if there was one.
es: Establece el etag, y anula el anterior si lo hubiera.

source: The HTTP status code as a string.
es: El código de estado HTTP como una cadena.

source: The HTTP status code as a number.
es: El código de estado HTTP como un número.

source: The response iterable as write-only stream.
es: La respuesta iterable como flujo de sólo escritura.

source: The Vary field value indicates the set of request-header fields that fully determines, while the response is fresh, whether a cache is permitted to use the response to reply to a subsequent request without revalidation.
es: El valor del campo Vary indica el conjunto de campos de la cabecera de la solicitud que determina completamente, mientras la respuesta está fresca, si se permite que una caché utilice la respuesta para responder a una solicitud posterior sin revalidación.

source: Pass the response body directly through as the WSGI iterable. This can be used when the body is a binary file or other iterator of bytes, to skip some unnecessary checks. Use :func:`~werkzeug.utils.send_file` instead of setting this manually.
es: Pasar el cuerpo de la respuesta directamente como el iterable WSGI. Esto puede usarse cuando el cuerpo es un archivo binario u otro iterable de bytes, para saltarse algunas comprobaciones innecesarias. Utilice :func:`~werkzeug.utils.send_file` en lugar de establecerlo manualmente.

source: Read-only view of the :data:`MAX_COOKIE_SIZE` config key.
es: Vista de sólo lectura de la clave de configuración :data:`MAX_COOKIE_SIZE`.

source: See :attr:`~werkzeug.wrappers.Response.max_cookie_size` in Werkzeug's docs.
es: Ver :attr:`~werkzeug.wrappers.Response.max_cookie_size` en la documentación de Werkzeug.

source: Sessions
es: Sesiones

source: If you have set :attr:`Flask.secret_key` (or configured it from :data:`SECRET_KEY`) you can use sessions in Flask applications. A session makes it possible to remember information from one request to another. The way Flask does this is by using a signed cookie. The user can look at the session contents, but can't modify it unless they know the secret key, so make sure to set that to something complex and unguessable.
es: Si has establecido :attr:`Flask.secret_key` (o lo has configurado desde :data:`SECRET_KEY`) puedes utilizar sesiones en las aplicaciones Flask. Una sesión permite recordar información de una solicitud a otra. La forma en que Flask hace esto es utilizando una cookie firmada. El usuario puede ver el contenido de la sesión, pero no puede modificarlo a menos que conozca la clave secreta, así que asegúrate de establecerla con algo complejo e indescifrable.

source: To access the current session you can use the :class:`session` object:
es: Para acceder a la sesión actual puede utilizar el objeto :class:`session`:

source: The session object works pretty much like an ordinary dict, with the difference that it keeps track of modifications.
es: El objeto de sesión funciona de forma muy parecida a un dict ordinario, con la diferencia de que lleva la cuenta de las modificaciones.

source: The following attributes are interesting:
es: Los siguientes atributos son interesantes:

source: ``True`` if the session is new, ``False`` otherwise.
es: ``True`` si la sesión es nueva, ``False`` en caso contrario.

source: Session Interface
es: Interfaz de la sesión

source: The session interface provides a simple way to replace the session implementation that Flask is using.
es: La interfaz de sesión proporciona una forma sencilla de reemplazar la implementación de sesión que utiliza Flask.

source: The basic interface you have to implement in order to replace the default session interface which uses werkzeug's securecookie implementation. The only methods you have to implement are :meth:`open_session` and :meth:`save_session`, the others have useful defaults which you don't need to change.
es: La interfaz básica que tienes que implementar para reemplazar la interfaz de sesión por defecto que utiliza la implementación de securecookie de werkzeug. Los únicos métodos que tienes que implementar son :meth:`open_session` y :meth:`save_session`, los demás tienen útiles valores por defecto que no necesitas cambiar.

source: The session object returned by the :meth:`open_session` method has to provide a dictionary like interface plus the properties and methods from the :class:`SessionMixin`. We recommend just subclassing a dict and adding that mixin::
es: El objeto de sesión devuelto por el método :meth:`open_session` tiene que proporcionar una interfaz similar a la de un diccionario, además de las propiedades y métodos de la :class:`SessionMixin`. Recomendamos simplemente subclasificar un diccionario y añadir ese mixin::

source: If :meth:`open_session` returns ``None`` Flask will call into :meth:`make_null_session` to create a session that acts as replacement if the session support cannot work because some requirement is not fulfilled. The default :class:`NullSession` class that is created will complain that the secret key was not set.
es: Si :meth:`open_session` devuelve ``None`` Flask llamará a :meth:`make_null_session` para crear una sesión que actúe como reemplazo si el soporte de sesión no puede funcionar porque no se cumple algún requisito. La clase :class:`NullSession` por defecto que se crea se quejará de que no se ha establecido la clave secreta.

source: To replace the session interface on an application all you have to do is to assign :attr:`flask.Flask.session_interface`::
es: Para reemplazar la interfaz de sesión en una aplicación todo lo que tienes que hacer es asignar :attr:`flask.Flask.session_interface`::

source: Multiple requests with the same session may be sent and handled concurrently. When implementing a new session interface, consider whether reads or writes to the backing store must be synchronized. There is no guarantee on the order in which the session for each request is opened or saved, it will occur in the order that requests begin and end processing.
es: Se pueden enviar y gestionar simultáneamente varias solicitudes con la misma sesión. Al implementar una nueva interfaz de sesión, hay que tener en cuenta si las lecturas o escrituras en el almacén de respaldo deben estar sincronizadas. No se garantiza el orden en el que se abre o guarda la sesión para cada solicitud, se producirá en el orden en el que las solicitudes comienzan y terminan de procesarse.

source: :meth:`make_null_session` will look here for the class that should be created when a null session is requested. Likewise the :meth:`is_null_session` method will perform a typecheck against this type.
es: :meth:`make_null_session` buscará aquí la clase que debe crearse cuando se solicita una sesión nula. Del mismo modo, el método :meth:`is_null_session` realizará una comprobación de tipo con respecto a esta clase.

source: A flag that indicates if the session interface is pickle based. This can be used by Flask extensions to make a decision in regards to how to deal with the session object.
es: Una bandera que indica si la interfaz de sesión está basada en pickle. Esto puede ser utilizado por las extensiones de Flask para tomar una decisión con respecto a cómo tratar el objeto de sesión.

source: Creates a null session which acts as a replacement object if the real session support could not be loaded due to a configuration error. This mainly aids the user experience because the job of the null session is to still support lookup without complaining but modifications are answered with a helpful error message of what failed.
es: Crea una sesión nula que actúa como objeto de reemplazo si el soporte de la sesión real no pudo ser cargado debido a un error de configuración. Esto ayuda principalmente a la experiencia del usuario porque el trabajo de la sesión nula es seguir soportando la búsqueda sin quejarse, pero las modificaciones se responden con un mensaje de error útil de lo que falló.

source: This creates an instance of :attr:`null_session_class` by default.
es: Esto crea una instancia de :attr:`null_session_class` por defecto.

source: Checks if a given object is a null session. Null sessions are not asked to be saved.
es: Comprueba si un objeto dado es una sesión nula. No se pide que se guarden las sesiones nulas.

source: This checks if the object is an instance of :attr:`null_session_class` by default.
es: Comprueba si el objeto es una instancia de :attr:`null_session_class` por defecto.

source: Returns the path for which the cookie should be valid. The default implementation uses the value from the ``SESSION_COOKIE_PATH`` config var if it's set, and falls back to ``APPLICATION_ROOT`` or uses ``/`` if it's ``None``.
es: Devuelve la ruta para la que la cookie debe ser válida. La implementación por defecto utiliza el valor de la var de configuración ``SESSION_COOKIE_PATH`` si está establecida, y vuelve a ``APPLICATION_ROOT`` o utiliza ``/`` si es ``None``.

source: Returns True if the session cookie should be httponly. This currently just returns the value of the ``SESSION_COOKIE_HTTPONLY`` config var.
es: Devuelve True si la cookie de sesión debe ser httponly. Actualmente sólo devuelve el valor de la varilla de configuración ``SESSION_COOKIE_HTTPONLY``.

source: Returns True if the cookie should be secure. This currently just returns the value of the ``SESSION_COOKIE_SECURE`` setting.
es: Devuelve True si la cookie debe ser segura. Actualmente sólo devuelve el valor del ajuste ``SESSION_COOKIE_SECURE``.

source: Return ``'Strict'`` or ``'Lax'`` if the cookie should use the ``SameSite`` attribute. This currently just returns the value of the :data:`SESSION_COOKIE_SAMESITE` setting.
es: Devuelve ``'Strict'`` o ``'Lax'`` si la cookie debe utilizar el atributo ``SameSite``. Actualmente sólo devuelve el valor del ajuste :data:`SESSION_COOKIE_SAMESITE`.

source: A helper method that returns an expiration date for the session or ``None`` if the session is linked to the browser session. The default implementation returns now + the permanent session lifetime configured on the application.
es: Un método de ayuda que devuelve una fecha de caducidad para la sesión o ``None`` si la sesión está vinculada a la sesión del navegador. La implementación por defecto devuelve now + el tiempo de vida de la sesión permanente configurada en la aplicación.

source: Used by session backends to determine if a ``Set-Cookie`` header should be set for this session cookie for this response. If the session has been modified, the cookie is set. If the session is permanent and the ``SESSION_REFRESH_EACH_REQUEST`` config is true, the cookie is always set.
es: Utilizado por los backends de sesión para determinar si se debe establecer una cabecera ``Set-Cookie`` para esta cookie de sesión para esta respuesta. Si la sesión ha sido modificada, se establece la cookie. Si la sesión es permanente y la configuración ``SESSION_REFRESH_EACH_REQUEST`` es verdadera, la cookie se establece siempre.

source: This check is usually skipped if the session was deleted.
es: Esta comprobación suele omitirse si la sesión se ha eliminado.

source: This is called at the beginning of each request, after pushing the request context, before matching the URL.
es: Se llama al principio de cada solicitud, después de empujar el contexto de la solicitud, antes de hacer coincidir la URL.

source: This must return an object which implements a dictionary-like interface as well as the :class:`SessionMixin` interface.
es: Debe devolver un objeto que implemente una interfaz tipo diccionario, así como la interfaz :class:`SessionMixin`.

source: This will return ``None`` to indicate that loading failed in some way that is not immediately an error. The request context will fall back to using :meth:`make_null_session` in this case.
es: Esto devolverá ``None`` para indicar que la carga falló de alguna manera que no es inmediatamente un error. El contexto de la solicitud volverá a utilizar :meth:`make_null_session` en este caso.

source: This is called at the end of each request, after generating a response, before removing the request context. It is skipped if :meth:`is_null_session` returns ``True``.
es: Se llama al final de cada solicitud, después de generar una respuesta, antes de eliminar el contexto de la solicitud. Se omite si :meth:`is_null_session` devuelve ``True``.

source: The default session interface that stores sessions in signed cookies through the :mod:`itsdangerous` module.
es: La interfaz de sesión por defecto que almacena las sesiones en cookies firmadas a través del módulo :mod:`itsdangerous`.

source: the salt that should be applied on top of the secret key for the signing of cookie based sessions.
es: la sal que debe aplicarse sobre la clave secreta para la firma de las sesiones basadas en cookies.

source: the hash function to use for the signature. The default is sha1
es: la función hash a utilizar para la firma. El valor por defecto es sha1

source: the name of the itsdangerous supported key derivation. The default is hmac.
es: el nombre de la derivación de clave soportada por itsdangerous. El valor por defecto es hmac.

source: A python serializer for the payload. The default is a compact JSON derived serializer with support for some extra Python types such as datetime objects or tuples.
es: Un serializador de Python para la carga útil. El valor por defecto es un serializador compacto derivado de JSON con soporte para algunos tipos extra de Python como objetos datetime o tuplas.

source: Base class for sessions based on signed cookies.
es: Clase base para sesiones basadas en cookies firmadas.

source: This session backend will set the :attr:`modified` and :attr:`accessed` attributes. It cannot reliably track whether a session is new (vs. empty), so :attr:`new` remains hard coded to ``False``.
es: Este backend de sesión establecerá los atributos :attr:`modified` y :attr:`accessed`. No se puede saber de forma fiable si una sesión es nueva (frente a una vacía), por lo que :attr:`new` permanece codificado en ``False``.

source: When data is changed, this is set to ``True``. Only the session dictionary itself is tracked; if the session contains mutable data (for example a nested dict) then this must be set to ``True`` manually when modifying that data. The session cookie will only be written to the response if this is ``True``.
es: Cuando se modifican los datos, esto se establece como ``True``. Sólo se rastrea el diccionario de sesión en sí mismo; si la sesión contiene datos mutables (por ejemplo, un dict anidado) entonces esto debe ser establecido a ``True`` manualmente cuando se modifican esos datos. La cookie de sesión sólo se escribirá en la respuesta si es ``True``.

source: header, which allows caching proxies to cache different pages for different users.
es: que permite a los proxies de caché almacenar en caché diferentes páginas para diferentes usuarios.

source: Return the value for key if key is in the dictionary, else default.
es: Devuelve el valor de la clave si la clave está en el diccionario, si no, por defecto.

source: Insert key with a value of default if key is not in the dictionary.
es: Inserta la clave con un valor por defecto si la clave no está en el diccionario.

source: Class used to generate nicer error messages if sessions are not available. Will still allow read-only access to the empty session but fail on setting.
es: Clase utilizada para generar mensajes de error más agradables si las sesiones no están disponibles. Seguirá permitiendo el acceso de sólo lectura a la sesión vacía, pero fallará al establecerla.

source: Remove and return a (key, value) pair as a 2-tuple.
es: Elimina y devuelve un par (clave, valor) como una 2-tupla.

source: Pairs are returned in LIFO (last-in, first-out) order. Raises KeyError if the dict is empty.
es: Los pares se devuelven en orden LIFO (last-in, first-out). Se produce un KeyError si el dict está vacío.

source: If E is present and has a .keys() method, then does: for k in E: D[k] = E[k] If E is present and lacks a .keys() method, then does: for k, v in E: D[k] = v In either case, this is followed by: for k in F: D[k] = F[k]
es: Si E está presente y tiene un método .keys(), entonces hace: for k en E: D[k] = E[k] Si E está presente y carece de un método .keys(), entonces hace: for k, v en E: D[k] = v En cualquier caso, esto es seguido por: for k en F: D[k] = F[k]

source: Expands a basic dictionary with session attributes.
es: Amplía un diccionario básico con atributos de sesión.

source: This reflects the ``'_permanent'`` key in the dict.
es: Esto refleja la clave "_permanente" en el dict.

source: Some implementations can detect changes to the session and set this when that happens. The mixin default is hard coded to ``True``.
es: Algunas implementaciones pueden detectar cambios en la sesión y establecer esto cuando sucede. El mixin por defecto está codificado en ``True``.

source: Some implementations can detect when session data is read or written and set this when that happens. The mixin default is hard coded to ``True``.
es: Algunas implementaciones pueden detectar cuando se leen o escriben datos de la sesión y establecer esto cuando sucede. El mixin por defecto está codificado en ``True``.

source: Notice
es: Aviso

source: Works like a regular Werkzeug test client but has knowledge about Flask's contexts to defer the cleanup of the request context until the end of a ``with`` block. For general information about how to use this class refer to :class:`werkzeug.test.Client`.
es: Funciona como un cliente de prueba Werkzeug normal, pero tiene conocimiento de los contextos de Flask para aplazar la limpieza del contexto de la solicitud hasta el final de un bloque ``with``. Para información general sobre cómo usar esta clase, consulta :class:`werkzeug.test.Client`.

source: `app.test_client()` includes preset default environment, which can be set after instantiation of the `app.test_client()` object in `client.environ_base`.
es: `app.test_client()` incluye un entorno predeterminado, que se puede establecer después de la instanciación del objeto `app.test_client()` en `client.environ_base`.

source: Basic usage is outlined in the :doc:`/testing` chapter.
es: El uso básico se describe en el capítulo :doc:`/testing`.
