Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: This works exactly like the method of the same name on a regular :class:`click.Group` but it wraps callbacks in :func:`with_appcontext` unless it's disabled by passing ``with_appcontext=False``.
es: Esto funciona exactamente igual que el método del mismo nombre en un :class:`click.Group` normal, pero envuelve las devoluciones de llamada en :func:`with_appcontext` a menos que se desactive pasando ``with_appcontext=False``.

source: This works exactly like the method of the same name on a regular :class:`click.Group` but it defaults the group class to :class:`AppGroup`.
es: Esto funciona exactamente igual que el método del mismo nombre en un :class:`click.Group` normal, pero por defecto la clase del grupo es :class:`AppGroup`.

source: Helper object to deal with Flask applications. This is usually not necessary to interface with as it's used internally in the dispatching to click. In future versions of Flask this object will most likely play a bigger role. Typically it's created automatically by the :class:`FlaskGroup` but you can also manually create it and pass it onwards as click object.
es: Objeto de ayuda para tratar con las aplicaciones de Flask. Normalmente no es necesario interactuar con él, ya que se utiliza internamente en el envío a click. En futuras versiones de Flask este objeto probablemente jugará un papel más importante. Normalmente es creado automáticamente por la clase :class:`FlaskGroup` pero también se puede crear manualmente y pasarlo como objeto click.

source: Optionally the import path for the Flask application.
es: Opcionalmente la ruta de importación de la aplicación Flask.

source: Optionally a function that is passed the script info to create the instance of the application.
es: Opcionalmente una función a la que se le pasa la información del script para crear la instancia de la aplicación.

source: A dictionary with arbitrary data that can be associated with this script info.
es: Un diccionario con datos arbitrarios que se pueden asociar a esta información del script.

source: Loads the Flask app (if not yet loaded) and returns it. Calling this multiple times will just result in the already loaded app to be returned.
es: Carga la aplicación Flask (si aún no está cargada) y la devuelve. Si se llama a esto varias veces, sólo se devolverá la aplicación ya cargada.

source: This is a no-op if `python-dotenv`_ is not installed.
es: Esto es un no-op si `python-dotenv`_ no está instalado.

source: The current directory is not changed to the location of the loaded file.
es: El directorio actual no se cambia a la ubicación del archivo cargado.

source: When loading the env files, set the default encoding to UTF-8.
es: Al cargar los archivos env, establezca la codificación por defecto en UTF-8.

source: Returns ``False`` when python-dotenv is not installed, or when the given path isn't a file.
es: Devuelve ``False`` cuando python-dotenv no está instalado, o cuando la ruta dada no es un archivo.

source: Wraps a callback so that it's guaranteed to be executed with the script's application context.
es: Envuelve una llamada de retorno para que se garantice su ejecución con el contexto de la aplicación del script.

source: Custom commands (and their options) registered under ``app.cli`` or ``blueprint.cli`` will always have an app context available, this decorator is not required in that case.
es: Los comandos personalizados (y sus opciones) registrados en ``app.cli`` o ``blueprint.cli`` siempre tendrán un contexto de aplicación disponible, este decorador no es necesario en ese caso.

source: The app context is active for subcommands as well as the decorated callback. The app context is always available to ``app.cli`` command and parameter callbacks.
es: El contexto de la aplicación está activo para los subcomandos, así como para la devolución de llamada decorada. El contexto de la aplicación siempre está disponible para las devoluciones de llamada de comandos y parámetros de ``app.cli``.

source: Marks a function so that an instance of :class:`ScriptInfo` is passed as first argument to the click callback.
es: Marca una función para que se pase una instancia de :class:`ScriptInfo` como primer argumento a la llamada de retorno del clic.

source: Run a local development server.
es: Ejecutar un servidor de desarrollo local.

source: This server is for development purposes only. It does not provide the stability, security, or performance of production WSGI servers.
es: Este servidor es sólo para fines de desarrollo. No proporciona la estabilidad, seguridad o rendimiento de los servidores WSGI de producción.

source: Run an interactive Python shell in the context of a given Flask application. The application will populate the default namespace of this shell according to its configuration.
es: Ejecuta un shell interactivo de Python en el contexto de una aplicación Flask determinada. La aplicación rellenará el espacio de nombres por defecto de este shell según su configuración.

source: This is useful for executing small snippets of management code without having to manually configure the application.
es: Esto es útil para ejecutar pequeños fragmentos de código de gestión sin tener que configurar manualmente la aplicación.
