Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: Application Object
es: Objeto Application

source: The flask object implements a WSGI application and acts as the central object. It is passed the name of the module or package of the application. Once it is created it will act as a central registry for the view functions, the URL rules, template configuration and much more.
es: El objeto flask implementa una aplicación WSGI y actúa como objeto central. Se le pasa el nombre del módulo o paquete de la aplicación. Una vez creado actuará como un registro central para las funciones de la vista, las reglas de la URL, la configuración de la plantilla y mucho más.

source: The name of the package is used to resolve resources from inside the package or the folder the module is contained in depending on if the package parameter resolves to an actual python package (a folder with an :file:`__init__.py` file inside) or a standard module (just a ``.py`` file).
es: El nombre del paquete se utiliza para resolver los recursos de dentro del paquete o de la carpeta en la que está contenido el módulo, dependiendo de si el parámetro paquete resuelve a un paquete python real (una carpeta con un archivo :file:`__init__.py` dentro) o a un módulo estándar (sólo un archivo ``.py``).

source: For more information about resource loading, see :func:`open_resource`.
es: Para más información sobre la carga de recursos, véase :func:`open_resource`.

source: Usually you create a :class:`Flask` instance in your main module or in the :file:`__init__.py` file of your package like this::
es: Normalmente creas una instancia :class:`Flask` en tu módulo principal o en el archivo :file:`__init__.py` de tu paquete así::

source: About the First Parameter
es: Sobre el primer parámetro

source: The idea of the first parameter is to give Flask an idea of what belongs to your application. This name is used to find resources on the filesystem, can be used by extensions to improve debugging information and a lot more.
es: La idea del primer parámetro es dar a Flask una idea de lo que pertenece a tu aplicación. Este nombre se utiliza para encontrar recursos en el sistema de archivos, puede ser utilizado por las extensiones para mejorar la información de depuración y mucho más.

source: So it's important what you provide there. If you are using a single module, `__name__` is always the correct value. If you however are using a package, it's usually recommended to hardcode the name of your package there.
es: Así que es importante lo que proporcione allí. Si estás usando un módulo único, `__name__` es siempre el valor correcto. Sin embargo, si estás usando un paquete, normalmente se recomienda codificar el nombre de tu paquete allí.

source: For example if your application is defined in :file:`yourapplication/app.py` you should create it with one of the two versions below::
es: Por ejemplo, si su aplicación está definida en :file:`yourapplication/app.py` debe crearla con una de las dos versiones siguientes::

source: Why is that? The application will work even with `__name__`, thanks to how resources are looked up. However it will make debugging more painful. Certain extensions can make assumptions based on the import name of your application. For example the Flask-SQLAlchemy extension will look for the code in your application that triggered an SQL query in debug mode. If the import name is not properly set up, that debugging information is lost. (For example it would only pick up SQL queries in `yourapplication.app` and not `yourapplication.views.frontend`)
es: ¿Por qué? La aplicación funcionará incluso con `__name__`, gracias a cómo se buscan los recursos. Sin embargo, esto hará que la depuración sea más dolorosa. Algunas extensiones pueden hacer suposiciones basadas en el nombre de importación de tu aplicación. Por ejemplo, la extensión Flask-SQLAlchemy buscará el código en tu aplicación que ha lanzado una consulta SQL en modo de depuración. Si el nombre de importación no está bien configurado, esa información de depuración se pierde. (Por ejemplo, sólo recogerá las consultas SQL en `tuaplicacion.app` y no en `tuaplicacion.views.frontend`)

source: The ``host_matching`` and ``static_host`` parameters were added.
es: Se han añadido los parámetros ``host_matching`` y ``static_host``.

source: The ``subdomain_matching`` parameter was added. Subdomain matching needs to be enabled manually now. Setting :data:`SERVER_NAME` does not implicitly enable it.
es: Se ha añadido el parámetro ``subdomain_matching``. Ahora es necesario habilitar manualmente la coincidencia de subdominios. La configuración de :data:`SERVER_NAME` no la activa implícitamente.

source: The `root_path` parameter was added.
es: Se ha añadido el parámetro `root_path`.

source: The `instance_path` and `instance_relative_config` parameters were added.
es: Se han añadido los parámetros `instance_path` y `instance_relative_config`.

source: The `static_url_path`, `static_folder`, and `template_folder` parameters were added.
es: Se han añadido los parámetros `static_url_path`, `static_folder` y `template_folder`.

source: the name of the application package
es: el nombre del paquete de aplicaciones

source: can be used to specify a different path for the static files on the web. Defaults to the name of the `static_folder` folder.
es: se puede utilizar para especificar una ruta diferente para los archivos estáticos en la web. Por defecto, el nombre de la carpeta es `static_folder`.

source: The folder with static files that is served at ``static_url_path``. Relative to the application ``root_path`` or an absolute path. Defaults to ``'static'``.
es: La carpeta con archivos estáticos que se sirve en ``static_url_path``. Relativo a la aplicación ``root_path`` o una ruta absoluta. El valor predeterminado es ``'static``.

source: the host to use when adding the static route. Defaults to None. Required when using ``host_matching=True`` with a ``static_folder`` configured.
es: el host que se utilizará al añadir la ruta estática. El valor predeterminado es None. Se requiere cuando se utiliza ``host_matching=True`` con una ``carpeta estática`` configurada.

source: set ``url_map.host_matching`` attribute. Defaults to False.
es: establece el atributo ``url_map.host_matching``. Por defecto es False.

source: consider the subdomain relative to :data:`SERVER_NAME` when matching routes. Defaults to False.
es: considerar el subdominio relativo a :data:`SERVER_NAME` cuando se comparan las rutas. Por defecto es False.

source: the folder that contains the templates that should be used by the application. Defaults to ``'templates'`` folder in the root path of the application.
es: la carpeta que contiene las plantillas que debe utilizar la aplicación. Por defecto es la carpeta ``'templates'`` en la ruta raíz de la aplicación.

source: An alternative instance path for the application. By default the folder ``'instance'`` next to the package or module is assumed to be the instance path.
es: Una ruta de instancia alternativa para la aplicación. Por defecto, se asume que la carpeta ``instancia`` junto al paquete o módulo es la ruta de la instancia.

source: if set to ``True`` relative filenames for loading the config are assumed to be relative to the instance path instead of the application root.
es: si se establece como ``True`` se asume que los nombres de archivos relativos para cargar la configuración son relativos a la ruta de la instancia en lugar de la raíz de la aplicación.

source: The path to the root of the application files. This should only be set manually when it can't be detected automatically, such as for namespace packages.
es: La ruta a la raíz de los archivos de la aplicación. Sólo debe establecerse manualmente cuando no pueda detectarse automáticamente, como en el caso de los paquetes de espacios de nombres.

source: the session interface to use. By default an instance of :class:`~flask.sessions.SecureCookieSessionInterface` is used here.
es: la interfaz de sesión a utilizar. Por defecto se utiliza una instancia de :class:`~flask.sessions.SecureCookieSessionInterface`.

source: The Click command group for registering CLI commands for this object. The commands are available from the ``flask`` command once the application has been discovered and blueprints have been registered.
es: El grupo de comandos Click para registrar los comandos CLI para este objeto. Los comandos están disponibles desde el comando ``flask`` una vez que se ha descubierto la aplicación y se han registrado los blueprints.

source: Used by :func:`send_file` to determine the ``max_age`` cache value for a given file path if it wasn't passed.
es: Utilizado por :func:`send_file` para determinar el valor de la caché ``max_age`` para una ruta de archivo dada si no se ha pasado.

source: By default, this returns :data:`SEND_FILE_MAX_AGE_DEFAULT` from the configuration of :data:`~flask.current_app`. This defaults to ``None``, which tells the browser to use conditional requests instead of a timed cache, which is usually preferable.
es: Por defecto, esto devuelve :data:`SEND_FILE_MAX_AGE_DEFAULT` de la configuración de :data:`~flask.current_app`. Este valor por defecto es ``None``, lo que indica al navegador que utilice peticiones condicionales en lugar de una caché temporizada, lo que suele ser preferible.

source: The default configuration is ``None`` instead of 12 hours.
es: La configuración por defecto es ``None`` en lugar de 12 horas.

source: The view function used to serve files from :attr:`static_folder`. A route is automatically registered for this view at :attr:`static_url_path` if :attr:`static_folder` is set.
es: La función de la vista utilizada para servir archivos desde :attr:`carpeta_estática`. Se registra automáticamente una ruta para esta vista en :attr:`static_url_path` si se establece :attr:`static_folder`.

source: Open a resource file relative to :attr:`root_path` for reading.
es: Abre un archivo de recursos relativo a :attr:`root_path` para su lectura.

source: For example, if the file ``schema.sql`` is next to the file ``app.py`` where the ``Flask`` app is defined, it can be opened with:
es: Por ejemplo, si el archivo ``schema.sql`` está junto al archivo ``app.py`` donde está definida la aplicación ``Flask``, se puede abrir con:

source: Path to the resource relative to :attr:`root_path`.
es: Ruta del recurso relativa a :attr:`root_path`.

source: Create the Jinja environment based on :attr:`jinja_options` and the various Jinja-related methods of the app. Changing :attr:`jinja_options` after this will have no effect. Also adds Flask-related globals and filters to the environment.
es: Crea el entorno Jinja basado en :attr:`jinja_options` y en los distintos métodos de la aplicación relacionados con Jinja. Cambiar :attr:`jinja_options` después de esto no tendrá ningún efecto. También añade al entorno los globales y filtros relacionados con Flask.

source: ``Environment.auto_reload`` set in accordance with ``TEMPLATES_AUTO_RELOAD`` configuration option.
es: ``Environment.auto_reload`` establecido de acuerdo con la opción de configuración ``TEMPLATES_AUTO_RELOAD``.

source: Creates a URL adapter for the given request. The URL adapter is created at a point where the request context is not yet set up so the request is passed explicitly.
es: Crea un adaptador de URL para la solicitud dada. El adaptador de URL se crea en un punto en el que el contexto de la solicitud aún no está configurado, por lo que la solicitud se pasa explícitamente.

source: :data:`SERVER_NAME` no longer implicitly enables subdomain matching. Use :attr:`subdomain_matching` instead.
es: :data:`SERVER_NAME` ya no permite implícitamente la coincidencia de subdominios. Utilice :attr:`subdomain_matching` en su lugar.

source: Update the template context with some commonly used variables. This injects request, session, config and g into the template context as well as everything template context processors want to inject. Note that the as of Flask 0.6, the original values in the context will not be overridden if a context processor decides to return a value with the same key.
es: Actualiza el contexto de la plantilla con algunas variables de uso común. Esto inyecta request, session, config y g en el contexto de la plantilla, así como todo lo que los procesadores de contexto de la plantilla quieran inyectar. Ten en cuenta que a partir de Flask 0.6, los valores originales del contexto no serán anulados si un procesador de contexto decide devolver un valor con la misma clave.

source: the context as a dictionary that is updated in place to add extra variables.
es: el contexto como un diccionario que se actualiza en el lugar para añadir variables adicionales.

source: Returns the shell context for an interactive shell for this application. This runs all the registered shell context processors.
es: Devuelve el contexto de shell para un shell interactivo para esta aplicación. Esto ejecuta todos los procesadores de contexto de shell registrados.

source: Runs the application on a local development server.
es: Ejecuta la aplicación en un servidor de desarrollo local.

source: Do not use ``run()`` in a production setting. It is not intended to meet security and performance requirements for a production server. Instead, see :doc:`/deploying/index` for WSGI server recommendations.
es: No utilice ``run()`` en un entorno de producción. No está pensado para cumplir con los requisitos de seguridad y rendimiento de un servidor de producción. En su lugar, consulte :doc:`/deploying/index` para ver las recomendaciones sobre servidores WSGI.

source: If the :attr:`debug` flag is set the server will automatically reload for code changes and show a debugger in case an exception happened.
es: Si se establece la bandera :attr:`debug` el servidor se recargará automáticamente para los cambios de código y mostrará un depurador en caso de que se produzca una excepción.

source: If you want to run the application in debug mode, but disable the code execution on the interactive debugger, you can pass ``use_evalex=False`` as parameter. This will keep the debugger's traceback screen active, but disable code execution.
es: Si quieres ejecutar la aplicación en modo de depuración, pero deshabilitar la ejecución de código en el depurador interactivo, puedes pasar ``use_evalex=False`` como parámetro. Esto mantendrá activa la pantalla de rastreo del depurador, pero deshabilitará la ejecución de código.

source: It is not recommended to use this function for development with automatic reloading as this is badly supported. Instead you should be using the :command:`flask` command line script's ``run`` support.
es: No se recomienda utilizar esta función para el desarrollo con recarga automática, ya que está mal soportada. En su lugar, debería utilizar el soporte de la línea de comandos de :command:`flask` de ``run``.

source: Keep in Mind
es: Tenga en cuenta

source: Flask will suppress any server error with a generic error page unless it is in debug mode. As such to enable just the interactive debugger without the code reloading, you have to invoke :meth:`run` with ``debug=True`` and ``use_reloader=False``. Setting ``use_debugger`` to ``True`` without being in debug mode won't catch any exceptions because there won't be any to catch.
es: Flask suprimirá cualquier error del servidor con una página de error genérica a menos que esté en modo de depuración. Por lo tanto, para activar sólo el depurador interactivo sin la recarga de código, tienes que invocar :meth:`run` con ``debug=True`` y ``use_reloader=False``. Si estableces ``use_debugger`` a ``True`` sin estar en modo de depuración no atraparás ninguna excepción porque no habrá ninguna que atrapar.

source: the hostname to listen on. Set this to ``'0.0.0.0'`` to have the server available externally as well. Defaults to ``'127.0.0.1'`` or the host in the ``SERVER_NAME`` config variable if present.
es: el nombre de host para escuchar. Establezca este valor a ``'0.0.0.0'`` para tener el servidor disponible externamente también. Por defecto es ``'127.0.0.1'`` o el host en la variable de configuración ``SERVER_NAME`` si está presente.

source: the port of the webserver. Defaults to ``5000`` or the port defined in the ``SERVER_NAME`` config variable if present.
es: el puerto del servidor web. Por defecto es ``5000`` o el puerto definido en la variable de configuración ``SERVER_NAME`` si está presente.

source: if given, enable or disable debug mode. See :attr:`debug`.
es: si se da, activa o desactiva el modo de depuración. Ver :attr:`debug`.

source: Load the nearest :file:`.env` and :file:`.flaskenv` files to set environment variables. Will also change the working directory to the directory containing the first file found.
es: Carga los archivos :file:`.env` y :file:`.flaskenv` más cercanos para establecer las variables de entorno. También cambiará el directorio de trabajo al directorio que contenga el primer archivo encontrado.

source: the options to be forwarded to the underlying Werkzeug server. See :func:`werkzeug.serving.run_simple` for more information.
es: las opciones que deben ser reenviadas al servidor Werkzeug subyacente. Ver :func:`werkzeug.serving.run_simple` para más información.

source: If installed, python-dotenv will be used to load environment variables from :file:`.env` and :file:`.flaskenv` files.
es: Si se instala, python-dotenv se utilizará para cargar las variables de entorno de los archivos :file:`.env` y :file:`.flaskenv`.

source: Threaded mode is enabled by default.
es: El modo de hilos está activado por defecto.

source: The default port is now picked from the ``SERVER_NAME`` variable.
es: El puerto por defecto se elige ahora a partir de la variable ``SERVER_NAME``.

source: Creates a test client for this application. For information about unit testing head over to :doc:`/testing`.
es: Crea un cliente de prueba para esta aplicación. Para obtener información sobre las pruebas unitarias dirígete a :doc:`/testing`.

source: Note that if you are testing for assertions or exceptions in your application code, you must set ``app.testing = True`` in order for the exceptions to propagate to the test client. Otherwise, the exception will be handled by the application (not visible to the test client) and the only indication of an AssertionError or other exception will be a 500 status code response to the test client. See the :attr:`testing` attribute. For example::
es: Tenga en cuenta que si está probando aserciones o excepciones en el código de su aplicación, debe establecer ``app.testing = True`` para que las excepciones se propaguen al cliente de prueba. De lo contrario, la excepción será manejada por la aplicación (no visible para el cliente de prueba) y la única indicación de un AssertionError u otra excepción será una respuesta de código de estado 500 para el cliente de prueba. Véase el atributo :attr:`testing`. Por ejemplo::

source: The test client can be used in a ``with`` block to defer the closing down of the context until the end of the ``with`` block. This is useful if you want to access the context locals for testing::
es: El cliente de prueba puede utilizarse en un bloque ``with`` para aplazar el cierre del contexto hasta el final del bloque ``with``. Esto es útil si quieres acceder a los locales del contexto para hacer pruebas::

source: Additionally, you may pass optional keyword arguments that will then be passed to the application's :attr:`test_client_class` constructor. For example::
es: Además, puede pasar argumentos opcionales de palabras clave que luego se pasarán al constructor de la aplicación :attr:`test_client_class`. Por ejemplo::

source: See :class:`~flask.testing.FlaskClient` for more information.
es: Ver :class:`~flask.testing.FlaskClient` para más información.

source: Added `**kwargs` to support passing additional keyword arguments to the constructor of :attr:`test_client_class`.
es: Se ha añadido `**kwargs` para poder pasar argumentos de palabras clave adicionales al constructor de :attr:`test_client_class`.

source: The `use_cookies` parameter was added as well as the ability to override the client to be used by setting the :attr:`test_client_class` attribute.
es: Se ha añadido el parámetro `use_cookies`, así como la posibilidad de anular el cliente que se utilizará estableciendo el atributo :attr:`test_client_class`.

source: added support for ``with`` block usage for the client.
es: se ha añadido soporte para el uso de bloques ``with`` para el cliente.

source: Create a CLI runner for testing CLI commands. See :ref:`testing-cli`.
es: Crea un runner CLI para probar los comandos CLI. Ver :ref:`testing-cli`.

source: Returns an instance of :attr:`test_cli_runner_class`, by default :class:`~flask.testing.FlaskCliRunner`. The Flask app object is passed as the first argument.
es: Devuelve una instancia de :attr:`test_cli_runner_class`, por defecto :class:`~flask.testing.FlaskCliRunner`. El objeto de la aplicación Flask se pasa como primer argumento.

source: Handles an HTTP exception. By default this will invoke the registered error handlers and fall back to returning the exception as response.
es: Maneja una excepción HTTP. Por defecto, esto invocará los manejadores de error registrados y volverá a devolver la excepción como respuesta.

source: ``RoutingException``, used internally for actions such as slash redirects during routing, is not passed to error handlers.
es: ``RoutingException``, que se utiliza internamente para acciones como redireccionamientos de barras durante el enrutamiento, no se pasa a los manejadores de errores.

source: Exceptions are looked up by code *and* by MRO, so ``HTTPException`` subclasses can be handled with a catch-all handler for the base ``HTTPException``.
es: Las excepciones son buscadas por el código *y* por MRO, por lo que las subclases de ``HTTPException`` pueden ser manejadas con un manejador catch-all para la ``HTTPException`` base.

source: This method is called whenever an exception occurs that should be handled. A special case is :class:`~werkzeug .exceptions.HTTPException` which is forwarded to the :meth:`handle_http_exception` method. This function will either return a response value or reraise the exception with the same traceback.
es: Este método es llamado cada vez que ocurre una excepción que debe ser manejada. Un caso especial es :class:`~werkzeug .exceptions.HTTPException` que se reenvía al método :meth:`handle_http_exception`. Esta función devolverá un valor de respuesta o volverá a lanzar la excepción con el mismo traceback.

source: Key errors raised from request data like ``form`` show the bad key in debug mode rather than a generic bad request message.
es: Los errores de clave que se producen a partir de datos de solicitud como ``form`` muestran la clave errónea en modo de depuración en lugar de un mensaje genérico de solicitud errónea.

source: Handle an exception that did not have an error handler associated with it, or that was raised from an error handler. This always causes a 500 ``InternalServerError``.
es: Maneja una excepción que no tiene un manejador de errores asociado, o que fue lanzada desde un manejador de errores. Esto siempre provoca un error 500 ``InternalServerError``.

source: Always sends the :data:`got_request_exception` signal.
es: Siempre envía la señal :data:`got_request_exception`.

source: If an error handler is registered for ``InternalServerError`` or ``500``, it will be used. For consistency, the handler will always receive the ``InternalServerError``. The original unhandled exception is available as ``e.original_exception``.
es: Si se registra un gestor de errores para ``InternalServerError`` o ``500``, se utilizará. Por consistencia, el manejador siempre recibirá el ``InternalServerError``. La excepción original no manejada está disponible como ``e.original_exception``.
