Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/api.po
Languages: es

source: This is a secure way to serve files from a folder, such as static files or uploads. Uses :func:`~werkzeug.security.safe_join` to ensure the path coming from the client is not maliciously crafted to point outside the specified directory.
es: Esta es una forma segura de servir archivos desde una carpeta, como archivos estáticos o cargas. Utiliza :func:`~werkzeug.security.safe_join` para asegurar que la ruta que viene del cliente no está maliciosamente diseñada para apuntar fuera del directorio especificado.

source: If the final path does not point to an existing regular file, raises a 404 :exc:`~werkzeug.exceptions.NotFound` error.
es: Si la ruta final no apunta a un archivo regular existente, genera un error 404 :exc:`~werkzeug.exceptions.NotFound`.

source: The path to the file to send, relative to ``directory``.
es: La ruta del archivo a enviar, relativa al ``directory``.

source: Arguments to pass to :func:`send_file`.
es: Argumentos para pasar a :func:`send_file`.

source: ``path`` replaces the ``filename`` parameter.
es: ``path`` sustituye al parámetro ``filename``.

source: Message Flashing
es: Mensaje intermitente

source: Flashes a message to the next request. In order to remove the flashed message from the session and to display it to the user, the template has to call :func:`get_flashed_messages`.
es: Destella un mensaje a la siguiente petición. Para eliminar el mensaje flasheado de la sesión y mostrarlo al usuario, la plantilla debe llamar a :func:`get_flashed_messages`.

source: `category` parameter added.
es: Se ha añadido el parámetro "category".

source: the message to be flashed.
es: el mensaje que se va a emitir.

source: the category for the message. The following values are recommended: ``'message'`` for any kind of message, ``'error'`` for errors, ``'info'`` for information messages and ``'warning'`` for warnings. However any kind of string can be used as category.
es: la categoría del mensaje. Se recomiendan los siguientes valores: ``'message'`` para cualquier tipo de mensaje, ``'error'`` para los errores, ``'info'`` para los mensajes de información y ``'warning'`` para las advertencias. Sin embargo, se puede utilizar cualquier tipo de cadena como categoría.

source: Pulls all flashed messages from the session and returns them. Further calls in the same request to the function will return the same messages. By default just the messages are returned, but when `with_categories` is set to ``True``, the return value will be a list of tuples in the form ``(category, message)`` instead.
es: Extrae todos los mensajes de la sesión y los devuelve. Las llamadas posteriores en la misma petición a la función devolverán los mismos mensajes. Por defecto sólo se devuelven los mensajes, pero cuando `with_categories` se establece como ``True``, el valor de retorno será una lista de tuplas de la forma ``(category, message)``.

source: Filter the flashed messages to one or more categories by providing those categories in `category_filter`. This allows rendering categories in separate html blocks. The `with_categories` and `category_filter` arguments are distinct:
es: Filtra los mensajes parpadeantes a una o más categorías proporcionando esas categorías en `category_filter`. Esto permite mostrar las categorías en bloques html separados. Los argumentos `with_categories` y `category_filter` son distintos:

source: `with_categories` controls whether categories are returned with message text (``True`` gives a tuple, where ``False`` gives just the message text).
es: `with_categories` controla si las categorías se devuelven con el texto del mensaje (``True`` da una tupla, mientras que ``False`` da sólo el texto del mensaje).

source: `category_filter` filters the messages down to only those matching the provided categories.
es: El filtro de categorías filtra los mensajes para que sólo coincidan con las categorías indicadas.

source: See :doc:`/patterns/flashing` for examples.
es: Consulte :doc:`/patterns/flashing` para ver ejemplos.

source: `category_filter` parameter added.
es: Se ha añadido el parámetro `category_filter`.

source: `with_categories` parameter added.
es: Se ha añadido el parámetro `with_categories`.

source: set to ``True`` to also receive categories.
es: se establece en ``True`` para recibir también las categorías.

source: filter of categories to limit return values. Only categories in the list will be returned.
es: filtro de categorías para limitar los valores devueltos. Sólo se devolverán las categorías de la lista.

source: JSON Support
es: Soporte JSON

source: :class:`decimal.Decimal` is supported by converting to a string.
es: :class:`decimal.Decimal` es compatible con la conversión a una cadena.

source: ``app`` can be passed directly, rather than requiring an app context for configuration.
es: ``app`` se puede pasar directamente, en lugar de requerir un contexto de aplicación para la configuración.

source: Tagged JSON
es: Etiquetado JSON

source: A compact representation for lossless serialization of non-standard JSON types. :class:`~flask.sessions.SecureCookieSessionInterface` uses this to serialize the session data, but it may be useful in other places. It can be extended to support other types.
es: Una representación compacta para la serialización sin pérdidas de tipos JSON no estándar. :class:`~flask.sessions.SecureCookieSessionInterface` utiliza esto para serializar los datos de sesión, pero puede ser útil en otros lugares. Puede ser extendido para soportar otros tipos.

source: Serializer that uses a tag system to compactly represent objects that are not JSON types. Passed as the intermediate serializer to :class:`itsdangerous.Serializer`.
es: Serializador que utiliza un sistema de etiquetas para representar de forma compacta objetos no JSON. Se pasa como un serializador intermedio a :class:`itsdangerous.Serializer`.

source: The following extra types are supported:
es: Se admiten los siguientes tipos adicionales:

source: Tag classes to bind when creating the serializer. Other tags can be added later using :meth:`~register`.
es: Clases de etiquetas a enlazar cuando se crea el serializador. Se pueden añadir otras etiquetas más tarde usando :meth:`~register`.

source: Register a new tag with this serializer.
es: Registra una nueva etiqueta con este serializador.

source: tag class to register. Will be instantiated with this serializer instance.
es: clase de etiqueta a registrar. Se instanciará con esta instancia del serializador.

source: overwrite an existing tag. If false (default), a :exc:`KeyError` is raised.
es: sobrescribir una etiqueta existente. Si es falso (por defecto), se produce un :exc:`KeyError`.

source: index to insert the new tag in the tag order. Useful when the new tag is a special case of an existing tag. If ``None`` (default), the tag is appended to the end of the order.
es: para insertar la nueva etiqueta en el orden de las etiquetas. Es útil cuando la nueva etiqueta es un caso especial de una etiqueta existente. Si es ``None`` (por defecto), la etiqueta se añade al final del orden.

source: if the tag key is already registered and ``force`` is not true.
es: si la clave de la etiqueta ya está registrada y ``force`` no es verdadero.

source: Convert a value to a tagged representation if necessary.
es: Convierte un valor en una representación etiquetada si es necesario.

source: Convert a tagged representation back to the original type.
es: Convierte una representación etiquetada en el tipo original.

source: Tag the value and dump it to a compact JSON string.
es: Etiqueta el valor y lo vuelca en una cadena JSON compacta.

source: Load data from a JSON string and deserialized any tagged objects.
es: Cargar datos de una cadena JSON y deserializar cualquier objeto etiquetado.

source: Base class for defining type tags for :class:`TaggedJSONSerializer`.
es: Clase base para definir etiquetas de tipo para :class:`TaggedJSONSerializer`.

source: Check if the given value should be tagged by this tag.
es: Comprueba si el valor dado debe ser etiquetado por esta etiqueta.

source: Convert the Python object to an object that is a valid JSON type. The tag will be added later.
es: Convierte el objeto Python en un objeto de tipo JSON válido. La etiqueta se añadirá más tarde.

source: Convert the JSON representation back to the correct type. The tag will already be removed.
es: Convierte la representación JSON al tipo correcto. La etiqueta ya estará eliminada.

source: Convert the value to a valid JSON type and add the tag structure around it.
es: Convierte el valor a un tipo JSON válido y añade la estructura de etiquetas a su alrededor.

source: Let's see an example that adds support for :class:`~collections.OrderedDict`. Dicts don't have an order in JSON, so to handle this we will dump the items as a list of ``[key, value]`` pairs. Subclass :class:`JSONTag` and give it the new key ``' od'`` to identify the type. The session serializer processes dicts first, so insert the new tag at the front of the order since ``OrderedDict`` must be processed before ``dict``.
es: Veamos un ejemplo que añade soporte para :class:`~collections.OrderedDict`. Los dicts no tienen un orden en JSON, así que para manejar esto volcaremos los elementos como una lista de pares ``[key, value]``. Subclase :class:`JSONTag` y dale la nueva clave ``' od'`` para identificar el tipo. El serializador de sesión procesa primero los dicts, así que inserta la nueva etiqueta al principio de la orden ya que ``OrderedDict`` debe ser procesado antes que ``dict``.

source: Template Rendering
es: Renderizado de plantillas

source: Render a template by name with the given context.
es: Renderiza una plantilla por nombre con el contexto dado.

source: The name of the template to render. If a list is given, the first name to exist will be rendered.
es: El nombre de la plantilla a renderizar. Si se da una lista, se renderizará el primer nombre que exista.

source: The variables to make available in the template.
es: Las variables que deben estar disponibles en la plantilla.

source: Render a template from the given source string with the given context.
es: Renderiza una plantilla a partir de la cadena fuente dada con el contexto dado.

source: The source code of the template to render.
es: El código fuente de la plantilla a renderizar.

source: Render a template by name with the given context as a stream. This returns an iterator of strings, which can be used as a streaming response from a view.
es: Renderiza una plantilla por nombre con el contexto dado como un flujo. Esto devuelve un iterador de cadenas, que puede ser utilizado como una respuesta de flujo de una vista.

source: Render a template from the given source string with the given context as a stream. This returns an iterator of strings, which can be used as a streaming response from a view.
es: Renderiza una plantilla a partir de la cadena de origen dada con el contexto dado como un flujo. Esto devuelve un iterador de cadenas, que puede ser utilizado como una respuesta de flujo desde una vista.

source: Loads a macro (or variable) a template exports. This can be used to invoke a macro from within Python code. If you for example have a template named :file:`_cider.html` with the following contents:
es: Carga una macro (o variable) que una plantilla exporta. Esto puede usarse para invocar una macro desde el código de Python. Si por ejemplo tienes una plantilla llamada :file:`_cider.html` con el siguiente contenido:

source: You can access this from Python code like this::
es: Puedes acceder a esto desde el código Python así::

source: the name of the template
es: el nombre de la plantilla

source: the name of the variable of macro to access
es: el nombre de la variable de la macro a la que hay que acceder

source: Configuration
es: Configuración

source: Works exactly like a dict but provides ways to fill it from files or special dictionaries. There are two common patterns to populate the config.
es: Funciona exactamente como un dict, pero proporciona formas de llenarlo desde archivos o diccionarios especiales. Hay dos patrones comunes para rellenar la configuración.

source: Either you can fill the config from a config file::
es: O bien puede llenar la configuración de un archivo de configuración::

source: Or alternatively you can define the configuration options in the module that calls :meth:`from_object` or provide an import path to a module that should be loaded. It is also possible to tell it to use the same module and with that provide the configuration values just before the call::
es: O, alternativamente, puede definir las opciones de configuración en el módulo que llama a :meth:`from_object` o proporcionar una ruta de importación a un módulo que debe ser cargado. También es posible decirle que utilice el mismo módulo y con ello proporcionar los valores de configuración justo antes de la llamada::

source: In both cases (loading from any Python file or loading from modules), only uppercase keys are added to the config. This makes it possible to use lowercase values in the config file for temporary values that are not added to the config or to define the config keys in the same file that implements the application.
es: En ambos casos (carga desde cualquier archivo de Python o carga desde módulos), sólo se añaden claves en mayúsculas al config. Esto permite utilizar valores en minúsculas en el archivo config para valores temporales que no se añaden al config o definir las claves config en el mismo archivo que implementa la aplicación.

source: Probably the most interesting way to load configurations is from an environment variable pointing to a file::
es: Probablemente la forma más interesante de cargar configuraciones es desde una variable de entorno que apunte a un archivo::

source: In this case before launching the application you have to set this environment variable to the file you want to use. On Linux and OS X use the export statement::
es: En este caso, antes de lanzar la aplicación tienes que establecer esta variable de entorno en el archivo que quieres utilizar. En Linux y OS X utilice la sentencia export::

source: On windows use `set` instead.
es: En Windows utilice `set` en su lugar.

source: path to which files are read relative from. When the config object is created by the application, this is the application's :attr:`~flask.Flask.root_path`.
es: ruta desde la que se leen los archivos de forma relativa. Cuando el objeto config es creado por la aplicación, este es el :attr:`~flask.Flask.root_path` de la aplicación.

source: an optional dictionary of default values
es: un diccionario opcional de valores por defecto

source: Loads a configuration from an environment variable pointing to a configuration file. This is basically just a shortcut with nicer error messages for this line of code::
es: Carga una configuración desde una variable de entorno que apunta a un archivo de configuración. Esto es básicamente un atajo con mensajes de error más agradables para esta línea de código::

source: name of the environment variable
es: nombre de la variable de entorno

source: set to ``True`` if you want silent failure for missing files.
es: se establece en ``True`` si se desea un fallo silencioso para los archivos que faltan.

source: ``True`` if the file was loaded successfully.
es: ``True`` si el archivo se ha cargado con éxito.

source: Load any environment variables that start with ``FLASK_``, dropping the prefix from the env key for the config key. Values are passed through a loading function to attempt to convert them to more specific types than strings.
es: Carga cualquier variable de entorno que empiece por ``FLASK_``, eliminando el prefijo de la clave env para la clave config. Los valores se pasan a través de una función de carga para intentar convertirlos en tipos más específicos que las cadenas.

source: Keys are loaded in :func:`sorted` order.
es: Las claves se cargan en orden :func:`sorted`.

source: The default loading function attempts to parse values as any valid JSON type, including dicts and lists.
es: La función de carga por defecto intenta analizar los valores como cualquier tipo JSON válido, incluyendo dicts y listas.

source: Specific items in nested dicts can be set by separating the keys with double underscores (``__``). If an intermediate key doesn't exist, it will be initialized to an empty dict.
es: Se pueden establecer elementos específicos en los dicts anidados separando las claves con doble guión bajo (``__``). Si una clave intermedia no existe, se inicializará con un dict vacío.

source: Load env vars that start with this prefix, separated with an underscore (``_``).
es: Cargar los env vars que comienzan con este prefijo, separados por un guión bajo (``_``).

source: Pass each string value to this function and use the returned value as the config value. If any error is raised it is ignored and the value remains a string. The default is :func:`json.loads`.
es: Pase cada valor de cadena a esta función y utilice el valor devuelto como valor de configuración. Si se produce algún error se ignora y el valor sigue siendo una cadena. El valor por defecto es :func:`json.loads`.

source: Updates the values in the config from a Python file. This function behaves as if the file was imported as module with the :meth:`from_object` function.
es: Actualiza los valores de la configuración desde un archivo de Python. Esta función se comporta como si el archivo fuera importado como módulo con la función :meth:`from_object`.

source: the filename of the config. This can either be an absolute filename or a filename relative to the root path.
es: el nombre de archivo de la configuración. Puede ser un nombre de archivo absoluto o un nombre de archivo relativo a la ruta raíz.

source: `silent` parameter.
es: parámetro `silent`.

source: Updates the values from the given object. An object can be of one of the following two types:
es: Actualiza los valores del objeto dado. Un objeto puede ser de uno de los dos tipos siguientes:

source: a string: in this case the object with that name will be imported
es: una cadena: En este caso se importará el objeto con ese nombre

source: an actual object reference: that object is used directly
es: una referencia a un objeto real: Ese objeto se utiliza directamente

source: Objects are usually either modules or classes. :meth:`from_object` loads only the uppercase attributes of the module/class. A ``dict`` object will not work with :meth:`from_object` because the keys of a ``dict`` are not attributes of the ``dict`` class.
es: Los objetos suelen ser módulos o clases. :meth:`from_object` carga sólo los atributos en mayúsculas del módulo/clase. Un objeto ``dict`` no funcionará con :meth:`from_object` porque las claves de un ``dict`` no son atributos de la clase ``dict``.

source: Example of module-based configuration::
es: Ejemplo de configuración por módulos::

source: Nothing is done to the object before loading. If the object is a class and has ``@property`` attributes, it needs to be instantiated before being passed to this method.
es: No se hace nada al objeto antes de cargarlo. Si el objeto es una clase y tiene atributos ``@property``, es necesario instanciarlo antes de pasarlo a este método.

source: You should not use this function to load the actual configuration but rather configuration defaults. The actual config should be loaded with :meth:`from_pyfile` and ideally from a location not within the package because the package might be installed system wide.
es: No debe utilizar esta función para cargar la configuración real, sino los valores predeterminados de la configuración. La configuración real debe ser cargada con :meth:`from_pyfile` e idealmente desde una ubicación que no esté dentro del paquete porque el paquete podría estar instalado en todo el sistema.

source: See :ref:`config-dev-prod` for an example of class-based configuration using :meth:`from_object`.
es: Ver :ref:`config-dev-prod` para un ejemplo de configuración basada en clases usando :meth:`from_object`.

source: an import name or object
es: un nombre u objeto de importación

source: Update the values in the config from a file that is loaded using the ``load`` parameter. The loaded data is passed to the :meth:`from_mapping` method.
es: Actualiza los valores de la configuración a partir de un archivo que se carga con el parámetro ``load``. Los datos cargados se pasan al método :meth:`from_mapping`.

source: The path to the data file. This can be an absolute path or relative to the config root path.
es: La ruta del archivo de datos. Puede ser una ruta absoluta o relativa a la ruta raíz de la configuración.

source: A callable that takes a file handle and returns a mapping of loaded data from the file.
es: Un llamado que toma un manejador de archivo y devuelve un mapeo de los datos cargados desde el archivo.

source: Ignore the file if it doesn't exist.
es: Ignora el archivo si no existe.

source: Returns a dictionary containing a subset of configuration options that match the specified namespace/prefix. Example usage::
es: Devuelve un diccionario que contiene un subconjunto de opciones de configuración que coinciden con el espacio de nombres/prefijo especificado. Ejemplo de uso::

source: The resulting dictionary `image_store_config` would look like::
es: El diccionario resultante `image_store_config` tendría el siguiente aspecto::

source: This is often useful when configuration options map directly to keyword arguments in functions or class constructors.
es: Esto suele ser útil cuando las opciones de configuración se asignan directamente a argumentos de palabras clave en funciones o constructores de clases.

source: a configuration namespace
es: un espacio de nombres de configuración

source: a flag indicating if the keys of the resulting dictionary should be lowercase
es: una bandera que indica si las claves del diccionario resultante deben estar en minúsculas

source: a flag indicating if the keys of the resulting dictionary should not include the namespace
es: una bandera que indica si las claves del diccionario resultante no deben incluir el espacio de nombres

source: Stream Helpers
es: Ayudas para streams

source: Request contexts disappear when the response is started on the server. This is done for efficiency reasons and to make it less likely to encounter memory leaks with badly written WSGI middlewares. The downside is that if you are using streamed responses, the generator cannot access request bound information any more.
es: Los contextos de petición desaparecen cuando la respuesta se inicia en el servidor. Esto se hace por razones de eficiencia y para que sea menos probable encontrar fugas de memoria con middlewares WSGI mal escritos. La desventaja es que si estás usando respuestas en flujo, el generador no puede acceder a la información de las peticiones.

source: This function however can help you keep the context around for longer::
es: Sin embargo, esta función puede ayudarte a mantener el contexto durante más tiempo::

source: Alternatively it can also be used around a specific generator::
es: También puede utilizarse en torno a un generador específico::

source: Useful Internals
es: Internos útiles

source: The request context contains per-request information. The Flask app creates and pushes it at the beginning of the request, then pops it at the end of the request. It will create the URL adapter and request object for the WSGI environment provided.
es: El contexto de solicitud contiene información por solicitud. La aplicación Flask lo crea y empuja al principio de la petición, y luego lo saca al final de la misma. Creará el adaptador de URL y el objeto de solicitud para el entorno WSGI proporcionado.
