Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/changes.po
Languages: es

source: Module support and internal request handling refactoring to better support pluggable applications.
es: Soporte de módulos y refactorización del manejo de solicitudes internas para soportar mejor las aplicaciones conectables.

source: Sessions can be set to be permanent now on a per-session basis.
es: Ahora se puede establecer que las sesiones sean permanentes en función de cada una de ellas.

source: Better error reporting on missing secret keys.
es: Mejora de los informes de error sobre la falta de claves secretas.

source: Added support for Google Appengine.
es: Añadido soporte para Google Appengine.

source: Version 0.1
es: Versión 0.1

source: Released 2010-04-16
es: Lanzamiento 2010-04-16

source: First public preview release.
es: Primer lanzamiento público.
