Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/changes.po
Languages: es

source: The ``flask run`` command will only defer errors on reload. Errors present during the initial call will cause the server to exit with the traceback immediately. :issue:`3431`
es: El comando ``flask run`` sólo aplazará los errores en la recarga. Los errores que se produzcan durante la llamada inicial harán que el servidor salga con el rastreo inmediatamente. :issue:`3431`

source: When using ad-hoc certificates, check for the cryptography library instead of PyOpenSSL. :pr:`3492`
es: Al utilizar certificados ad-hoc, compruebe la biblioteca de criptografía en lugar de PyOpenSSL. :pr:`3492`

source: When specifying a factory function with ``FLASK_APP``, keyword argument can be passed. :issue:`3553`
es: Al especificar una función de fábrica con ``FLASK_APP``, se puede pasar el argumento de la palabra clave. :issue:`3553`

source: When loading a ``.env`` or ``.flaskenv`` file, the current working directory is no longer changed to the location of the file. :pr:`3560`
es: Al cargar un archivo ``.env`` o ``.flaskenv``, el directorio de trabajo actual ya no se cambia a la ubicación del archivo. :pr:`3560`

source: When returning a ``(response, headers)`` tuple from a view, the headers replace rather than extend existing headers on the response. For example, this allows setting the ``Content-Type`` for ``jsonify()``. Use ``response.headers.extend()`` if extending is desired. :issue:`3628`
es: Cuando se devuelve una tupla ``(response, headers)`` desde una vista, las cabeceras reemplazan en lugar de extender las cabeceras existentes en la respuesta. Por ejemplo, esto permite establecer el ``Content-Type`` para ``jsonify()``. Utiliza ``response.headers.extend()`` si deseas extenderla. :issue:`3628`

source: The ``Scaffold`` class provides a common API for the ``Flask`` and ``Blueprint`` classes. ``Blueprint`` information is stored in attributes just like ``Flask``, rather than opaque lambda functions. This is intended to improve consistency and maintainability. :issue:`3215`
es: La clase ``Scaffold`` proporciona una API común para las clases ``Flask`` y ``Blueprint``. La información de ``Blueprint`` se almacena en atributos al igual que ``Flask``, en lugar de funciones lambda opacas. Esto pretende mejorar la consistencia y la capacidad de mantenimiento. :issue:`3215`

source: Include ``samesite`` and ``secure`` options when removing the session cookie. :pr:`3726`
es: Incluye las opciones ``samesite`` y ``secure`` al eliminar la cookie de sesión. :pr:`3726`

source: Support passing a ``pathlib.Path`` to ``static_folder``. :pr:`3579`
es: Soporta pasar un ``pathlib.Path`` a ``static_folder``. :pr:`3579`

source: ``send_file`` and ``send_from_directory`` are wrappers around the implementations in ``werkzeug.utils``. :pr:`3828`
es: ``send_file`` y ``send_from_directory`` son envolturas alrededor de las implementaciones en ``werkzeug.utils``. :pr:`3828`

source: Some ``send_file`` parameters have been renamed, the old names are deprecated. ``attachment_filename`` is renamed to ``download_name``. ``cache_timeout`` is renamed to ``max_age``. ``add_etags`` is renamed to ``etag``. :pr:`3828, 3883`
es: Algunos parámetros de ``send_file`` han sido renombrados, los antiguos nombres están obsoletos. El nombre de ``attachment_filename`` ha cambiado a ``download_name``. El nombre de ``cache_timeout`` ha cambiado a ``max_age``. ``add_etags`` pasa a llamarse ``etag``. :pr:`3828, 3883`

source: ``send_file`` passes ``download_name`` even if ``as_attachment=False`` by using ``Content-Disposition: inline``. :pr:`3828`
es: ``send_file`` pasa ``download_name`` incluso si ``as_attachment=False`` utilizando ``Content-Disposition: inline``. :pr:`3828`

source: ``send_file`` sets ``conditional=True`` and ``max_age=None`` by default. ``Cache-Control`` is set to ``no-cache`` if ``max_age`` is not set, otherwise ``public``. This tells browsers to validate conditional requests instead of using a timed cache. :pr:`3828`
es: ``send_file`` establece ``conditional=True`` y ``max_age=None`` por defecto. ``Cache-Control`` se establece como ``no-cache`` si ``max_age`` no se establece, en caso contrario ``public``. Esto indica a los navegadores que validen las peticiones condicionales en lugar de utilizar una caché temporizada. :pr:`3828`

source: ``helpers.safe_join`` is deprecated. Use ``werkzeug.utils.safe_join`` instead. :pr:`3828`
es: ``helpers.safe_join`` está obsoleto. Utiliza ``werkzeug.utils.safe_join`` en su lugar. :pr:`3828`

source: The request context does route matching before opening the session. This could allow a session interface to change behavior based on ``request.endpoint``. :issue:`3776`
es: El contexto de la solicitud hace la coincidencia de la ruta antes de abrir la sesión. Esto podría permitir que una interfaz de sesión cambie de comportamiento basándose en ``request.endpoint``. :issue:`3776`

source: Use Jinja's implementation of the ``|tojson`` filter. :issue:`3881`
es: Utiliza la implementación de Jinja del filtro ``|tojson``. :issue:`3881`

source: Add route decorators for common HTTP methods. For example, ``@app.post("/login")`` is a shortcut for ``@app.route("/login", methods=["POST"])``. :pr:`3907`
es: Añade decoradores de ruta para métodos HTTP comunes. Por ejemplo, ``@app.post("/login")`` es un atajo para ``@app.route("/login", methods=["POST"])``. :pr:`3907`

source: Support async views, error handlers, before and after request, and teardown functions. :pr:`3412`
es: Soporta vistas asíncronas, manejadores de error, antes y después de la solicitud, y funciones de desmontaje. :pr:`3412`

source: Support nesting blueprints. :issue:`593, 1548`, :pr:`3923`
es: Soporta el anidamiento de blueprints. :issue:`593, 1548`, :pr:`3923`

source: Set the default encoding to "UTF-8" when loading ``.env`` and ``.flaskenv`` files to allow to use non-ASCII characters. :issue:`3931`
es: Establece la codificación por defecto en "UTF-8" al cargar los archivos ``.env`` y ``.flaskenv`` para permitir el uso de caracteres no ASCII. :issue:`3931`

source: ``flask shell`` sets up tab and history completion like the default ``python`` shell if ``readline`` is installed. :issue:`3941`
es: ``flask shell`` configura el completamiento de pestañas e historial como el shell ``python`` por defecto si ``readline`` está instalado. :issue:`3941`

source: ``helpers.total_seconds()`` is deprecated. Use ``timedelta.total_seconds()`` instead. :pr:`3962`
es: ``helpers.total_seconds()`` está obsoleto. Utilice ``timedelta.total_seconds()`` en su lugar. :pr:`3962`

source: Add type hinting. :pr:`3973`.
es: Añade una pista de tipo :pr:`3973`.

source: Version 1.1.4
es: Versión 1.1.4

source: Released 2021-05-13
es: Publicado el 2021-05-13

source: Update ``static_folder`` to use ``_compat.fspath`` instead of ``os.fspath`` to continue supporting Python < 3.6 :issue:`4050`
es: Actualiza ``static_folder`` para utilizar ``_compat.fspath`` en lugar de ``os.fspath`` para seguir soportando Python < 3.6 :issue:`4050`

source: Version 1.1.3
es: Versión 1.1.3

source: Set maximum versions of Werkzeug, Jinja, Click, and ItsDangerous. :issue:`4043`
es: Establece las versiones máximas de Werkzeug, Jinja, Click y ItsDangerous. :issue:`4043`

source: Re-add support for passing a ``pathlib.Path`` for ``static_folder``. :pr:`3579`
es: Vuelve a añadir soporte para pasar un ``pathlib.Path`` para ``static_folder``. :pr:`3579`

source: Version 1.1.2
es: Versión 1.1.2

source: Released 2020-04-03
es: Lanzamiento 2020-04-03

source: Work around an issue when running the ``flask`` command with an external debugger on Windows. :issue:`3297`
es: Soluciona un problema al ejecutar el comando ``flask`` con un depurador externo en Windows. :issue:`3297`

source: The static route will not catch all URLs if the ``Flask`` ``static_folder`` argument ends with a slash. :issue:`3452`
es: La ruta estática no captará todas las URLs si el argumento ``Flask`` ``static_folder`` termina con una barra. :issue:`3452`

source: Version 1.1.1
es: Versión 1.1.1

source: Released 2019-07-08
es: Lanzamiento 2019-07-08

source: The ``flask.json_available`` flag was added back for compatibility with some extensions. It will raise a deprecation warning when used, and will be removed in version 2.0.0. :issue:`3288`
es: Se ha vuelto a añadir la bandera ``flask.json_available`` por compatibilidad con algunas extensiones. Se emitirá una advertencia de desaprobación cuando se utilice, y se eliminará en la versión 2.0.0. :issue:`3288`

source: Version 1.1.0
es: Versión 1.1.0

source: Released 2019-07-04
es: Lanzamiento 2019-07-04

source: Bump minimum Werkzeug version to >= 0.15.
es: Aumenta la versión mínima de la herramienta a >= 0.15.

source: Drop support for Python 3.4.
es: Deja de ser compatible con Python 3.4.

source: Error handlers for ``InternalServerError`` or ``500`` will always be passed an instance of ``InternalServerError``. If they are invoked due to an unhandled exception, that original exception is now available as ``e.original_exception`` rather than being passed directly to the handler. The same is true if the handler is for the base ``HTTPException``. This makes error handler behavior more consistent. :pr:`3266`
es: A los manejadores de errores para ``InternalServerError`` o ``500`` siempre se les pasará una instancia de ``InternalServerError``. Si son invocados debido a una excepción no manejada, esa excepción original está ahora disponible como ``e.original_exception`` en lugar de ser pasada directamente al manejador. Lo mismo ocurre si el manejador es para la base ``HTTPException``. Esto hace que el comportamiento del manejador de errores sea más consistente. :pr:`3266`

source: Using built-in RequestContext, unprintable Unicode characters in Host header will result in a HTTP 400 response and not HTTP 500 as previously. :pr:`2994`
es: Utilizando el RequestContext incorporado, los caracteres Unicode no imprimibles en la cabecera Host darán lugar a una respuesta HTTP 400 y no HTTP 500 como anteriormente. :pr:`2994`

source: Flask's ``JSONMixin`` for the request and response wrappers was moved into Werkzeug. Use Werkzeug's version with Flask-specific support. This bumps the Werkzeug dependency to >= 0.15. :issue:`3125`
es: El ``JSONMixin`` de Flask para las envolturas de solicitud y respuesta fue trasladado a Werkzeug. Utiliza la versión de Werkzeug con soporte específico para Flask. Esto eleva la dependencia de Werkzeug a >= 0.15. :issue:`3125`

source: The ``flask`` command entry point is simplified to take advantage of Werkzeug 0.15's better reloader support. This bumps the Werkzeug dependency to >= 0.15. :issue:`3022`
es: El entry point del comando ``flask`` se ha simplificado para aprovechar el mejor soporte del recargador de Werkzeug 0.15. Esto eleva la dependencia de Werkzeug a >= 0.15. :issue:`3022`

source: Support ``static_url_path`` that ends with a forward slash. :issue:`3134`
es: Soporta ``static_url_path`` que termina con una barra diagonal. :issue:`3134`

source: Support empty ``static_folder`` without requiring setting an empty ``static_url_path`` as well. :pr:`3124`
es: Soporta ``static_folder`` vacía sin necesidad de establecer también una ``static_url_path`` vacía. :pr:`3124`

source: The development server port can be set to 0, which tells the OS to pick an available port. :issue:`2926`
es: El puerto del servidor de desarrollo puede establecerse en 0, lo que indica al sistema operativo que elija un puerto disponible. :issue:`2926`

source: Signaling support has a stub for the ``connect_via`` method when the Blinker library is not installed. :pr:`3208`
es: El soporte de señalización tiene un stub para el método ``connect_via`` cuando la biblioteca Blinker no está instalada. :pr:`3208`

source: Add an ``--extra-files`` option to the ``flask run`` CLI command to specify extra files that will trigger the reloader on change. :issue:`2897`
es: Añade una opción ``--extra-files`` al comando CLI ``flask run`` para especificar archivos extra que activarán el recargador al cambiar. :issue:`2897`

source: Allow returning a dictionary from a view function. Similar to how returning a string will produce a ``text/html`` response, returning a dict will call ``jsonify`` to produce a ``application/json`` response. :pr:`3111`
es: Permite devolver un diccionario desde una función de vista. Al igual que devolver una cadena producirá una respuesta ``text/html``, devolver un dict llamará a ``jsonify`` para producir una respuesta ``application/json``. :pr:`3111`

source: Blueprints have a ``cli`` Click group like ``app.cli``. CLI commands registered with a blueprint will be available as a group under the ``flask`` command. :issue:`1357`.
es: Los blueprints tienen un grupo de clics ``cli`` como ``app.cli``. Los comandos CLI registrados con un blueprint estarán disponibles como grupo bajo el comando ``flask``. :issue:`1357`.

source: When using the test client as a context manager (``with client:``), all preserved request contexts are popped when the block exits, ensuring nested contexts are cleaned up correctly. :pr:`3157`
es: Cuando se utiliza el cliente de prueba como gestor de contextos (``with client:``), todos los contextos de solicitud conservados se eliminan al salir del bloque, asegurando que los contextos anidados se limpien correctamente. :pr:`3157`

source: Show a better error message when the view return type is not supported. :issue:`3214`
es: Muestra un mejor mensaje de error cuando el tipo de retorno de la vista no es compatible. :issue:`3214`

source: ``flask.testing.make_test_environ_builder()`` has been deprecated in favour of a new class ``flask.testing.EnvironBuilder``. :pr:`3232`
es: ``flask.testing.make_test_environ_builder()`` ha quedado obsoleta en favor de una nueva clase ``flask.testing.EnvironBuilder``. :pr:`3232`

source: The ``flask run`` command no longer fails if Python is not built with SSL support. Using the ``--cert`` option will show an appropriate error message. :issue:`3211`
es: El comando ``flask run`` ya no falla si Python no está construido con soporte SSL. El uso de la opción ``--cert`` mostrará un mensaje de error apropiado. :issue:`3211`

source: URL matching now occurs after the request context is pushed, rather than when it's created. This allows custom URL converters to access the app and request contexts, such as to query a database for an id. :issue:`3088`
es: La coincidencia de URLs se produce ahora después de que el contexto de solicitud sea empujado, en lugar de cuando se crea. Esto permite que los convertidores de URL personalizados accedan a la aplicación y a los contextos de solicitud, como por ejemplo para consultar una base de datos para un id. :issue:`3088`

source: Version 1.0.4
es: Versión 1.0.4

source: The key information for ``BadRequestKeyError`` is no longer cleared outside debug mode, so error handlers can still access it. This requires upgrading to Werkzeug 0.15.5. :issue:`3249`
es: La información de la clave para ``BadRequestKeyError`` ya no se borra fuera del modo de depuración, por lo que los gestores de errores pueden seguir accediendo a ella. Esto requiere la actualización a Werkzeug 0.15.5. :issue:`3249`

source: ``send_file`` url quotes the ":" and "/" characters for more compatible UTF-8 filename support in some browsers. :issue:`3074`
es: La url ``send_file`` entrecomilla los caracteres ":" y "/" para hacer más compatible el nombre de archivo UTF-8 en algunos navegadores. :issue:`3074`

source: Show message about dotenv on stderr instead of stdout. :issue:`3285`
es: Muestra mensaje sobre dotenv en stderr en lugar de stdout. :issue:`3285`

source: Version 1.0.3
es: Versión 1.0.3

source: Released 2019-05-17
es: Lanzamiento 2019-05-17

source: Allow custom CLIs using ``FlaskGroup`` to set the debug flag without it always being overwritten based on environment variables. :pr:`2765`
es: Permitir que las CLIs personalizadas que utilizan ``FlaskGroup`` establezcan la bandera de depuración sin que se sobrescriba siempre en función de las variables de entorno. :pr:`2765`

source: ``flask --version`` outputs Werkzeug's version and simplifies the Python version. :pr:`2825`
es: ``flask --version`` da como resultado la versión de Werkzeug y simplifica la versión de Python. :pr:`2825`

source: A catch-all error handler registered for ``HTTPException`` will not handle ``RoutingException``, which is used internally during routing. This fixes the unexpected behavior that had been introduced in 1.0. :pr:`2986`
es: Un manejador de errores registrado para ``HTTPException`` no manejará ``RoutingException``, que se utiliza internamente durante el enrutamiento. Esto corrige el comportamiento inesperado que se había introducido en la versión 1.0. :pr:`2986`

source: Passing the ``json`` argument to ``app.test_client`` does not push/pop an extra app context. :issue:`2900`
es: Pasa el argumento ``json`` a ``app.test_client`` no hace push/pop de un contexto de aplicación extra. :issue:`2900`

source: Version 1.0.2
es: Versión 1.0.2

source: Released 2018-05-02
es: Publicado el 2018-05-02

source: Fix more backwards compatibility issues with merging slashes between a blueprint prefix and route. :pr:`2748`
es: Corrige más problemas de retrocompatibilidad con la fusión de barras entre un prefijo de blueprint y una ruta. :pr:`2748`

source: Fix error with ``flask routes`` command when there are no routes. :issue:`2751`
es: Corrige el error del comando ``flask routes`` cuando no hay rutas. :issue:`2751`

source: Version 1.0.1
es: Versión 1.0.1

source: Released 2018-04-29
es: Publicado 2018-04-29

source: Fix registering partials (with no ``__name__``) as view functions. :pr:`2730`
es: Corrige el registro de parciales (sin ``__name__``) como funciones de vista. :pr:`2730`

source: Don't treat lists returned from view functions the same as tuples. Only tuples are interpreted as response data. :issue:`2736`
es: No se tratan las listas devueltas por las funciones de vista igual que las tuplas. Sólo las tuplas se interpretan como datos de respuesta. :issue:`2736`

source: Extra slashes between a blueprint's ``url_prefix`` and a route URL are merged. This fixes some backwards compatibility issues with the change in 1.0. :issue:`2731`, :issue:`2742`
es: Se han fusionado las barras inclinadas adicionales entre el ``url_prefix`` de un blueprint y la URL de una ruta. Esto corrige algunos problemas de compatibilidad con el cambio en 1.0. :issue:`2731`, :issue:`2742`

source: Only trap ``BadRequestKeyError`` errors in debug mode, not all ``BadRequest`` errors. This allows ``abort(400)`` to continue working as expected. :issue:`2735`
es: Sólo se atrapan los errores ``BadRequestKeyError`` en modo de depuración, no todos los errores ``BadRequest``. Esto permite que ``abort(400)`` siga funcionando como se espera. :issue:`2735`

source: The ``FLASK_SKIP_DOTENV`` environment variable can be set to ``1`` to skip automatically loading dotenv files. :issue:`2722`
es: La variable de entorno ``FLASK_SKIP_DOTENV`` puede establecerse en ``1`` para omitir la carga automática de archivos dotenv. :issue:`2722`

source: Version 1.0
es: Versión 1.0

source: Released 2018-04-26
es: Publicado 2018-04-26

source: Python 2.6 and 3.3 are no longer supported.
es: Python 2.6 y 3.3 ya no son compatibles.

source: Bump minimum dependency versions to the latest stable versions: Werkzeug >= 0.14, Jinja >= 2.10, itsdangerous >= 0.24, Click >= 5.1. :issue:`2586`
es: Aumenta las versiones mínimas de las dependencias a las últimas versiones estables: Werkzeug >= 0.14, Jinja >= 2.10, itsdangerous >= 0.24, Click >= 5.1. :issue:`2586`

source: Errors caused while opening the session at the beginning of the request are handled by the app's error handlers. :pr:`2254`
es: Los errores causados al abrir la sesión al inicio de la solicitud son manejados por los manejadores de errores de la aplicación. :pr:`2254`

source: Add ``routes`` CLI command to output routes registered on the application. :pr:`2259`
es: Añade el comando CLI ``routes`` para dar salida a las rutas registradas en la aplicación. :pr:`2259`

source: Show warning when session cookie domain is a bare hostname or an IP address, as these may not behave properly in some browsers, such as Chrome. :pr:`2282`
es: Mostrar una advertencia cuando el dominio de la cookie de sesión es un nombre de host desnudo o una dirección IP, ya que estos pueden no comportarse correctamente en algunos navegadores, como Chrome. :pr:`2282`

source: Allow IP address as exact session cookie domain. :pr:`2282`
es: Permitir la dirección IP como dominio exacto de la cookie de sesión. :pr:`2282`

source: ``SESSION_COOKIE_DOMAIN`` is set if it is detected through ``SERVER_NAME``. :pr:`2282`
es: ``SESSION_COOKIE_DOMAIN`` se establece si se detecta a través de ``SERVER_NAME``. :pr:`2282`

source: Auto-detect zero-argument app factory called ``create_app`` or ``make_app`` from ``FLASK_APP``. :pr:`2297`
es: Detecta automáticamente la fábrica de aplicaciones sin argumentos llamada ``create_app`` o ``make_app`` de ``FLASK_APP``. :pr:`2297`

source: ``FLASK_APP`` can be set to an app factory, with arguments if needed, for example ``FLASK_APP=myproject.app:create_app('dev')``. :pr:`2326`
es: ``FLASK_APP`` puede establecerse en una fábrica de aplicaciones, con argumentos si es necesario, por ejemplo ``FLASK_APP=myproject.app:create_app('dev')``. :pr:`2326`

source: ``FLASK_APP`` can point to local packages that are not installed in editable mode, although ``pip install -e`` is still preferred. :pr:`2414`
es: ``FLASK_APP`` puede apuntar a paquetes locales que no están instalados en modo editable, aunque sigue siendo preferible ``pip install -e``. :pr:`2414`

source: Error handling will try handlers registered for ``blueprint, code``, ``app, code``, ``blueprint, exception``, ``app, exception``. :pr:`2314`
es: El manejo de errores probará los manejadores registrados para ``blueprint, code``, ``app, code``, ``blueprint, exception``, ``app, exception``. :pr:`2314`

source: ``Cookie`` is added to the response's ``Vary`` header if the session is accessed at all during the request (and not deleted). :pr:`2288`
es: Se añade ``Cookie`` a la cabecera ``Vary`` de la respuesta si se accede a la sesión durante la solicitud (y no se borra). :pr:`2288`

source: Add ``json`` keyword argument for the test client request methods. This will dump the given object as JSON and set the appropriate content type. :pr:`2358`
es: Añade el argumento de la palabra clave ``json`` para los métodos de solicitud del cliente de prueba. Esto volcará el objeto dado como JSON y establecerá el tipo de contenido apropiado. :pr:`2358`

source: Removed error handler caching because it caused unexpected results for some exception inheritance hierarchies. Register handlers explicitly for each exception if you want to avoid traversing the MRO. :pr:`2362`
es: Eliminado el almacenamiento en caché de los manejadores de error porque provocaba resultados inesperados en algunas jerarquías de herencia de excepciones. Registre los manejadores explícitamente para cada excepción si quiere evitar atravesar el MRO. :pr:`2362`

source: Fix incorrect JSON encoding of aware, non-UTC datetimes. :pr:`2374`
es: Corrige la codificación JSON incorrecta de las fechas conscientes, no UTC. :pr:`2374`

source: The following old deprecated code was removed. :issue:`2385`
es: Eliminado el siguiente código obsoleto. :issue:`2385`

source: ``flask.ext`` - import extensions directly by their name instead of through the ``flask.ext`` namespace. For example, ``import flask.ext.sqlalchemy`` becomes ``import flask_sqlalchemy``.
es: ``flask.ext`` - importar extensiones directamente por su nombre en lugar de a través del espacio de nombres ``flask.ext``. Por ejemplo, ``import flask.ext.sqlalchemy`` se convierte en ``import flask_sqlalchemy``.
