Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/changes.po
Languages: es

source: Blueprint view function names may not contain dots. :pr:`2450`
es: Los nombres de las funciones de la vista Blueprint no pueden contener puntos. :pr:`2450`

source: Fix a ``ValueError`` caused by invalid ``Range`` requests in some cases. :issue:`2526`
es: Corregido un ``ValueError`` causado por peticiones de ``Range`` no válidas en algunos casos. :issue:`2526`

source: The development server uses threads by default. :pr:`2529`
es: El servidor de desarrollo utiliza hilos por defecto. :pr:`2529`

source: Pass ``--cert`` and ``--key`` options to ``flask run`` to run the development server over HTTPS. :pr:`2606`
es: Pasa las opciones ``--cert`` y ``--key`` a ``flask run`` para ejecutar el servidor de desarrollo sobre HTTPS. :pr:`2606`

source: A single trailing slash is stripped from the blueprint ``url_prefix`` when it is registered with the app. :pr:`2629`
es: Se elimina una sola barra al final del plano ``url_prefix`` cuando se registra en la aplicación. :pr:`2629`

source: Updated documentation theme to make docs look better in small windows. :pr:`2709`
es: Actualizado el tema de la documentación para que los documentos se vean mejor en ventanas pequeñas. :pr:`2709`

source: Rewrote the tutorial docs and example project to take a more structured approach to help new users avoid common pitfalls. :pr:`2676`
es: Ha sido reescrita la documentación del tutorial y el proyecto de ejemplo para adoptar un enfoque más estructurado que ayude a los nuevos usuarios a evitar los errores más comunes. :pr:`2676`

source: Version 0.12.5
es: Versión 0.12.5

source: Released 2020-02-10
es: Lanzamiento 2020-02-10

source: Pin Werkzeug to < 1.0.0. :issue:`3497`
es: Fijado Werkzeug a < 1.0.0. :issue:`3497`

source: Version 0.12.4
es: Versión 0.12.4

source: Repackage 0.12.3 to fix package layout issue. :issue:`2728`
es: Reempaquetado de la versión 0.12.3 para solucionar un problema de diseño del paquete. :issue:`2728`

source: Version 0.12.3
es: Versión 0.12.3

source: Fix a Python warning about imports when using ``python -m flask``. :issue:`2666`
es: Corrige una advertencia de Python sobre las importaciones cuando se utiliza ``python -m flask``. :issue:`2666`

source: Fix a ``ValueError`` caused by invalid ``Range`` requests in some cases.
es: Corrige un ``ValueError`` causado por peticiones de ``Range`` no válidas en algunos casos.

source: Version 0.12.2
es: Versión 0.12.2

source: Released 2017-05-16
es: Lanzamiento 2017-05-16

source: Fix a bug in ``safe_join`` on Windows.
es: Corrige un error en ``safe_join`` en Windows.

source: Version 0.12.1
es: Versión 0.12.1

source: Released 2017-03-31
es: Lanzamiento 2017-03-31

source: Prevent ``flask run`` from showing a ``NoAppException`` when an ``ImportError`` occurs within the imported application module.
es: Evita que ``flask run`` muestre una ``NoAppException`` cuando se produce un ``ImportError`` dentro del módulo de aplicación importado.

source: Fix encoding behavior of ``app.config.from_pyfile`` for Python 3. :issue:`2118`
es: Corrige el comportamiento de codificación de ``app.config.from_pyfile`` para Python 3. :issue:`2118`

source: Use the ``SERVER_NAME`` config if it is present as default values for ``app.run``. :issue:`2109`, :pr:`2152`
es: Utiliza la configuración ``SERVER_NAME`` si está presente como valor por defecto para ``app.run``. :issue:`2109`, :pr:`2152`

source: Call ``ctx.auto_pop`` with the exception object instead of ``None``, in the event that a ``BaseException`` such as ``KeyboardInterrupt`` is raised in a request handler.
es: Llama a ``ctx.auto_pop`` con el objeto de excepción en lugar de ``None``, en el caso de que una ``BaseException`` como ``KeyboardInterrupt`` sea lanzada en un manejador de peticiones.

source: Version 0.12
es: Versión 0.12

source: Released 2016-12-21, codename Punsch
es: Lanzamiento 2016-12-21, codename Punsch

source: The cli command now responds to ``--version``.
es: El comando cli ahora responde a ``--versión``.

source: Mimetype guessing and ETag generation for file-like objects in ``send_file`` has been removed. :issue:`104`, :pr`1849`
es: Se ha eliminado la adivinación del tipo de letra y la generación de ETag para los objetos tipo archivo en ``send_file``. :issue:`104`, :pr`1849`

source: Mimetype guessing in ``send_file`` now fails loudly and doesn't fall back to ``application/octet-stream``. :pr:`1988`
es: La conjetura sobre el tipo de archivo en ``send_file`` ahora falla de forma estrepitosa y no vuelve a pasar a ``application/octet-stream``. :pr:`1988`

source: Make ``flask.safe_join`` able to join multiple paths like ``os.path.join`` :pr:`1730`
es: Hace que ``flask.safe_join`` pueda unir múltiples rutas como ``os.path.join`` :pr:`1730`

source: Revert a behavior change that made the dev server crash instead of returning an Internal Server Error. :pr:`2006`
es: Revertir un cambio de comportamiento que hacía que el servidor de desarrollo se bloqueara en lugar de devolver un Error Interno del Servidor. :pr:`2006`

source: Correctly invoke response handlers for both regular request dispatching as well as error handlers.
es: Invocar correctamente los manejadores de respuesta tanto para el despacho de solicitudes regulares como para los manejadores de errores.

source: Disable logger propagation by default for the app logger.
es: Desactiva la propagación del logger por defecto para el logger de la app.

source: Add support for range requests in ``send_file``.
es: Añade soporte para peticiones de rango en ``send_file``.

source: ``app.test_client`` includes preset default environment, which can now be directly set, instead of per ``client.get``.
es: ``app.test_client`` incluye un entorno predeterminado, que ahora se puede establecer directamente, en lugar de por ``client.get``.

source: Fix crash when running under PyPy3. :pr:`1814`
es: Corrige el fallo cuando se ejecuta bajo PyPy3. :pr:`1814`

source: Version 0.11.1
es: Versión 0.11.1

source: Released 2016-06-07
es: Lanzamiento 2016-06-07

source: Fixed a bug that prevented ``FLASK_APP=foobar/__init__.py`` from working. :pr:`1872`
es: Se ha corregido un error que impedía el funcionamiento de ``FLASK_APP=foobar/__init__.py``. :pr:`1872`

source: Version 0.11
es: Versión 0.11

source: Released 2016-05-29, codename Absinthe
es: Lanzamiento 2016-05-29, codename Absinthe

source: Added before_render_template signal.
es: Añadida la señal before_render_template.

source: Added ``SESSION_REFRESH_EACH_REQUEST`` config key that controls the set-cookie behavior. If set to ``True`` a permanent session will be refreshed each request and get their lifetime extended, if set to ``False`` it will only be modified if the session actually modifies. Non permanent sessions are not affected by this and will always expire if the browser window closes.
es: Se ha añadido la clave de configuración ``SESSION_REFRESH_EACH_REQUEST`` que controla el comportamiento de las cookies. Si se establece en ``True`` una sesión permanente se refrescará cada vez que se solicite y se extenderá su vida útil, si se establece en ``False`` sólo se modificará si la sesión se modifica realmente. Las sesiones no permanentes no se ven afectadas por esto y siempre expirarán si la ventana del navegador se cierra.

source: Made Flask support custom JSON mimetypes for incoming data.
es: Flask soportará mimetypes JSON personalizados para los datos entrantes.

source: Added support for returning tuples in the form ``(response, headers)`` from a view function.
es: Se ha añadido soporte para devolver tuplas de la forma ``(response, headers)`` desde una función de vista.

source: Templates are no longer automatically reloaded outside of debug mode. This can be configured with the new ``TEMPLATES_AUTO_RELOAD`` config key.
es: Las plantillas ya no se recargan automáticamente fuera del modo de depuración. Esto se puede configurar con la nueva clave de configuración ``TEMPLATES_AUTO_RELOAD``.

source: Added a workaround for a limitation in Python 3.3's namespace loader.
es: Se ha añadido una solución a una limitación del cargador de espacios de nombres de Python 3.3.

source: Added support for explicit root paths when using Python 3.3's namespace packages.
es: Se ha añadido soporte para rutas raíz explícitas cuando se utilizan los paquetes de espacio de nombres de Python 3.3.

source: Error handlers that match specific classes are now checked first, thereby allowing catching exceptions that are subclasses of HTTP exceptions (in ``werkzeug.exceptions``). This makes it possible for an extension author to create exceptions that will by default result in the HTTP error of their choosing, but may be caught with a custom error handler if desired.
es: Los manejadores de error que coinciden con clases específicas ahora se comprueban primero, permitiendo así atrapar excepciones que son subclases de excepciones HTTP (en ``werkzeug.exceptions``). Esto hace posible que el autor de una extensión cree excepciones que, por defecto, darán lugar al error HTTP que elija, pero que pueden ser capturadas con un manejador de errores personalizado si así lo desea.

source: Flask will now log by default even if debug is disabled. The log format is now hardcoded but the default log handling can be disabled through the ``LOGGER_HANDLER_POLICY`` configuration key.
es: Flask ahora registrará por defecto incluso si la depuración está desactivada. El formato de registro está ahora codificado, pero el manejo del registro por defecto puede ser desactivado a través de la clave de configuración ``LOGGER_HANDLER_POLICY``.

source: Removed deprecated module functionality.
es: Se ha eliminado la funcionalidad del módulo obsoleto.

source: Added the ``EXPLAIN_TEMPLATE_LOADING`` config flag which when enabled will instruct Flask to explain how it locates templates. This should help users debug when the wrong templates are loaded.
es: Se ha añadido la bandera de configuración ``EXPLAIN_TEMPLATE_LOADING`` que, cuando se activa, indica a Flask que explique cómo localiza las plantillas. Esto debería ayudar a los usuarios a depurar cuando se cargan las plantillas equivocadas.

source: Enforce blueprint handling in the order they were registered for template loading.
es: Aplicar el manejo de los planos en el orden en que fueron registrados para la carga de la plantilla.

source: Ported test suite to py.test.
es: Porteada la suite de tests a py.test.

source: Deprecated ``request.json`` in favour of ``request.get_json()``.
es: Se ha eliminado ``request.json`` en favor de ``request.get_json()``.

source: Add "pretty" and "compressed" separators definitions in jsonify() method. Reduces JSON response size when ``JSONIFY_PRETTYPRINT_REGULAR=False`` by removing unnecessary white space included by default after separators.
es: Añade definiciones de separadores "bonitos" y "comprimidos" en el método jsonify(). Reduce el tamaño de la respuesta JSON cuando ``JSONIFY_PRETTYPRINT_REGULAR=False`` eliminando los espacios en blanco innecesarios incluidos por defecto después de los separadores.

source: The automatically provided ``OPTIONS`` method is now correctly disabled if the user registered an overriding rule with the lowercase-version ``options``. :issue:`1288`
es: El método ``OPTIONS`` proporcionado automáticamente está ahora correctamente desactivado si el usuario registró una regla de anulación con la versión minúscula ``options``. :issue:`1288`

source: ``flask.json.jsonify`` now supports the ``datetime.date`` type. :pr:`1326`
es: ``flask.json.jsonify`` ahora soporta el tipo ``datetime.date``. :pr:`1326`

source: Don't leak exception info of already caught exceptions to context teardown handlers. :pr:`1393`
es: No se filtra la información de las excepciones ya capturadas a los manejadores de desmontaje de contexto. :pr:`1393`

source: Allow custom Jinja environment subclasses. :pr:`1422`
es: Permitir subclases de entorno Jinja personalizadas. :pr:`1422`

source: Updated extension dev guidelines.
es: Actualización de las directrices de desarrollo de la extensión.

source: ``flask.g`` now has ``pop()`` and ``setdefault`` methods.
es: ``flask.g`` tiene ahora los métodos ``pop()`` y ``setdefault``.

source: Turn on autoescape for ``flask.templating.render_template_string`` by default. :pr:`1515`
es: Activa el autoescape para ``flask.templating.render_template_string`` por defecto. :pr:`1515`

source: ``flask.ext`` is now deprecated. :pr:`1484`
es: ``flask.ext`` está ahora obsoleto. :pr:`1484`

source: ``send_from_directory`` now raises BadRequest if the filename is invalid on the server OS. :pr:`1763`
es: ``send_from_directory`` ahora lanza BadRequest si el nombre del archivo no es válido en el SO del servidor. :pr:`1763`

source: Added the ``JSONIFY_MIMETYPE`` configuration variable. :pr:`1728`
es: Añadida la variable de configuración ``JSONIFY_MIMETYPE``. :pr:`1728`

source: Exceptions during teardown handling will no longer leave bad application contexts lingering around.
es: Las excepciones durante el manejo del desmontaje ya no dejarán que los contextos de aplicación malos se queden por ahí.

source: Fixed broken ``test_appcontext_signals()`` test case.
es: Corregido el caso de prueba roto ``test_appcontext_signals()``.

source: Fixed an issue causing exceptions raised before entering a request or app context to be passed to teardown handlers.
es: Se ha corregido un problema que provocaba que las excepciones que se producían antes de entrar en un contexto de solicitud o de aplicación se pasaran a los gestores de desmontaje.

source: Fixed an issue with query parameters getting removed from requests in the test client when absolute URLs were requested.
es: Se ha corregido un problema por el que los parámetros de consulta se eliminaban de las solicitudes en el cliente de prueba cuando se solicitaban URLs absolutas.

source: Made ``@before_first_request`` into a decorator as intended.
es: Convirtió a ``@before_first_request`` en un decorador como se pretendía.

source: Fixed an etags bug when sending a file streams with a name.
es: Se ha corregido un error de etiquetado al enviar un flujo de archivos con un nombre.

source: Fixed ``send_from_directory`` not expanding to the application root path correctly.
es: Se ha corregido que ``send_from_directory`` no se expande a la ruta raíz de la aplicación correctamente.

source: Changed logic of before first request handlers to flip the flag after invoking. This will allow some uses that are potentially dangerous but should probably be permitted.
es: Se ha cambiado la lógica de los manejadores de la primera solicitud para que se voltee la bandera después de la invocación. Esto permitirá algunos usos que son potencialmente peligrosos pero que probablemente deberían permitirse.

source: Fixed Python 3 bug when a handler from ``app.url_build_error_handlers`` reraises the ``BuildError``.
es: Se ha corregido el error de Python 3 cuando un manejador de ``app.url_build_error_handlers`` devuelve el ``BuildError``.

source: Version 0.10.1
es: Versión 0.10.1

source: Released 2013-06-14
es: Lanzamiento 2013-06-14

source: Fixed an issue where ``|tojson`` was not quoting single quotes which made the filter not work properly in HTML attributes. Now it's possible to use that filter in single quoted attributes. This should make using that filter with angular.js easier.
es: Se ha corregido un problema por el que ``|tojson`` no se citaba entre comillas simples, lo que hacía que el filtro no funcionara correctamente en los atributos HTML. Ahora es posible usar ese filtro en atributos con comillas simples. Esto debería facilitar el uso de ese filtro con angular.js.

source: Added support for byte strings back to the session system. This broke compatibility with the common case of people putting binary data for token verification into the session.
es: Se ha añadido soporte para cadenas de bytes al sistema de sesiones. Esto rompió la compatibilidad con el caso común de personas que ponen datos binarios para la verificación de tokens en la sesión.

source: Fixed an issue where registering the same method twice for the same endpoint would trigger an exception incorrectly.
es: Se ha solucionado un problema por el que el registro del mismo método dos veces para el mismo punto final provocaba una excepción de forma incorrecta.

source: Version 0.10
es: Versión 0.10

source: Released 2013-06-13, codename Limoncello
es: Lanzamiento 2013-06-13, codename Limoncello

source: Changed default cookie serialization format from pickle to JSON to limit the impact an attacker can do if the secret key leaks.
es: Se ha cambiado el formato de serialización de cookies por defecto de pickle a JSON para limitar el impacto que un atacante puede hacer si se filtra la clave secreta.

source: Added ``template_test`` methods in addition to the already existing ``template_filter`` method family.
es: Se han añadido métodos ``template_test`` además de la familia de métodos ``template_filter`` ya existente.

source: Added ``template_global`` methods in addition to the already existing ``template_filter`` method family.
es: Se han añadido métodos ``template_global`` además de la familia de métodos ``template_filter`` ya existente.

source: Set the content-length header for x-sendfile.
es: Establece la cabecera content-length para x-sendfile.

source: ``tojson`` filter now does not escape script blocks in HTML5 parsers.
es: El filtro ``tojson`` ahora no escapa a los bloques de script en los analizadores de HTML5.

source: ``tojson`` used in templates is now safe by default. This was allowed due to the different escaping behavior.
es: ``tojson`` utilizado en las plantillas es ahora seguro por defecto. Esto se permitía debido al diferente comportamiento de escape.

source: Flask will now raise an error if you attempt to register a new function on an already used endpoint.
es: Flask ahora lanzará un error si se intenta registrar una nueva función en un punto final ya utilizado.

source: Added wrapper module around simplejson and added default serialization of datetime objects. This allows much easier customization of how JSON is handled by Flask or any Flask extension.
es: Se ha añadido un módulo de envoltura alrededor de simplejson y se ha añadido la serialización por defecto de los objetos datetime. Esto permite una personalización mucho más fácil de cómo JSON es manejado por Flask o cualquier extensión de Flask.

source: Removed deprecated internal ``flask.session`` module alias. Use ``flask.sessions`` instead to get the session module. This is not to be confused with ``flask.session`` the session proxy.
es: Se ha eliminado el alias del módulo interno ``flask.session``. Utiliza ``flask.sessions`` en su lugar para obtener el módulo de sesión. Esto no debe confundirse con ``flask.session`` el proxy de sesión.

source: Templates can now be rendered without request context. The behavior is slightly different as the ``request``, ``session`` and ``g`` objects will not be available and blueprint's context processors are not called.
es: Las plantillas ahora pueden ser renderizadas sin contexto de petición. El comportamiento es ligeramente diferente ya que los objetos ``request``, ``session`` y ``g`` no estarán disponibles y los procesadores de contexto del blueprint no son llamados.

source: The config object is now available to the template as a real global and not through a context processor which makes it available even in imported templates by default.
es: El objeto config está ahora disponible para la plantilla como un global real y no a través de un procesador de contexto que lo hace disponible incluso en las plantillas importadas por defecto.

source: Added an option to generate non-ascii encoded JSON which should result in less bytes being transmitted over the network. It's disabled by default to not cause confusion with existing libraries that might expect ``flask.json.dumps`` to return bytes by default.
es: Se ha añadido una opción para generar JSON no codificado en ascii, lo que debería dar lugar a que se transmitan menos bytes por la red. Está desactivada por defecto para no causar confusión con las bibliotecas existentes que podrían esperar que ``flask.json.dumps`` devolviera bytes por defecto.

source: ``flask.g`` is now stored on the app context instead of the request context.
es: ``flask.g`` se almacena ahora en el contexto de la aplicación en lugar del contexto de la solicitud.

source: ``flask.g`` now gained a ``get()`` method for not erroring out on non existing items.
es: ``flask.g`` ahora tiene un método ``get()`` para que no se produzcan errores en elementos no existentes.

source: ``flask.g`` now can be used with the ``in`` operator to see what's defined and it now is iterable and will yield all attributes stored.
es: ``flask.g`` ahora se puede utilizar con el operador ``in`` para ver lo que está definido y ahora es iterable y dará todos los atributos almacenados.

source: ``flask.Flask.request_globals_class`` got renamed to ``flask.Flask.app_ctx_globals_class`` which is a better name to what it does since 0.10.
es: ``flask.Flask.request_globals_class`` fue renombrado a ``flask.Flask.app_ctx_globals_class`` que es un nombre mejor para lo que hace desde 0.10.

source: ``request``, ``session`` and ``g`` are now also added as proxies to the template context which makes them available in imported templates. One has to be very careful with those though because usage outside of macros might cause caching.
es: ``request``, ``session`` y ``g`` ahora también se añaden como proxies al contexto de la plantilla, lo que hace que estén disponibles en las plantillas importadas. Sin embargo, hay que tener mucho cuidado con ellos, ya que su uso fuera de las macros puede provocar el almacenamiento en caché.

source: Flask will no longer invoke the wrong error handlers if a proxy exception is passed through.
es: Flask ya no invocará los manejadores de error equivocados si se pasa una excepción de proxy.

source: Added a workaround for chrome's cookies in localhost not working as intended with domain names.
es: Se ha añadido una solución para que las cookies de Chrome en localhost no funcionen como es debido con los nombres de dominio.

source: Changed logic for picking defaults for cookie values from sessions to work better with Google Chrome.
es: Se ha cambiado la lógica para elegir los valores predeterminados de las cookies de las sesiones para que funcionen mejor con Google Chrome.

source: Added ``message_flashed`` signal that simplifies flashing testing.
es: Se ha añadido la señal ``message_flashed`` que simplifica las pruebas de flasheo.

source: Added support for copying of request contexts for better working with greenlets.
es: Se ha añadido soporte para la copia de contextos de solicitud para trabajar mejor con los greenlets.

source: Removed custom JSON HTTP exception subclasses. If you were relying on them you can reintroduce them again yourself trivially. Using them however is strongly discouraged as the interface was flawed.
es: Eliminadas las subclases de excepción JSON HTTP personalizadas. Si dependías de ellas, puedes reintroducirlas tú mismo de forma trivial. Sin embargo, se desaconseja encarecidamente su uso, ya que la interfaz era defectuosa.

source: Python requirements changed: requiring Python 2.6 or 2.7 now to prepare for Python 3.3 port.
es: Los requisitos de Python han cambiado: ahora se requiere Python 2.6 o 2.7 para preparar el puerto de Python 3.3.

source: Changed how the teardown system is informed about exceptions. This is now more reliable in case something handles an exception halfway through the error handling process.
es: Se ha cambiado la forma en que se informa al sistema de desmontaje sobre las excepciones. Esto es ahora más fiable en caso de que algo maneje una excepción a mitad del proceso de manejo de errores.
