Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/changes.po
Languages: es

source: Request context preservation in debug mode now keeps the exception information around which means that teardown handlers are able to distinguish error from success cases.
es: La preservación del contexto de la solicitud en el modo de depuración ahora mantiene la información de la excepción, lo que significa que los manipuladores de desmontaje son capaces de distinguir los casos de error de los de éxito.

source: Added the ``JSONIFY_PRETTYPRINT_REGULAR`` configuration variable.
es: Añadida la variable de configuración ``JSONIFY_PRETTYPRINT_REGULAR``.

source: Flask now orders JSON keys by default to not trash HTTP caches due to different hash seeds between different workers.
es: Flask ahora ordena las claves JSON por defecto para no destrozar las cachés HTTP debido a diferentes semillas hash entre diferentes workers.

source: Added ``appcontext_pushed`` and ``appcontext_popped`` signals.
es: Añadidas las señales ``appcontext_pushed`` y ``appcontext_popped``.

source: The builtin run method now takes the ``SERVER_NAME`` into account when picking the default port to run on.
es: El método de ejecución incorporado ahora tiene en cuenta el ``SERVER_NAME`` al elegir el puerto por defecto para ejecutar.

source: Added ``flask.request.get_json()`` as a replacement for the old ``flask.request.json`` property.
es: Se ha añadido ``flask.request.get_json()`` en sustitución de la antigua propiedad ``flask.request.json``.

source: Version 0.9
es: Versión 0.9

source: Released 2012-07-01, codename Campari
es: Lanzamiento 2012-07-01, codename Campari

source: Logger now only returns the debug log setting if it was not set explicitly.
es: El registrador ahora sólo devuelve la configuración del registro de depuración si no se estableció explícitamente.

source: Unregister a circular dependency between the WSGI environment and the request object when shutting down the request. This means that environ ``werkzeug.request`` will be ``None`` after the response was returned to the WSGI server but has the advantage that the garbage collector is not needed on CPython to tear down the request unless the user created circular dependencies themselves.
es: Desregistra una dependencia circular entre el entorno WSGI y el objeto request al cerrar la petición. Esto significa que el entorno ``werkzeug.request`` será ``None`` después de que la respuesta haya sido devuelta al servidor WSGI pero tiene la ventaja de que el recolector de basura no es necesario en CPython para derribar la petición a menos que el usuario haya creado dependencias circulares por sí mismo.

source: Session is now stored after callbacks so that if the session payload is stored in the session you can still modify it in an after request callback.
es: La sesión se almacena ahora después de las devoluciones de llamada, de modo que si la carga útil de la sesión se almacena en la sesión, todavía se puede modificar en una devolución de llamada posterior a la solicitud.

source: Fixed an assumption in sessions implementation which could break message flashing on sessions implementations which use external storage.
es: Se ha corregido una suposición en la implementación de las sesiones que podía romper el parpadeo de los mensajes en las implementaciones de las sesiones que utilizan el almacenamiento externo.

source: Changed the behavior of tuple return values from functions. They are no longer arguments to the response object, they now have a defined meaning.
es: Se ha cambiado el comportamiento de los valores de retorno de las funciones. Ya no son argumentos del objeto de respuesta, ahora tienen un significado definido.

source: Added ``required_methods`` attribute to view functions to force-add methods on registration.
es: Se ha añadido el atributo ``required_methods`` a las funciones de vista para forzar la adición de métodos al registrarse.

source: Version 0.8.1
es: Versión 0.8.1

source: Released 2012-07-01
es: Lanzamiento 2012-07-01

source: Fixed an issue with the undocumented ``flask.session`` module to not work properly on Python 2.5. It should not be used but did cause some problems for package managers.
es: Se ha corregido un problema con el módulo no documentado ``flask.session`` para que no funcione correctamente en Python 2.5. No debería usarse, pero causaba algunos problemas a los gestores de paquetes.

source: Version 0.8
es: Versión 0.8

source: Released 2011-09-29, codename Rakija
es: Lanzamiento 2011-09-29, codename Rakija

source: Refactored session support into a session interface so that the implementation of the sessions can be changed without having to override the Flask class.
es: Refactorizado el soporte de sesiones en una interfaz de sesión para que la implementación de las sesiones pueda ser cambiada sin tener que sobreescribir la clase Flask.

source: Empty session cookies are now deleted properly automatically.
es: Las cookies de sesión vacías ahora se eliminan correctamente de forma automática.

source: View functions can now opt out of getting the automatic OPTIONS implementation.
es: Las funciones de visualización ahora pueden optar por no recibir la implementación automática de OPTIONS.

source: HTTP exceptions and Bad Request errors can now be trapped so that they show up normally in the traceback.
es: Las excepciones HTTP y los errores de solicitud incorrecta ahora pueden ser atrapados para que se muestren normalmente en el rastreo.

source: Flask in debug mode is now detecting some common problems and tries to warn you about them.
es: Flask en modo de depuración ahora detecta algunos problemas comunes y trata de advertirte sobre ellos.

source: Flask in debug mode will now complain with an assertion error if a view was attached after the first request was handled. This gives earlier feedback when users forget to import view code ahead of time.
es: Flask en modo de depuración ahora se quejará con un error de aserción si una vista fue adjuntada después de que la primera solicitud fue manejada. Esto da una respuesta más temprana cuando los usuarios se olvidan de importar el código de la vista antes de tiempo.

source: Malformed JSON data will now trigger a bad request HTTP exception instead of a value error which usually would result in a 500 internal server error if not handled. This is a backwards incompatible change.
es: Los datos JSON mal formados provocarán ahora una excepción HTTP de solicitud incorrecta en lugar de un error de valor que normalmente daría lugar a un error 500 interno del servidor si no se gestiona. Este es un cambio incompatible con el pasado.

source: Applications now not only have a root path where the resources and modules are located but also an instance path which is the designated place to drop files that are modified at runtime (uploads etc.). Also this is conceptually only instance depending and outside version control so it's the perfect place to put configuration files etc.
es: Las aplicaciones ahora no sólo tienen una ruta raíz donde se encuentran los recursos y los módulos, sino también una ruta de instancia que es el lugar designado para dejar los archivos que se modifican en tiempo de ejecución (cargas, etc.). Además, esto es conceptualmente sólo dependiendo de la instancia y fuera del control de versiones, por lo que es el lugar perfecto para poner los archivos de configuración, etc.

source: Added the ``APPLICATION_ROOT`` configuration variable.
es: Se ha añadido la variable de configuración ``APPLICATION_ROOT``.

source: Refactored test client internally. The ``APPLICATION_ROOT`` configuration variable as well as ``SERVER_NAME`` are now properly used by the test client as defaults.
es: Refactorizado el cliente de prueba internamente. La variable de configuración ``APPLICATION_ROOT`` así como ``SERVER_NAME`` son ahora utilizadas correctamente por el cliente de prueba como valores por defecto.

source: Fixed an issue where the test client if used with the "with" statement did not trigger the execution of the teardown handlers.
es: Se ha solucionado un problema por el que el cliente de prueba, si se utiliza con la sentencia "with", no desencadena la ejecución de los manejadores de desmontaje.

source: Added finer control over the session cookie parameters.
es: Se ha añadido un control más fino sobre los parámetros de las cookies de sesión.

source: HEAD requests to a method view now automatically dispatch to the ``get`` method if no handler was implemented.
es: Las peticiones HEAD a una vista de método ahora se envían automáticamente al método ``get`` si no se ha implementado ningún manejador.

source: The context preservation on exceptions is now an integral component of Flask itself and no longer of the test client. This cleaned up some internal logic and lowers the odds of runaway request contexts in unittests.
es: La preservación del contexto en las excepciones es ahora un componente integral de Flask y no del cliente de prueba. Esto ha limpiado parte de la lógica interna y disminuye las probabilidades de que los contextos de solicitud se desborden en las pruebas unitarias.

source: Fixed the Jinja2 environment's ``list_templates`` method not returning the correct names when blueprints or modules were involved.
es: Corregido el método ``list_templates`` del entorno Jinja2 que no devolvía los nombres correctos cuando se trataba de blueprints o módulos.

source: Version 0.7.2
es: Versión 0.7.2

source: Released 2011-07-06
es: Lanzamiento 2011-07-06

source: Fixed an issue with URL processors not properly working on blueprints.
es: Se ha solucionado un problema con los procesadores de URL que no funcionaban correctamente en los planos.

source: Version 0.7.1
es: Versión 0.7.1

source: Released 2011-06-29
es: Lanzamiento 2011-06-29

source: Added missing future import that broke 2.5 compatibility.
es: Se ha añadido la importación future que faltaba y que rompía la compatibilidad con 2.5.

source: Fixed an infinite redirect issue with blueprints.
es: Se ha corregido un problema de redirección infinita con los blueprints.

source: Version 0.7
es: Versión 0.7

source: Released 2011-06-28, codename Grappa
es: Lanzamiento 2011-06-28, codename Grappa

source: Static file handling for modules now requires the name of the static folder to be supplied explicitly. The previous autodetection was not reliable and caused issues on Google's App Engine. Until 1.0 the old behavior will continue to work but issue dependency warnings.
es: El manejo de archivos estáticos para los módulos ahora requiere que el nombre de la carpeta static sea suministrado explícitamente. La autodetección anterior no era fiable y causaba problemas en el App Engine de Google. Hasta la versión 1.0, el comportamiento anterior seguirá funcionando pero emitirá advertencias de dependencia.

source: Fixed a problem for Flask to run on jython.
es: Se ha corregido un problema para que Flask se ejecute en jython.

source: Added a ``PROPAGATE_EXCEPTIONS`` configuration variable that can be used to flip the setting of exception propagation which previously was linked to ``DEBUG`` alone and is now linked to either ``DEBUG`` or ``TESTING``.
es: Se ha añadido una variable de configuración ``PROPAGATE_EXCEPTIONS`` que puede utilizarse para cambiar la configuración de la propagación de excepciones, que antes estaba vinculada únicamente a ``DEBUG`` y ahora está vinculada a ``DEBUG`` o a ``TESTING``.

source: Flask no longer internally depends on rules being added through the ``add_url_rule`` function and can now also accept regular werkzeug rules added to the url map.
es: Flask ya no depende internamente de las reglas que se añaden a través de la función ``add_url_rule`` y ahora también puede aceptar reglas regulares de werkzeug añadidas al mapa de url.

source: Added an ``endpoint`` method to the flask application object which allows one to register a callback to an arbitrary endpoint with a decorator.
es: Se ha añadido un método ``endpoint`` al objeto de aplicación flask que permite registrar una devolución de llamada a un endpoint arbitrario con un decorador.

source: Use Last-Modified for static file sending instead of Date which was incorrectly introduced in 0.6.
es: Se utiliza Last-Modified para el envío de archivos estáticos en lugar de Date que fue introducido incorrectamente en 0.6.

source: Added ``create_jinja_loader`` to override the loader creation process.
es: Se ha añadido ``create_jinja_loader`` para anular el proceso de creación del cargador.

source: Implemented a silent flag for ``config.from_pyfile``.
es: Se ha implementado una señal silenciosa para ``config.from_pyfile``.

source: Added ``teardown_request`` decorator, for functions that should run at the end of a request regardless of whether an exception occurred. Also the behavior for ``after_request`` was changed. It's now no longer executed when an exception is raised.
es: Se ha añadido el decorador ``teardown_request``, para las funciones que deben ejecutarse al final de una petición, independientemente de si se ha producido una excepción. También se ha cambiado el comportamiento de ``after_request``. Ahora ya no se ejecuta cuando se produce una excepción.

source: The automatic JSON request data unpacking now looks at the charset mimetype parameter.
es: El desempaquetado automático de los datos de la solicitud JSON ahora busca el parámetro charset mimetype.

source: ``before_request`` handlers are now able to abort requests with errors.
es: Los manejadores ``before_request`` son ahora capaces de abortar las solicitudes con errores.

source: It is not possible to define user exception handlers. That way you can provide custom error messages from a central hub for certain errors that might occur during request processing (for instance database connection errors, timeouts from remote resources etc.).
es: No es posible definir manejadores de excepción de usuario. De este modo, puede proporcionar mensajes de error personalizados desde un centro para determinados errores que pueden producirse durante el procesamiento de las solicitudes (por ejemplo, errores de conexión a la base de datos, tiempos de espera de los recursos remotos, etc.).

source: Blueprints can provide blueprint specific error handlers.
es: Los blueprints pueden proporcionar manejadores de error específicos para cada blueprint.

source: Implemented generic class-based views.
es: Implementación de vistas genéricas basadas en clases.

source: Version 0.6.1
es: Versión 0.6.1

source: Released 2010-12-31
es: Lanzamiento 2010-12-31

source: Fixed an issue where the default ``OPTIONS`` response was not exposing all valid methods in the ``Allow`` header.
es: Se ha solucionado un problema por el que la respuesta por defecto ``OPTIONS`` no exponía todos los métodos válidos en la cabecera ``Allow``.

source: Jinja2 template loading syntax now allows "./" in front of a template load path. Previously this caused issues with module setups.
es: La sintaxis de carga de plantillas de Jinja2 ahora permite "./" delante de una ruta de carga de plantillas. Anteriormente esto causaba problemas con las configuraciones de los módulos.

source: Fixed an issue where the subdomain setting for modules was ignored for the static folder.
es: Se ha solucionado un problema por el que se ignoraba la configuración del subdominio para los módulos en la carpeta static.

source: Fixed a security problem that allowed clients to download arbitrary files if the host server was a windows based operating system and the client uses backslashes to escape the directory the files where exposed from.
es: Se ha corregido un problema de seguridad que permitía a los clientes descargar archivos arbitrarios si el servidor anfitrión era un sistema operativo basado en Windows y el cliente utilizaba barras invertidas para escapar del directorio desde el que se exponían los archivos.

source: Version 0.6
es: Versión 0.6

source: Released 2010-07-27, codename Whisky
es: Lanzamiento 2010-07-27, codename Whisky

source: After request functions are now called in reverse order of registration.
es: Las funciones posteriores a la solicitud se llaman ahora en orden inverso al registro.

source: OPTIONS is now automatically implemented by Flask unless the application explicitly adds 'OPTIONS' as method to the URL rule. In this case no automatic OPTIONS handling kicks in.
es: OPTIONS es ahora implementado automáticamente por Flask a menos que la aplicación añada explícitamente 'OPTIONS' como método a la regla de la URL. En este caso, no se aplica la gestión automática de OPTIONS.

source: Static rules are now even in place if there is no static folder for the module. This was implemented to aid GAE which will remove the static folder if it's part of a mapping in the .yml file.
es: Las reglas estáticas están ahora incluso en su lugar si no hay una carpeta estática para el módulo. Esto se implementó para ayudar a GAE que eliminará la carpeta estática si es parte de un mapeo en el archivo .yml.

source: Context processors will no longer override values passed directly to the render function.
es: Los procesadores de contexto ya no anularán los valores pasados directamente a la función de renderización.

source: Added the ability to limit the incoming request data with the new ``MAX_CONTENT_LENGTH`` configuration value.
es: Añadida la posibilidad de limitar los datos de la solicitud entrante con el nuevo valor de configuración ``MAX_CONTENT_LENGTH``.

source: Modules can now register for a subdomain instead of just an URL prefix. This makes it possible to bind a whole module to a configurable subdomain.
es: Ahora los módulos pueden registrarse para un subdominio en lugar de sólo un prefijo de URL. Esto permite vincular un módulo completo a un subdominio configurable.

source: Version 0.5.2
es: Versión 0.5.2

source: Released 2010-07-15
es: Lanzamiento 2010-07-15

source: Fixed another issue with loading templates from directories when modules were used.
es: Solucionado otro problema con la carga de plantillas desde los directorios cuando se utilizan módulos.

source: Version 0.5.1
es: Versión 0.5.1

source: Released 2010-07-06
es: Lanzamiento 2010-07-06

source: Fixes an issue with template loading from directories when modules where used.
es: Se corrige un problema con la carga de plantillas desde los directorios cuando se utilizan módulos.

source: Version 0.5
es: Versión 0.5

source: Released 2010-07-06, codename Calvados
es: Lanzamiento 2010-07-06, codename Calvados

source: Fixed a bug with subdomains that was caused by the inability to specify the server name. The server name can now be set with the ``SERVER_NAME`` config key. This key is now also used to set the session cookie cross-subdomain wide.
es: Corregido un error con los subdominios que era causado por la imposibilidad de especificar el nombre del servidor. Ahora el nombre del servidor se puede establecer con la clave de configuración ``SERVER_NAME``. Esta clave también se utiliza ahora para establecer la cookie de sesión en todos los subdominios.

source: Autoescaping is no longer active for all templates. Instead it is only active for ``.html``, ``.htm``, ``.xml`` and ``.xhtml``. Inside templates this behavior can be changed with the ``autoescape`` tag.
es: El autoescapado ya no está activo para todas las plantillas. En su lugar, sólo está activo para ``.html``, ``.htm``, ``.xml`` y ``.xhtml``. Dentro de las plantillas este comportamiento se puede cambiar con la etiqueta ``autoescape``.

source: Refactored Flask internally. It now consists of more than a single file.
es: Refactorizado Flask internamente. Ahora consta de más de un archivo.

source: (temporarily) dropped support for zipped applications. This was a rarely used feature and led to some confusing behavior.
es: Suprimida (temporalmente) la compatibilidad con las aplicaciones comprimidas. Se trataba de una función poco utilizada y daba lugar a comportamientos confusos.

source: Added support for per-package template and static-file directories.
es: Añadido soporte para plantillas por paquete y directorios de archivos estáticos.

source: Removed support for ``create_jinja_loader`` which is no longer used in 0.5 due to the improved module support.
es: Eliminada la compatibilidad con ``create_jinja_loader``, que ya no se utiliza en la versión 0.5 debido a la mejora del soporte de los módulos.

source: Added a helper function to expose files from any directory.
es: Añadida una función de ayuda para exponer archivos de cualquier directorio.

source: Version 0.4
es: Versión 0.4

source: Released 2010-06-18, codename Rakia
es: Lanzamiento 2010-06-18, codename Rakia

source: Added the ability to register application wide error handlers from modules.
es: Añadida la posibilidad de registrar los gestores de errores de toda la aplicación desde los módulos.

source: Test client has not the ability to preserve the request context for a little longer. This can also be used to trigger custom requests that do not pop the request stack for testing.
es: El cliente de pruebas no tiene la capacidad de preservar el contexto de la solicitud por un poco más de tiempo. Esto también se puede utilizar para desencadenar las solicitudes personalizadas que no saltan la pila de solicitudes para las pruebas.

source: Because the Python standard library caches loggers, the name of the logger is configurable now to better support unittests.
es: Debido a que la biblioteca estándar de Python almacena en caché los registradores, el nombre del registrador es ahora configurable para soportar mejor los unittests.

source: Added ``TESTING`` switch that can activate unittesting helpers.
es: Añadido el interruptor ``TESTING`` que puede activar los ayudantes de unitesting.

source: The logger switches to ``DEBUG`` mode now if debug is enabled.
es: El registrador cambia al modo ``DEBUG`` si la depuración está activada.

source: Version 0.3.1
es: Versión 0.3.1

source: Released 2010-05-28
es: Lanzamiento 2010-05-28

source: Release does no longer include development leftover files (.git folder for themes, built documentation in zip and pdf file and some .pyc files)
es: La versión ya no incluye los archivos sobrantes de desarrollo (carpeta .git para los temas, documentación construida en zip y archivo pdf y algunos archivos .pyc)

source: Version 0.3
es: Versión 0.3

source: Released 2010-05-28, codename Schnaps
es: Lanzamiento 2010-05-28, codename Schnaps

source: Added support for categories for flashed messages.
es: Añadido soporte para las categorías de los mensajes flash.

source: Added support for context binding that does not require the use of the with statement for playing in the console.
es: Añadido soporte para la vinculación contextual que no requiere el uso de la sentencia with para jugar en la consola.

source: The request context is now available within the with statement making it possible to further push the request context or pop it.
es: El contexto de la solicitud está ahora disponible dentro de la sentencia with, lo que hace posible empujar el contexto de la solicitud o hacerlo desaparecer.

source: Added support for configurations.
es: Añadido soporte para las configuraciones.

source: Version 0.2
es: Versión 0.2

source: Released 2010-05-12, codename J?germeister
es: Lanzamiento 2010-05-12, codename J?germeister

source: Various bugfixes
es: Varias correcciones de errores

source: Integrated JSON support
es: Soporte JSON integrado

source: Refactored internal request dispatching.
es: Refactorización del envío de solicitudes internas.

source: Server listens on 127.0.0.1 by default now to fix issues with chrome.
es: El servidor escucha en 127.0.0.1 por defecto para solucionar problemas con Chrome.

source: Added external URL support.
es: Añadido soporte de URLs externas.
