Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/changes.po
Languages: es

source: Changes
es: Cambios

source: Version 2.2.0
es: Versión 2.2.0

source: Old names for some ``send_file`` parameters have been removed. ``download_name`` replaces ``attachment_filename``, ``max_age`` replaces ``cache_timeout``, and ``etag`` replaces ``add_etags``. Additionally, ``path`` replaces ``filename`` in ``send_from_directory``.
es: Se han eliminado los antiguos nombres de algunos parámetros de ``send_file``. ``download_name`` sustituye a ``attachment_filename``, ``max_age`` sustituye a ``cache_timeout``, y ``etag`` sustituye a ``add_etags``. Además, ``path`` sustituye a ``filename`` en ``send_from_directory``.

source: The ``RequestContext.g`` property returning ``AppContext.g`` is removed.
es: Se elimina la propiedad ``RequestContext.g`` que devuelve ``AppContext.g``.

source: The app and request contexts are managed using Python context vars directly rather than Werkzeug's ``LocalStack``. This should result in better performance and memory use. :pr:`4682`
es: Los contextos de la aplicación y de la petición se gestionan utilizando directamente las varas de contexto de Python en lugar de la ``LocalStack`` de Werkzeug. Esto debería dar lugar a un mejor rendimiento y uso de la memoria. :pr:`4682`

source: Extension maintainers, be aware that ``_app_ctx_stack.top`` and ``_request_ctx_stack.top`` are deprecated. Store data on ``g`` instead using a unique prefix, like ``g._extension_name_attr``.
es: Mantenedores de extensiones, tened en cuenta que ``_app_ctx_stack.top`` y ``_request_ctx_stack.top`` están obsoletos. Almacena los datos en ``g`` en su lugar utilizando un prefijo único, como ``g._extension_name_attr``.

source: Add new customization points to the ``Flask`` app object for many previously global behaviors.
es: Añade nuevos puntos de personalización al objeto de aplicación ``Flask`` para muchos comportamientos anteriormente globales.

source: ``flask.url_for`` will call ``app.url_for``. :issue:`4568`
es: ``flask.url_for`` llamará a ``app.url_for``. :issue:`4568`

source: ``flask.abort`` will call ``app.aborter``. ``Flask.aborter_class`` and ``Flask.make_aborter`` can be used to customize this aborter. :issue:`4567`
es: ``flask.abort`` llamará a ``app.aborter``. Se puede utilizar ``Flask.aborter_class`` y ``Flask.make_aborter`` para personalizar este abortador. :issue:`4567`

source: ``flask.redirect`` will call ``app.redirect``. :issue:`4569`
es: ``flask.redirect`` llamará a ``app.redirect``. :issue:`4569`

source: Refactor ``register_error_handler`` to consolidate error checking. Rewrite some error messages to be more consistent. :issue:`4559`
es: Refactorizar ``register_error_handler`` para consolidar la comprobación de errores. Reescribir algunos mensajes de error para que sean más consistentes. :issue:`4559`

source: Use Blueprint decorators and functions intended for setup after registering the blueprint will show a warning. In the next version, this will become an error just like the application setup methods. :issue:`4571`
es: El uso de decoradores y funciones de Blueprint destinados a la configuración después de registrar el blueprint mostrará una advertencia. En la próxima versión, esto se convertirá en un error al igual que los métodos de configuración de la aplicación. :issue:`4571`

source: ``before_first_request`` is deprecated. Run setup code when creating the application instead. :issue:`4605`
es: ``before_first_request`` está obsoleto. En su lugar, ejecute el código de configuración al crear la aplicación. :issue:`4605`

source: Added the ``View.init_every_request`` class attribute. If a view subclass sets this to ``False``, the view will not create a new instance on every request. :issue:`2520`.
es: Se ha añadido el atributo de clase ``View.init_every_request``. Si una subclase de la vista lo establece en ``False``, la vista no creará una nueva instancia en cada petición. :issue:`2520`.

source: A ``flask.cli.FlaskGroup`` Click group can be nested as a sub-command in a custom CLI. :issue:`3263`
es: Un grupo de Click ``flask.cli.FlaskGroup`` puede anidarse como subcomando en una CLI personalizada. :issue:`3263`

source: Add ``--env-file`` option to the ``flask`` CLI. This allows specifying a dotenv file to load in addition to ``.env`` and ``.flaskenv``. :issue:`3108`
es: Añadir la opción ``--env-file`` al CLI de ``flask``. Esto permite especificar un archivo dotenv para cargar además de ``.env`` y ``.flaskenv``. :issue:`3108`

source: It is no longer required to decorate custom CLI commands on ``app.cli`` or ``blueprint.cli`` with ``@with_appcontext``, an app context will already be active at that point. :issue:`2410`
es: Ya no es necesario decorar los comandos CLI personalizados en ``app.cli`` o ``blueprint.cli`` con ``@with_appcontext``, un contexto de aplicación ya estará activo en ese punto. :issue:`2410`

source: ``SessionInterface.get_expiration_time`` uses a timezone-aware value. :pr:`4645`
es: ``SessionInterface.get_expiration_time`` utiliza un valor que tiene en cuenta la zona horaria. :pr:`4645`

source: View functions can return generators directly instead of wrapping them in a ``Response``. :pr:`4629`
es: Las funciones de vista pueden devolver generadores directamente en lugar de envolverlos en una ``Response``. :pr:`4629`

source: Add ``stream_template`` and ``stream_template_string`` functions to render a template as a stream of pieces. :pr:`4629`
es: Añade las funciones ``stream_template`` y ``stream_template_string`` para representar una plantilla como un flujo de piezas. :pr:`4629`

source: A new implementation of context preservation during debugging and testing. :pr:`4666`
es: Una nueva implementación de la preservación del contexto durante la depuración y las pruebas. :pr:`4666`

source: ``request``, ``g``, and other context-locals point to the correct data when running code in the interactive debugger console. :issue:`2836`
es: ``request``, ``g`` y otras localizaciones de contexto apuntan a los datos correctos cuando se ejecuta código en la consola del depurador interactivo. :issue:`2836`

source: Teardown functions are always run at the end of the request, even if the context is preserved. They are also run after the preserved context is popped.
es: Las funciones de desmontaje se ejecutan siempre al final de la solicitud, incluso si el contexto se conserva. También se ejecutan después de que el contexto preservado se desprenda.

source: ``stream_with_context`` preserves context separately from a ``with client`` block. It will be cleaned up when ``response.get_data()`` or ``response.close()`` is called.
es: ``stream_with_context`` preserva el contexto por separado de un bloque ``with client``. Se limpiará cuando se llame a ``response.get_data()`` o ``response.close()``.

source: Allow returning a list from a view function, to convert it to a JSON response like a dict is. :issue:`4672`
es: Permitir la devolución de una lista desde una función de vista, para convertirla en una respuesta JSON como lo es un dict. :issue:`4672`

source: Version 2.1.3
es: Versión 2.1.3

source: Inline some optional imports that are only used for certain CLI commands. :pr:`4606`
es: Importaciones inline opcionales que sólo se utilizan para ciertos comandos de la CLI. :pr:`4606`

source: Relax type annotation for ``after_request`` functions. :issue:`4600`
es: Relaja la anotación de tipo para las funciones ``after_request``. :issue:`4600`

source: Version 2.1.2
es: Versión 2.1.2

source: Released 2022-04-28
es: Lanzamiento 2022-04-28

source: Fix type annotation for ``json.loads``, it accepts str or bytes. :issue:`4519`
es: Corrige la anotación de tipo para ``json.loads``, acepta str o bytes. :issue:`4519`

source: The ``--cert`` and ``--key`` options on ``flask run`` can be given in either order. :issue:`4459`
es: Las opciones ``--cert`` y ``--key`` en ``flask run`` pueden darse en cualquier orden. :issue:`4459`

source: Version 2.1.1
es: Versión 2.1.1

source: Released on 2022-03-30
es: Lanzamiento 2022-03-30

source: Set the minimum required version of importlib_metadata to 3.6.0, which is required on Python < 3.10. :issue:`4502`
es: Establece la versión mínima requerida de importlib_metadata a 3.6.0, que es necesaria en Python < 3.10. :issue:`4502`

source: Version 2.1.0
es: Versión 2.1.0

source: Released 2022-03-28
es: Lanzamiento 2022-03-28

source: Drop support for Python 3.6. :pr:`4335`
es: Deja de ser compatible con Python 3.6. :pr:`4335`

source: Update Click dependency to >= 8.0. :pr:`4008`
es: Actualizar la dependencia de Click a >= 8.0. :pr:`4008`

source: Remove previously deprecated code. :pr:`4337`
es: Elimina el código previamente obsoleto. :pr:`4337`

source: The CLI does not pass ``script_info`` to app factory functions.
es: La CLI no pasa ``script_info`` a las funciones de fábrica de la aplicación.

source: ``config.from_json`` is replaced by ``config.from_file(name, load=json.load)``.
es: ``config.from_json`` se sustituye por ``config.from_file(name, load=json.load)``.

source: ``json`` functions no longer take an ``encoding`` parameter.
es: Las funciones ``json`` ya no toman el parámetro ``encoding``.

source: ``safe_join`` is removed, use ``werkzeug.utils.safe_join`` instead.
es: Se ha eliminado ``safe_join``, utilice en su lugar ``werkzeug.utils.safe_join``.

source: ``total_seconds`` is removed, use ``timedelta.total_seconds`` instead.
es: Se ha eliminado ``total_seconds``, utilice ``timedelta.total_seconds`` en su lugar.

source: The same blueprint cannot be registered with the same name. Use ``name=`` when registering to specify a unique name.
es: No se puede registrar el mismo plano con el mismo nombre. Utiliza ``name=`` cuando te registres para especificar un nombre único.

source: The test client's ``as_tuple`` parameter is removed. Use ``response.request.environ`` instead. :pr:`4417`
es: Se elimina el parámetro ``as_tuple`` del cliente de prueba. Utiliza ``response.request.environ`` en su lugar. :pr:`4417`

source: Some parameters in ``send_file`` and ``send_from_directory`` were renamed in 2.0. The deprecation period for the old names is extended to 2.2. Be sure to test with deprecation warnings visible.
es: Algunos parámetros de ``send_file`` y ``send_from_directory`` fueron renombrados en la 2.0. El periodo de depreciación de los nombres antiguos se extiende hasta la 2.2. Asegúrese de probar con las advertencias de depreciación visibles.

source: ``attachment_filename`` is renamed to ``download_name``.
es: ``attachment_filename`` es renombrado a ``download_name``.

source: ``cache_timeout`` is renamed to ``max_age``.
es: ``cache_timeout`` es renombrado a ``max_age``.

source: ``add_etags`` is renamed to ``etag``.
es: ``add_etags`` es renombrado a ``etag``.

source: ``filename`` is renamed to ``path``.
es: ``filename`` es renombrado a ``path``.

source: The ``RequestContext.g`` property is deprecated. Use ``g`` directly or ``AppContext.g`` instead. :issue:`3898`
es: La propiedad ``RequestContext.g`` está obsoleta. Utilice ``g`` directamente o ``AppContext.g`` en su lugar. :issue:`3898`

source: ``copy_current_request_context`` can decorate async functions. :pr:`4303`
es: ``copy_current_request_context`` puede decorar funciones async. :pr:`4303`

source: Overriding ``FlaskClient.open`` will not cause an error on redirect. :issue:`3396`
es: Anular ``FlaskClient.open`` no causará un error en la redirección. :issue:`3396`

source: Add an ``--exclude-patterns`` option to the ``flask run`` CLI command to specify patterns that will be ignored by the reloader. :issue:`4188`
es: Añade una opción ``--exclude-patterns`` al comando CLI ``flask run`` para especificar patrones que serán ignorados por el recargador. :issue:`4188`

source: When using lazy loading (the default with the debugger), the Click context from the ``flask run`` command remains available in the loader thread. :issue:`4460`
es: Cuando se utiliza la carga perezosa (por defecto con el depurador), el contexto Click del comando ``flask run`` permanece disponible en el hilo del cargador. :issue:`4460`

source: Deleting the session cookie uses the ``httponly`` flag. :issue:`4485`
es: La eliminación de la cookie de sesión utiliza la bandera ``httponly``. :issue:`4485`

source: Relax typing for ``errorhandler`` to allow the user to use more precise types and decorate the same function multiple times. :issue:`4095, 4295, 4297`
es: Relajar la tipificación de ``errorhandler`` para permitir al usuario utilizar tipos más precisos y decorar la misma función varias veces. :issue:`4095, 4295, 4297`

source: Fix typing for ``__exit__`` methods for better compatibility with ``ExitStack``. :issue:`4474`
es: Corregir la tipificación de los métodos ``__exit__`` para mejorar la compatibilidad con ``ExitStack``. :issue:`4474`

source: From Werkzeug, for redirect responses the ``Location`` header URL will remain relative, and exclude the scheme and domain, by default. :pr:`4496`
es: Desde Werkzeug, para las respuestas de redirección la URL de la cabecera ``Location`` seguirá siendo relativa, y excluirá el esquema y el dominio, por defecto. :pr:`4496`

source: Add ``Config.from_prefixed_env()`` to load config values from environment variables that start with ``FLASK_`` or another prefix. This parses values as JSON by default, and allows setting keys in nested dicts. :pr:`4479`
es: Añade ``Config.from_prefixed_env()`` para cargar los valores de configuración de las variables de entorno que comienzan con ``FLASK_`` u otro prefijo. Esto analiza los valores como JSON por defecto, y permite establecer claves en dictos anidados. :pr:`4479`

source: Version 2.0.3
es: Versión 2.0.3

source: Released 2022-02-14
es: Publicado el 2022-02-14

source: The test client's ``as_tuple`` parameter is deprecated and will be removed in Werkzeug 2.1. It is now also deprecated in Flask, to be removed in Flask 2.1, while remaining compatible with both in 2.0.x. Use ``response.request.environ`` instead. :pr:`4341`
es: El parámetro ``as_tuple`` del cliente de pruebas está obsoleto y se eliminará en Werkzeug 2.1. Ahora también está obsoleto en Flask, que se eliminará en Flask 2.1, aunque seguirá siendo compatible con ambos en 2.0.x. Utiliza ``response.request.environ`` en su lugar. :pr:`4341`

source: Fix type annotation for ``errorhandler`` decorator. :issue:`4295`
es: Corrige la anotación de tipo para el decorador ``errorhandler``. :issue:`4295`

source: Revert a change to the CLI that caused it to hide ``ImportError`` tracebacks when importing the application. :issue:`4307`
es: Revierte un cambio en la CLI que provocaba que se ocultaran los tracebacks de ``ImportError`` al importar la aplicación. :issue:`4307`

source: ``app.json_encoder`` and ``json_decoder`` are only passed to ``dumps`` and ``loads`` if they have custom behavior. This improves performance, mainly on PyPy. :issue:`4349`
es: ``app.json_encoder`` y ``json_decoder`` sólo se pasan a ``dumps`` y ``loads`` si tienen un comportamiento personalizado. Esto mejora el rendimiento, principalmente en PyPy. :issue:`4349`

source: Clearer error message when ``after_this_request`` is used outside a request context. :issue:`4333`
es: Mensaje de error más claro cuando se utiliza ``after_this_request`` fuera de un contexto de solicitud. :issue:`4333`

source: Version 2.0.2
es: Versión 2.0.2

source: Released 2021-10-04
es: Publicado el 2021-10-04

source: Fix type annotation for ``teardown_*`` methods. :issue:`4093`
es: Corrige la anotación de tipo para los métodos ``teardown_*``. :issue:`4093`

source: Fix type annotation for ``before_request`` and ``before_app_request`` decorators. :issue:`4104`
es: Corrige la anotación de tipo para los decoradores ``before_request`` y ``before_app_request``. :issue:`4104`

source: Fixed the issue where typing requires template global decorators to accept functions with no arguments. :issue:`4098`
es: Solucionado el problema por el que la escritura requiere que los decoradores globales de las plantillas acepten funciones sin argumentos. :issue:`4098`

source: Support View and MethodView instances with async handlers. :issue:`4112`
es: Soporta las instancias View y MethodView con manejadores asíncronos. :issue:`4112`

source: Enhance typing of ``app.errorhandler`` decorator. :issue:`4095`
es: Mejora la tipificación del decorador ``app.errorhandler``. :issue:`4095`

source: Fix registering a blueprint twice with differing names. :issue:`4124`
es: Corrige el registro de un blueprint dos veces con nombres diferentes. :issue:`4124`

source: Fix the type of ``static_folder`` to accept ``pathlib.Path``. :issue:`4150`
es: Corrige el tipo de ``static_folder`` para aceptar ``pathlib.Path``. :issue:`4150`

source: ``jsonify`` handles ``decimal.Decimal`` by encoding to ``str``. :issue:`4157`
es: ``jsonify`` maneja ``decimal.Decimal`` codificando a ``str``. :issue:`4157`

source: Correctly handle raising deferred errors in CLI lazy loading. :issue:`4096`
es: Manejar correctamente el levantamiento de errores diferidos en la carga retardada de la CLI. :issue:`4096`

source: The CLI loader handles ``**kwargs`` in a ``create_app`` function. :issue:`4170`
es: El cargador CLI maneja ``**kwargs`` en una función ``create_app``. :issue:`4170`

source: Fix the order of ``before_request`` and other callbacks that trigger before the view returns. They are called from the app down to the closest nested blueprint. :issue:`4229`
es: Corregido el orden de ``before_request`` y otros callbacks que se activan antes de que vuelva la vista. Se llaman desde la aplicación hasta el blueprint anidado más cercano. :issue:`4229`

source: Version 2.0.1
es: Versión 2.0.1

source: Released 2021-05-21
es: Publicado el 2021-05-21

source: Re-add the ``filename`` parameter in ``send_from_directory``. The ``filename`` parameter has been renamed to ``path``, the old name is deprecated. :pr:`4019`
es: Vuelve a añadir el parámetro ``filename`` en ``send_from_directory``. El parámetro ``filename`` ha sido renombrado a ``path``, el antiguo nombre está obsoleto. :pr:`4019`

source: Mark top-level names as exported so type checking understands imports in user projects. :issue:`4024`
es: Marcar los nombres de nivel superior como exportados para que la comprobación de tipo entienda las importaciones en los proyectos de usuario. :issue:`4024`

source: Fix type annotation for ``g`` and inform mypy that it is a namespace object that has arbitrary attributes. :issue:`4020`
es: Corrige la anotación de tipo para ``g`` e informar a mypy de que es un objeto de espacio de nombres que tiene atributos arbitrarios. :issue:`4020`

source: Fix some types that weren't available in Python 3.6.0. :issue:`4040`
es: Corrige algunos tipos que no estaban disponibles en Python 3.6.0. :issue:`4040`

source: Improve typing for ``send_file``, ``send_from_directory``, and ``get_send_file_max_age``. :issue:`4044`, :pr:`4026`
es: Mejora la tipificación de ``send_file``, ``send_from_directory`` y ``get_send_file_max_age``. :issue:`4044`, :pr:`4026`

source: Show an error when a blueprint name contains a dot. The ``.`` has special meaning, it is used to separate (nested) blueprint names and the endpoint name. :issue:`4041`
es: Muestra un error cuando un nombre de blueprint contiene un punto. El ``.`` tiene un significado especial, se utiliza para separar los nombres de los blueprints (anidados) y el nombre del punto final. :issue:`4041`

source: Combine URL prefixes when nesting blueprints that were created with a ``url_prefix`` value. :issue:`4037`
es: Combina prefijos de URL al anidar blueprints creados con un valor ``url_prefix``. :issue:`4037`

source: Revert a change to the order that URL matching was done. The URL is again matched after the session is loaded, so the session is available in custom URL converters. :issue:`4053`
es: Revertir un cambio en el orden en que se realizaba la coincidencia de URLs. La URL vuelve a coincidir después de cargar la sesión, por lo que la sesión está disponible en los conversores de URL personalizados. :issue:`4053`

source: Re-add deprecated ``Config.from_json``, which was accidentally removed early. :issue:`4078`
es: Vuelve a añadir el obsoleto ``Config.from_json``, que fue eliminado accidentalmente antes. :issue:`4078`

source: Improve typing for some functions using ``Callable`` in their type signatures, focusing on decorator factories. :issue:`4060`
es: Mejora la tipificación de algunas funciones que utilizan ``Callable`` en sus firmas de tipo, centrándose en las fábricas de decoradores. :issue:`4060`

source: Nested blueprints are registered with their dotted name. This allows different blueprints with the same name to be nested at different locations. :issue:`4069`
es: Los blueprints anidados se registran con su nombre punteado. Esto permite anidar diferentes blueprints con el mismo nombre en diferentes lugares. :issue:`4069`

source: ``register_blueprint`` takes a ``name`` option to change the (pre-dotted) name the blueprint is registered with. This allows the same blueprint to be registered multiple times with unique names for ``url_for``. Registering the same blueprint with the same name multiple times is deprecated. :issue:`1091`
es: ``register_blueprint`` toma una opción ``name`` para cambiar el nombre (pre-punteado) con el que se registra el blueprint. Esto permite registrar el mismo blueprint varias veces con nombres únicos para ``url_for``. Registrar el mismo blueprint con el mismo nombre varias veces está obsoleto. :issue:`1091`

source: Improve typing for ``stream_with_context``. :issue:`4052`
es: Mejora la tipificación de ``stream_with_context``. :issue:`4052`

source: Version 2.0.0
es: Versión 2.0.0

source: Drop support for Python 2 and 3.5.
es: Deja de ser compatible con Python 2 y 3.5.

source: Bump minimum versions of other Pallets projects: Werkzeug >= 2, Jinja2 >= 3, MarkupSafe >= 2, ItsDangerous >= 2, Click >= 8. Be sure to check the change logs for each project. For better compatibility with other applications (e.g. Celery) that still require Click 7, there is no hard dependency on Click 8 yet, but using Click 7 will trigger a DeprecationWarning and Flask 2.1 will depend on Click 8.
es: Aumenta las versiones mínimas de otros proyectos de Pallets: Werkzeug >= 2, Jinja2 >= 3, MarkupSafe >= 2, ItsDangerous >= 2, Click >= 8. Asegúrese de comprobar los registros de cambios de cada proyecto. Para una mejor compatibilidad con otras aplicaciones (por ejemplo, Celery) que todavía requieren Click 7, todavía no hay dependencia dura de Click 8, pero el uso de Click 7 activará un DeprecationWarning y Flask 2.1 dependerá de Click 8.

source: JSON support no longer uses simplejson. To use another JSON module, override ``app.json_encoder`` and ``json_decoder``. :issue:`3555`
es: El soporte de JSON ya no utiliza simplejson. Para utilizar otro módulo JSON, anule ``app.json_encoder`` y ``json_decoder``. :issue:`3555`

source: The ``encoding`` option to JSON functions is deprecated. :pr:`3562`
es: La opción ``encoding`` de las funciones JSON está obsoleta. :pr:`3562`

source: Passing ``script_info`` to app factory functions is deprecated. This was not portable outside the ``flask`` command. Use ``click.get_current_context().obj`` if it's needed. :issue:`3552`
es: Pasa ``script_info`` a las funciones de fábrica de la aplicación está obsoleto. Esto no era portable fuera del comando ``flask``. Usa ``click.get_current_context().obj`` si es necesario. :issue:`3552`

source: The CLI shows better error messages when the app failed to load when looking up commands. :issue:`2741`
es: La CLI muestra mejores mensajes de error cuando la aplicación no se carga al buscar comandos. :issue:`2741`
