Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/debugging.po
Languages: es, fr

source: Debugging Application Errors
es: Depuración de errores de la aplicación
fr: Débogage des erreurs d'application

source: In Production
es: En producción
fr: En cours de production

source: **Do not run the development server, or enable the built-in debugger, in a production environment.** The debugger allows executing arbitrary Python code from the browser. It's protected by a pin, but that should not be relied on for security.
es: **No ejecute el servidor de desarrollo, ni habilite el depurador incorporado, en un entorno de producción.** El depurador permite ejecutar código Python arbitrario desde el navegador. Está protegido por un pin, pero no se debe confiar en eso para la seguridad.
fr: **N'exécutez pas le serveur de développement ou n'activez pas le débogueur intégré dans un environnement de production.** Le débogueur permet d'exécuter du code Python arbitraire depuis le navigateur. Il est protégé par un PIN, mais il ne faut pas s'y fier pour la sécurité.

source: Use an error logging tool, such as Sentry, as described in :ref:`error-logging-tools`, or enable logging and notifications as described in :doc:`/logging`.
es: Utiliza una herramienta de registro de errores, como Sentry, como se describe en :ref:`error-logging-tools`, o activa el registro y las notificaciones como se describe en :doc:`/logging`.
fr: Utilisez un outil de journalisation des erreurs, tel que Sentry, comme décrit dans :ref:`error-logging-tools`, ou activez la journalisation et les notifications comme décrit dans :doc:`/logging`.

source: If you have access to the server, you could add some code to start an external debugger if ``request.remote_addr`` matches your IP. Some IDE debuggers also have a remote mode so breakpoints on the server can be interacted with locally. Only enable a debugger temporarily.
es: Si tiene acceso al servidor, podría añadir algún código para iniciar un depurador externo si ``request.remote_addr`` coincide con su IP. Algunos depuradores IDE también tienen un modo remoto para que los puntos de interrupción en el servidor puedan ser interactuados localmente. Habilite un depurador sólo temporalmente.
fr: Si vous avez accès au serveur, vous pouvez ajouter du code pour lancer un débogueur externe si ``request.remote_addr`` correspond à votre IP. Certains débogueurs IDE disposent également d'un mode distant, ce qui permet d'interagir localement avec les points d'arrêt sur le serveur. N'activez le débogueur que temporairement.

source: The Built-In Debugger
es: El depurador incorporado
fr: Le débogueur intégré

source: The built-in Werkzeug development server provides a debugger which shows an interactive traceback in the browser when an unhandled error occurs during a request. This debugger should only be used during development.
es: El servidor de desarrollo incorporado de Werkzeug proporciona un depurador que muestra un rastreo interactivo en el navegador cuando se produce un error no manejado durante una solicitud. Este depurador sólo debe utilizarse durante el desarrollo.
fr: Le serveur de développement intégré de Werkzeug fournit un débogueur qui affiche un retour de trace interactif dans le navigateur lorsqu'une erreur non gérée survient lors d'une requête. Ce débogueur ne doit être utilisé que pendant le développement.

source: screenshot of debugger in action
es: captura de pantalla del depurador en acción
fr: capture d'écran du débogueur en action

source: The debugger allows executing arbitrary Python code from the browser. It is protected by a pin, but still represents a major security risk. Do not run the development server or debugger in a production environment.
es: El depurador permite ejecutar código Python arbitrario desde el navegador. Está protegido por un pin, pero sigue representando un riesgo de seguridad importante. No ejecute el servidor de desarrollo o el depurador en un entorno de producción.
fr: Le débogueur permet d'exécuter du code Python arbitraire depuis le navigateur. Il est protégé par un PIN, mais représente tout de même un risque de sécurité important. N'exécutez pas le serveur de développement ou le débogueur dans un environnement de production.

source: The debugger is enabled by default when the development server is run in debug mode.
es: El depurador se activa por defecto cuando el servidor de desarrollo se ejecuta en modo depuración.

source: When running from Python code, passing ``debug=True`` enables debug mode, which is mostly equivalent.
es: Cuando se ejecuta desde código Python, pasar ``debug=True`` habilita el modo depuración, que es mayormente equivalente.

source: :doc:`/server` and :doc:`/cli` have more information about running the debugger and debug mode. More information about the debugger can be found in the `Werkzeug documentation <https://werkzeug.palletsprojects.com/debug/>`__.
es: :doc:`/server` y :doc:`/cli` tienen más información sobre la ejecución del depurador y el modo depuración. Puede encontrar más información sobre el depurador en la documentación de `Werkzeug <https://werkzeug.palletsprojects.com/debug/>`__.

source: External Debuggers
es: Depuradores externos
fr: Débogueurs externes

source: External debuggers, such as those provided by IDEs, can offer a more powerful debugging experience than the built-in debugger. They can also be used to step through code during a request before an error is raised, or if no error is raised. Some even have a remote mode so you can debug code running on another machine.
es: Los depuradores externos, como los proporcionados por los IDEs, pueden ofrecer una experiencia de depuración más potente que el depurador incorporado. También pueden utilizarse para recorrer el código durante una solicitud antes de que se produzca un error, o si no se produce ningún error. Algunos incluso tienen un modo remoto para que puedas depurar el código que se ejecuta en otra máquina.
fr: Les débogueurs externes, tels que ceux fournis par les IDE, peuvent offrir une expérience de débogage plus puissante que le débogueur intégré. Ils peuvent également être utilisés pour parcourir le code pendant une requête avant qu'une erreur ne soit levée, ou si aucune erreur n'est levée. Certains disposent même d'un mode distant qui vous permet de déboguer du code exécuté depuis une autre machine.

source: When using an external debugger, the app should still be in debug mode, otherwise Flask turns unhandled errors into generic 500 error pages. However, the built-in debugger and reloader should be disabled so they don't interfere with the external debugger.
es: Cuando se utiliza un depurador externo, la aplicación todavía debe estar en modo de depuración, de lo contrario Flask convierte los errores no manejados en páginas genéricas de error 500. Sin embargo, el depurador integrado y el reloader deben estar desactivados para que no interfieran con el depurador externo.

source: When running from Python:
es: Cuando se ejecuta desde Python:
fr: Lors de l'exécution à partir de Python :

source: Disabling these isn't required, an external debugger will continue to work with the following caveats.
es: Deshabilitar estos no es necesario, un depurador externo seguirá funcionando con las siguientes advertencias.

source: If the built-in debugger is not disabled, it will catch unhandled exceptions before the external debugger can.
es: Si el depurador incorporado no está deshabilitado, capturará las excepciones no manejadas antes de que lo haga el depurador externo.

source: If the reloader is not disabled, it could cause an unexpected reload if code changes during a breakpoint.
es: Si el reloader no está desactivado, podría provocar una recarga inesperada si el código cambia durante un punto de interrupción.

source: The development server will still catch unhandled exceptions if the built-in debugger is disabled, otherwise it would crash on any error. If you want that (and usually you don't) pass ``passthrough_errors=True`` to ``app.run``.
es: El servidor de desarrollo seguirá capturando las excepciones no manejadas si el depurador incorporado está deshabilitado, de lo contrario se bloquearía con cualquier error. Si desea que (y por lo general no lo hace) pase ``passthrough_errors=True`` a ``app.run``.
