Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/errorhandling.po
Languages: es

source: See :doc:`/logging` for information about how to log exceptions, such as by emailing them to admins.
es: Consulte :doc:`/logging` para obtener información sobre cómo registrar las excepciones, por ejemplo, enviándolas por correo electrónico a los administradores.

source: Debugging
es: Depurando

source: See :doc:`/debugging` for information about how to debug errors in development and production.
es: Consulte :doc:`/debugging` para obtener información sobre cómo depurar errores en desarrollo y producción.
