Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/installation.po
Languages: fr, zh_cn

source: Installation
zh_cn: 安装

source: Python Version
fr: Version de Python
zh_cn: Python 版本

source: Dependencies
fr: Dépendances
zh_cn: 依赖

source: These distributions will be installed automatically when installing Flask.
fr: Ces distributions seront installées automatiquement lors de l'installation de Flask.
zh_cn: 这些包会在安装 Flask 的时候被自动安装。

source: `Werkzeug`_ implements WSGI, the standard Python interface between applications and servers.
fr: `Werkzeug`_ implémente WSGI, l'interface standard Python entre les applications et les serveurs.
zh_cn: `Werkzeug`_ 实现了 WSGI——程序和服务器之间交互的 Python 标准。

source: `Jinja`_ is a template language that renders the pages your application serves.
fr: `Jinja`_ est un langage de modèle qui rend les pages que votre application sert.
zh_cn: `Jinja`_ 是一个模板语言，它可以渲染你的程序提供的页面。

source: `MarkupSafe`_ comes with Jinja. It escapes untrusted input when rendering templates to avoid injection attacks.
fr: `MarkupSafe`_ est livré avec Jinja. Il échappe les entrées non fiables lors du rendu des modèles pour éviter les attaques par injection.
zh_cn: `MarkupSafe`_ 随 Jinja 附带。当渲染模板时，它会转义不受信任的输入以避免注入攻击。

source: `ItsDangerous`_ securely signs data to ensure its integrity. This is used to protect Flask's session cookie.
fr: `ItsDangerous`_ signe les données de manière sécurisée pour garantir leur intégrité. Ceci est utilisé pour protéger le cookie de session de Flask.
zh_cn: `ItsDangerous`_ 可以安全地签名数据以确保数据的完整性。这被用来保护 Flask 的 ``session`` cookie。

source: `Click`_ is a framework for writing command line applications. It provides the ``flask`` command and allows adding custom management commands.
fr: `Click`_ est une infrastructure logicielle pour écrire des applications en ligne de commande. Il fournit la commande ``flask`` et permet d'ajouter des commandes de gestion personnalisées.
zh_cn: `Click`_ 是一个用来写命令行程序的框架。它提供了 ``flask`` 命令并允许添加自定义管理命令。

source: `Blinker`_ provides support for :doc:`signals`.
fr: `Blinker`_ fournit un support pour :doc:`signals`.
zh_cn: `Blinker`_ 提供 :doc:`signals` 支持。

source: Optional dependencies
fr: Dépendances facultatives
zh_cn: 可选依赖

source: These distributions will not be installed automatically. Flask will detect and use them if you install them.
fr: Ces distributions ne seront pas installées automatiquement. Flask les détectera et les utilisera si vous les installez.
zh_cn: 这些包不会被自动安装。如果你安装了的话，Flask 会检测到并使用它们。

source: `python-dotenv`_ enables support for :ref:`dotenv` when running ``flask`` commands.
fr: `python-dotenv`_ active le support de :ref:`dotenv` lors de l'exécution des commandes ``flask``.
zh_cn: `python-dotenv`_ 在执行 ``flask`` 命令时开启对 :ref:`dotenv` 的支持。

source: `Watchdog`_ provides a faster, more efficient reloader for the development server.
fr: `Watchdog`_ fournit un *reloader* plus rapide et plus efficace pour le serveur de développement.
zh_cn: `Watchdog`_ 为开发服务器提供更快和更高效的重载器（reloader）。

source: Virtual environments
fr: Environnements virtuels
zh_cn: 虚拟环境

source: Use a virtual environment to manage the dependencies for your project, both in development and in production.
fr: Utilisez un environnement virtuel pour gérer les dépendances de votre projet, tant en développement qu'en production.
zh_cn: 使用虚拟环境可以在开发和生产环境下管理项目依赖。

source: What problem does a virtual environment solve? The more Python projects you have, the more likely it is that you need to work with different versions of Python libraries, or even Python itself. Newer versions of libraries for one project can break compatibility in another project.
fr: Quel problème un environnement virtuel résout-il ? Plus vous avez de projets Python, plus il est probable que vous deviez travailler avec différentes versions des bibliothèques Python, voire de Python lui-même. Des versions plus récentes de bibliothèques pour un projet peuvent rompre la compatibilité dans un autre projet.
zh_cn: 虚拟环境解决了什么问题？你的 Python 项目越多，就越有可能需要使用不同版本的 Python 包，甚至 Python 本身。某个项目使用的新版本的库可能会破坏其他项目的兼容性。

source: Virtual environments are independent groups of Python libraries, one for each project. Packages installed for one project will not affect other projects or the operating system's packages.
fr: Les environnements virtuels sont des groupes indépendants de bibliothèques Python, un pour chaque projet. Les paquets installés pour un projet n'affecteront pas les autres projets ou les paquets du système d'exploitation.
zh_cn: 虚拟环境是 Python 库的独立集合，每一个项目对应一个虚拟环境。安装到某个项目的包不会影响其他项目或是操作系统层级的包。

source: Python comes bundled with the :mod:`venv` module to create virtual environments.
fr: Python est livré avec le module :mod:`venv` pour créer des environnements virtuels.
zh_cn: Python 自带的 :mod:`venv` 模块可以用来创建虚拟环境。

source: Create an environment
fr: Créer un environnement
zh_cn: 创建虚拟环境

source: Activate the environment
fr: Activez l'environnement
zh_cn: 激活虚拟环境

source: Before you work on your project, activate the corresponding environment:
fr: Avant de travailler sur votre projet, activez l'environnement correspondant :
zh_cn: 在开始动手做你的项目之前，先激活对应的虚拟环境：

source: Your shell prompt will change to show the name of the activated environment.
fr: L'invite du shell change pour afficher le nom de l'environnement activé.
zh_cn: 你的 shell 提示符现在会显示激活的虚拟环境名称。

source: Install Flask
fr: Installer Flask
zh_cn: 安装 Flask

source: Within the activated environment, use the following command to install Flask:
fr: Dans l'environnement activé, utilisez la commande suivante pour installer Flask :
zh_cn: 在激活的虚拟环境内，使用下面的命令安装 Flask：

source: Flask is now installed. Check out the :doc:`/quickstart` or go to the :doc:`Documentation Overview </index>`.
fr: Flask est maintenant installé. Consultez :doc:`/quickstart` ou allez sur :doc:`Documentation Overview </index>`.
zh_cn: Flask 现在已经安装好了。阅读 :doc:`/quickstart` 或是前往 :doc:`文档概览 </index>` 进一步了解 Flask。
