Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/quickstart.po
Languages: fr

source: Quickstart
fr: Bien débuter

source: Eager to get started? This page gives a good introduction to Flask. Follow :doc:`installation` to set up a project and install Flask first.
fr: Vous avez hâte de commencer ? Cette page donne une bonne introduction à Flask. Suivez :doc:`installation` pour mettre en place un projet et installer Flask.

source: A Minimal Application
fr: Une application minimale

source: A minimal Flask application looks something like this:
fr: Une application Flask minimale ressemble à quelque chose comme ceci :

source: So what did that code do?
fr: Alors, que fait ce code ?

source: First we imported the :class:`~flask.Flask` class. An instance of this class will be our WSGI application.
fr: D'abord nous avons importé la classe :class:`~flask.Flask`. Une instance de cette classe sera notre application WSGI.

source: Next we create an instance of this class. The first argument is the name of the application's module or package. ``__name__`` is a convenient shortcut for this that is appropriate for most cases. This is needed so that Flask knows where to look for resources such as templates and static files.
fr: Ensuite, nous créons une instance de cette classe. Le premier argument est le nom du module ou du paquet de l'application. ``__name__`` est un raccourci pratique qui est approprié pour la plupart des cas. Ceci est nécessaire pour que Flask sache où chercher les ressources telles que les modèles et les fichiers statiques.

source: We then use the :meth:`~flask.Flask.route` decorator to tell Flask what URL should trigger our function.
fr: Nous utilisons ensuite le décorateur :meth:`~flask.Flask.route` pour indiquer à Flask quelle URL doit déclencher notre fonction.

source: The function returns the message we want to display in the user's browser. The default content type is HTML, so HTML in the string will be rendered by the browser.
fr: Cette fonction renvoie le message que nous voulons afficher dans le navigateur de l'utilisateur. Le type de contenu par défaut est du HTML, donc le HTML dans la chaîne de caractères sera rendu par le navigateur.

source: Save it as :file:`hello.py` or something similar. Make sure to not call your application :file:`flask.py` because this would conflict with Flask itself.
fr: Enregistrez-le sous le nom de :file:`hello.py` ou quelque chose de similaire. Veillez à ne pas appeler votre application :file:`flask.py` car cela entrerait en conflit avec Flask lui-même.

source: Application Discovery Behavior
fr: Détection automatique de l'application

source: This launches a very simple builtin server, which is good enough for testing but probably not what you want to use in production. For deployment options see :doc:`deploying/index`.
fr: Ceci lance un serveur intégré très simple, qui est suffisant pour les tests mais probablement pas ce que vous voulez utiliser en production. Pour les options de déploiement, voir :doc:`deploying/index`.

source: Now head over to http://127.0.0.1:5000/, and you should see your hello world greeting.
fr: Maintenant, allez sur http://127.0.0.1:5000/, et vous devriez voir votre message d'accueil "Hello, World!".

source: Externally Visible Server
fr: Serveur visible de l'extérieur

source: If you run the server you will notice that the server is only accessible from your own computer, not from any other in the network. This is the default because in debugging mode a user of the application can execute arbitrary Python code on your computer.
fr: Si vous démarrez le serveur, vous remarquerez qu'il n'est accessible que depuis votre propre ordinateur, et non depuis un autre ordinateur du réseau. Il s'agit de la valeur par défaut car, en mode débogage, un utilisateur de l'application peut exécuter un code Python arbitraire sur votre ordinateur.

source: If you have the debugger disabled or trust the users on your network, you can make the server publicly available simply by adding ``--host=0.0.0.0`` to the command line::
fr: Si vous avez désactivé le débogueur ou si vous faites confiance aux utilisateurs de votre réseau, vous pouvez rendre le serveur accessible au public simplement en ajoutant ``--host=0.0.0.0`` à la ligne de commande :

source: This tells your operating system to listen on all public IPs.
fr: Cela indique à votre système d'exploitation d'écouter sur toutes les adresses IP publiques.

source: Debug Mode
fr: Mode débogage

source: The ``flask run`` command can do more than just start the development server. By enabling debug mode, the server will automatically reload if code changes, and will show an interactive debugger in the browser if an error occurs during a request.
fr: La commande ``flask run`` peut faire plus que simplement démarrer le serveur de développement. En activant le mode débogage, le serveur se rechargera automatiquement si le code change, et affichera un débogueur interactif dans le navigateur si une erreur se produit pendant une requête.

source: The interactive debugger in action.
fr: Le débogueur interactif en action.

source: The debugger allows executing arbitrary Python code from the browser. It is protected by a pin, but still represents a major security risk. Do not run the development server or debugger in a production environment.
fr: Le débogueur permet d'exécuter du code Python arbitraire depuis le navigateur. Il est protégé par un PIN, mais représente tout de même un risque de sécurité important. N'exécutez pas le serveur de développement ou le débogueur dans un environnement de production.

source: See also:
fr: Voir aussi:

source: :doc:`/debugging` for information about using the built-in debugger and other debuggers.
fr: :doc:`/debugging` pour plus d'informations sur l'utilisation du débogueur intégré et d'autres débogueurs.

source: :doc:`/logging` and :doc:`/errorhandling` to log errors and display nice error pages.
fr: :doc:`/logging` et :doc:`/errorhandling` pour enregistrer les erreurs et afficher de belles pages d'erreur.

source: HTML Escaping
fr: L'échappement HTML

source: When returning HTML (the default response type in Flask), any user-provided values rendered in the output must be escaped to protect from injection attacks. HTML templates rendered with Jinja, introduced later, will do this automatically.
fr: Lorsque vous renvoyez du HTML (le type de réponse par défaut dans Flask), toute valeur fournie par l'utilisateur et rendue dans la réponse doit être échappée pour se protéger des attaques par injection. Les modèles HTML rendus avec Jinja, introduits plus tard, le feront automatiquement.

source: :func:`~markupsafe.escape`, shown here, can be used manually. It is omitted in most examples for brevity, but you should always be aware of how you're using untrusted data.
fr: :func:`~markupsafe.escape`, montré ici, peut être utilisé manuellement. Il est omis dans la plupart des exemples pour des raisons de brièveté, mais vous devriez toujours être conscient de la façon dont vous utilisez les données non fiables.

source: If a user managed to submit the name ``<script>alert("bad")</script>``, escaping causes it to be rendered as text, rather than running the script in the user's browser.
fr: Si un utilisateur a réussi à soumettre le nom ``<script>alert("bad")</script>``, l'échappement fait en sorte qu'il soit rendu comme du texte, plutôt que d'exécuter le script dans le navigateur de l'utilisateur.

source: ``<name>`` in the route captures a value from the URL and passes it to the view function. These variable rules are explained below.
fr: ``<name>`` dans la route capture une valeur de l'URL et la passe à la fonction de vue. Ces règles de variables sont expliquées ci-dessous.

source: Routing
fr: Routage

source: Modern web applications use meaningful URLs to help users. Users are more likely to like a page and come back if the page uses a meaningful URL they can remember and use to directly visit a page.
fr: Les applications web modernes utilisent des URL significatives pour aider les utilisateurs. Les utilisateurs sont plus susceptibles d'aimer une page et de revenir si la page utilise une URL significative qu'ils peuvent mémoriser et utiliser pour visiter directement une page.

source: Use the :meth:`~flask.Flask.route` decorator to bind a function to a URL. ::
fr: Utilisez le décorateur :meth:`~flask.Flask.route` pour lier une fonction à une URL :

source: You can do more! You can make parts of the URL dynamic and attach multiple rules to a function.
fr: Vous pouvez faire plus ! Vous pouvez rendre certaines parties de l'URL dynamiques et attacher plusieurs règles à une fonction.

source: Variable Rules
fr: Règles variables

source: You can add variable sections to a URL by marking sections with ``<variable_name>``. Your function then receives the ``<variable_name>`` as a keyword argument. Optionally, you can use a converter to specify the type of the argument like ``<converter:variable_name>``. ::
fr: Vous pouvez ajouter des sections variables à une URL en marquant les sections avec ``<variable_name>``. Votre fonction reçoit alors ``<variable_name>`` comme un argument nommé. En option, vous pouvez utiliser un convertisseur pour spécifier le type de l'argument comme ``<converter:variable_name>`` :

source: Converter types:
fr: Types de convertisseurs :

source: (default) accepts any text without a slash
fr: (par défaut) accepte tout texte sans slash

source: accepts positive integers
fr: accepte les nombres entiers positifs

source: accepts positive floating point values
fr: accepte les valeurs positives à virgule flottante

source: like ``string`` but also accepts slashes
fr: comme ``string`` mais accepte aussi les slashs

source: accepts UUID strings
fr: accepte les chaînes UUID

source: Unique URLs / Redirection Behavior
fr: URLs uniques / Comportement de redirection

source: The following two rules differ in their use of a trailing slash. ::
fr: Les deux règles suivantes diffèrent par l'utilisation d'une barre oblique de fin de ligne :

source: The canonical URL for the ``projects`` endpoint has a trailing slash. It's similar to a folder in a file system. If you access the URL without a trailing slash (``/projects``), Flask redirects you to the canonical URL with the trailing slash (``/projects/``).
fr: L'URL canonique du point de terminaison ``projects`` comporte un slash de fin. C'est similaire à un dossier dans un système de fichiers. Si vous accédez à l'URL sans slash de fin (``/projets``), Flask vous redirige vers l'URL canonique avec le slash de fin (``/projets/``).

source: The canonical URL for the ``about`` endpoint does not have a trailing slash. It's similar to the pathname of a file. Accessing the URL with a trailing slash (``/about/``) produces a 404 "Not Found" error. This helps keep URLs unique for these resources, which helps search engines avoid indexing the same page twice.
fr: L'URL canonique du point de terminaison ``about`` ne comporte pas de barre oblique de fin de ligne. Elle est similaire au chemin d'accès d'un fichier. L'accès à l'URL avec un slash de fin (``/about/``) produit une erreur 404 "Not Found". Cela permet de conserver des URL uniques pour ces ressources, ce qui aide les moteurs de recherche à ne pas indexer deux fois la même page.

source: URL Building
fr: Création d'URL

source: To build a URL to a specific function, use the :func:`~flask.url_for` function. It accepts the name of the function as its first argument and any number of keyword arguments, each corresponding to a variable part of the URL rule. Unknown variable parts are appended to the URL as query parameters.
fr: Pour construire une URL vers une fonction spécifique, utilisez la fonction :func:`~flask.url_for`. Elle accepte le nom de la fonction comme premier argument et un nombre quelconque d'arguments nommés, chacun correspondant à une partie variable de l'URL. Les parties variables inconnues sont ajoutées à l'URL comme paramètres de requête.

source: Why would you want to build URLs using the URL reversing function :func:`~flask.url_for` instead of hard-coding them into your templates?
fr: Pourquoi voudriez-vous construire des URL en utilisant la fonction d'inversion d'URL :func:`~flask.url_for` au lieu de les coder en dur dans vos modèles ?

source: Reversing is often more descriptive than hard-coding the URLs.
fr: L'inversion est souvent plus descriptive que le codage en dur des URL.

source: You can change your URLs in one go instead of needing to remember to manually change hard-coded URLs.
fr: Vous pouvez modifier vos URL en une seule fois au lieu de devoir vous souvenir de modifier manuellement les URL codées en dur.

source: URL building handles escaping of special characters transparently.
fr: La construction d'URL gère l'échappement des caractères spéciaux de manière transparente.

source: The generated paths are always absolute, avoiding unexpected behavior of relative paths in browsers.
fr: Les chemins générés sont toujours absolus, ce qui évite le comportement inattendu des chemins relatifs dans les navigateurs.

source: If your application is placed outside the URL root, for example, in ``/myapplication`` instead of ``/``, :func:`~flask.url_for` properly handles that for you.
fr: Si votre application est placée en dehors de la racine de l'URL, par exemple, dans ``/myapplication`` au lieu de ``/``, :func:`~flask.url_for` gère cela correctement pour vous.

source: For example, here we use the :meth:`~flask.Flask.test_request_context` method to try out :func:`~flask.url_for`. :meth:`~flask.Flask.test_request_context` tells Flask to behave as though it's handling a request even while we use a Python shell. See :ref:`context-locals`.
fr: Par exemple, ici nous utilisons la méthode :meth:`~flask.Flask.test_request_context` pour essayer :func:`~flask.url_for`. :meth:`~flask.Flask.test_request_context` indique à Flask de se comporter comme s'il traitait une requête même si nous utilisons un shell Python. Voir :ref:`context-locals`.

source: HTTP Methods
fr: Méthodes HTTP

source: Web applications use different HTTP methods when accessing URLs. You should familiarize yourself with the HTTP methods as you work with Flask. By default, a route only answers to ``GET`` requests. You can use the ``methods`` argument of the :meth:`~flask.Flask.route` decorator to handle different HTTP methods. ::
fr: Les applications Web utilisent différentes méthodes HTTP pour accéder aux URL. Vous devez vous familiariser avec les méthodes HTTP lorsque vous travaillez avec Flask. Par défaut, une route ne répond qu'aux requêtes ``GET``. Vous pouvez utiliser l'argument ``methods`` du décorateur :meth:`~flask.Flask.route` pour gérer différentes méthodes HTTP. ::

source: If ``GET`` is present, Flask automatically adds support for the ``HEAD`` method and handles ``HEAD`` requests according to the `HTTP RFC`_. Likewise, ``OPTIONS`` is automatically implemented for you.
fr: Si ``GET`` est présent, Flask ajoute automatiquement le support de la méthode ``HEAD`` et traite les requêtes ``HEAD`` selon la `HTTP RFC`_. De même, ``OPTIONS`` est automatiquement implémenté pour vous.

source: Static Files
fr: Fichiers statiques

source: Dynamic web applications also need static files. That's usually where the CSS and JavaScript files are coming from. Ideally your web server is configured to serve them for you, but during development Flask can do that as well. Just create a folder called :file:`static` in your package or next to your module and it will be available at ``/static`` on the application.
fr: Les applications web dynamiques ont également besoin de fichiers statiques. C'est généralement de là que proviennent les fichiers CSS et JavaScript. Idéalement, votre serveur web est configuré pour les servir à votre place, mais pendant le développement, Flask peut aussi le faire. Il suffit de créer un dossier appelé :file:`static` dans votre pacquet ou à côté de votre module et il sera disponible à ``/static`` sur l'application.

source: To generate URLs for static files, use the special ``'static'`` endpoint name::
fr: Pour générer des URL pour les fichiers statiques, utilisez le nom de point de terminaison spécial ``'static'`` :

source: The file has to be stored on the filesystem as :file:`static/style.css`.
fr: Le fichier doit être stocké sur le système de fichiers sous le nom de :file:`static/style.css`.

source: Rendering Templates
fr: Modèles de rendu

source: Generating HTML from within Python is not fun, and actually pretty cumbersome because you have to do the HTML escaping on your own to keep the application secure. Because of that Flask configures the `Jinja2 <https://palletsprojects.com/p/jinja/>`_ template engine for you automatically.
fr: Générer du HTML à partir de Python n'est pas amusant, et en fait assez encombrant car vous devez faire l'échappement HTML par vous-même pour garder l'application sécurisée. C'est pourquoi Flask configure automatiquement le moteur de template `Jinja2 <https://palletsprojects.com/p/jinja/>`_ pour vous.

source: To render a template you can use the :func:`~flask.render_template` method. All you have to do is provide the name of the template and the variables you want to pass to the template engine as keyword arguments. Here's a simple example of how to render a template::
fr: Pour rendre un modèle, vous pouvez utiliser la méthode :func:`~flask.render_template`. Tout ce que vous avez à faire est de fournir le nom du modèle et les variables que vous voulez passer au moteur de modèle comme arguments nommés. Voici un exemple simple de la façon de rendre un modèle::

source: Flask will look for templates in the :file:`templates` folder. So if your application is a module, this folder is next to that module, if it's a package it's actually inside your package:
fr: Flask va chercher les modèles dans le dossier :file:`templates`. Donc si votre application est un module, ce dossier est à côté de ce module, si c'est un paquet, il est en fait à l'intérieur de votre paquet:

source: **Case 1**: a module::
fr: **Case 1** : un module::

source: **Case 2**: a package::
fr: **Cas 2** : un paquet::

source: For templates you can use the full power of Jinja2 templates. Head over to the official `Jinja2 Template Documentation <https://jinja.palletsprojects.com/templates/>`_ for more information.
fr: Pour les modèles, vous pouvez utiliser toute la puissance des modèles Jinja2. Rendez-vous sur le site officiel `Jinja2 Template Documentation <https://jinja.palletsprojects.com/templates/>`_ pour plus d'informations.

source: Here is an example template:
fr: Voici un exemple de modèle :

source: Inside templates you also have access to the :data:`~flask.Flask.config`, :class:`~flask.request`, :class:`~flask.session` and :class:`~flask.g` [#]_ objects as well as the :func:`~flask.url_for` and :func:`~flask.get_flashed_messages` functions.
fr: À l'intérieur des modèles, vous avez également accès aux objets :data:`~flask.Flask.config`, :class:`~flask.request`, :class:`~flask.session` et :class:`~flask.g` [#]_ ainsi qu'aux fonctions :func:`~flask.url_for` et :func:`~flask.get_flashed_messages`.

source: Templates are especially useful if inheritance is used. If you want to know how that works, see :doc:`patterns/templateinheritance`. Basically template inheritance makes it possible to keep certain elements on each page (like header, navigation and footer).
fr: Les modèles sont particulièrement utiles si l'on utilise l'héritage. Si vous voulez savoir comment cela fonctionne, consultez :doc:`patterns/templateinheritance`. En fait, l'héritage des modèles permet de conserver certains éléments sur chaque page (comme l'en-tête, la navigation et le pied de page).

source: Here is a basic introduction to how the :class:`~markupsafe.Markup` class works::
fr: Voici une introduction de base au fonctionnement de la classe :class:`~markupsafe.Markup`::

source: Autoescaping is no longer enabled for all templates. The following extensions for templates trigger autoescaping: ``.html``, ``.htm``, ``.xml``, ``.xhtml``. Templates loaded from a string will have autoescaping disabled.
fr: L'échappement automatique n'est plus activé pour tous les modèles. Les extensions suivantes pour les modèles déclenchent l'échappement automatique : ``.html``, ``.htm``, ``.xml``, ``.xhtml``. L'échappement automatique est désactivé pour les modèles chargés à partir d'une chaîne de caractères.

source: Unsure what that :class:`~flask.g` object is? It's something in which you can store information for your own needs. See the documentation for :class:`flask.g` and :doc:`patterns/sqlite3`.
fr: Vous ne savez pas ce qu'est l'objet :class:`~flask.g` ? C'est un objet dans lequel vous pouvez stocker des informations pour vos propres besoins. Consultez la documentation de :class:`flask.g` et de :doc:`patterns/sqlite3`.

source: Accessing Request Data
fr: Accès aux données de la requête

source: For web applications it's crucial to react to the data a client sends to the server. In Flask this information is provided by the global :class:`~flask.request` object. If you have some experience with Python you might be wondering how that object can be global and how Flask manages to still be threadsafe. The answer is context locals:
fr: Pour les applications web, il est crucial de réagir aux données qu'un client envoie au serveur. Dans Flask, ces informations sont fournies par l'objet global :class:`~flask.request`. Si vous avez une certaine expérience de Python, vous vous demandez peut-être comment cet objet peut être global et comment Flask parvient à rester threadsafe. La réponse est : les contextes locaux :

source: Context Locals
fr: Contextes locaux

source: Insider Information
fr: Informations pour les initiés

source: If you want to understand how that works and how you can implement tests with context locals, read this section, otherwise just skip it.
fr: Si vous voulez comprendre comment cela fonctionne et comment vous pouvez mettre en œuvre des tests avec des contextes locaux, lisez cette section, sinon passez-la.

source: Certain objects in Flask are global objects, but not of the usual kind. These objects are actually proxies to objects that are local to a specific context. What a mouthful. But that is actually quite easy to understand.
fr: Certains objets dans Flask sont des objets globaux, mais pas du genre habituel. Ces objets sont en fait des proxies d'objets qui sont locaux à un contexte spécifique. Quelle belle expression ! Mais c'est en fait assez facile à comprendre.

source: Imagine the context being the handling thread. A request comes in and the web server decides to spawn a new thread (or something else, the underlying object is capable of dealing with concurrency systems other than threads). When Flask starts its internal request handling it figures out that the current thread is the active context and binds the current application and the WSGI environments to that context (thread). It does that in an intelligent way so that one application can invoke another application without breaking.
fr: Imaginez que le contexte soit le thread de traitement. Une requête arrive et le serveur web décide de créer un nouveau thread (ou autre chose, l'objet sous-jacent est capable de gérer des systèmes de concurrence autres que les threads). Lorsque Flask démarre son traitement interne des demandes, il détermine que le thread actuel est le contexte actif et lie l'application actuelle et les environnements WSGI à ce contexte (thread). Il le fait de manière intelligente afin qu'une application puisse invoquer une autre application sans rupture.
