Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/quickstart.po
Languages: fr

source: So what does this mean to you? Basically you can completely ignore that this is the case unless you are doing something like unit testing. You will notice that code which depends on a request object will suddenly break because there is no request object. The solution is creating a request object yourself and binding it to the context. The easiest solution for unit testing is to use the :meth:`~flask.Flask.test_request_context` context manager. In combination with the ``with`` statement it will bind a test request so that you can interact with it. Here is an example::
fr: Qu'est-ce que cela signifie pour vous ? En fait, vous pouvez ignorer complètement que c'est le cas, à moins que vous ne fassiez des tests unitaires. Vous remarquerez que le code qui dépend d'un objet requête sera soudainement interrompu parce qu'il n'y a pas d'objet requête. La solution consiste à créer vous-même un objet requête et à le lier au contexte. La solution la plus simple pour les tests unitaires est d'utiliser le gestionnaire de contexte :meth:`~flask.Flask.test_request_context`. En combinaison avec l'instruction ``with``, il liera une requête de test afin que vous puissiez interagir avec elle. Voici un exemple :

source: The other possibility is passing a whole WSGI environment to the :meth:`~flask.Flask.request_context` method::
fr: L'autre possibilité est de passer un environnement WSGI entier à la méthode :meth:`~flask.Flask.request_context` :

source: The Request Object
fr: L'objet Requête

source: The request object is documented in the API section and we will not cover it here in detail (see :class:`~flask.Request`). Here is a broad overview of some of the most common operations. First of all you have to import it from the ``flask`` module::
fr: L'objet requête est documenté dans la section API et nous ne le couvrirons pas ici en détail (voir :class:`~flask.Request`). Voici une vue d'ensemble de certaines des opérations les plus courantes. Tout d'abord, vous devez l'importer depuis le module ``flask``: :

source: The current request method is available by using the :attr:`~flask.Request.method` attribute. To access form data (data transmitted in a ``POST`` or ``PUT`` request) you can use the :attr:`~flask.Request.form` attribute. Here is a full example of the two attributes mentioned above::
fr: La méthode de la requête actuelle est disponible en utilisant l'attribut :attr:`~flask.Request.method`. Pour accéder aux données de formulaire (données transmises dans une requête ``POST`` ou ``PUT``), vous pouvez utiliser l'attribut :attr:`~flask.Request.form`. Voici un exemple complet des deux attributs mentionnés ci-dessus : :

source: What happens if the key does not exist in the ``form`` attribute? In that case a special :exc:`KeyError` is raised. You can catch it like a standard :exc:`KeyError` but if you don't do that, a HTTP 400 Bad Request error page is shown instead. So for many situations you don't have to deal with that problem.
fr: Que se passe-t-il si la clé n'existe pas dans l'attribut ``form`` ? Dans ce cas, un :exc:`KeyError` spécial est généré. Vous pouvez l'attraper comme une :exc:`KeyError` standard mais si vous ne le faites pas, une page d'erreur HTTP 400 Bad Request est affichée à la place. Ainsi, dans de nombreuses situations, vous n'avez pas à faire face à ce problème.

source: To access parameters submitted in the URL (``?key=value``) you can use the :attr:`~flask.Request.args` attribute::
fr: Pour accéder aux paramètres soumis dans l'URL (``?key=value``), vous pouvez utiliser l'attribut :attr:`~flask.Request.args`: :

source: We recommend accessing URL parameters with `get` or by catching the :exc:`KeyError` because users might change the URL and presenting them a 400 bad request page in that case is not user friendly.
fr: Nous recommandons d'accéder aux paramètres de l'URL avec `get` ou en attrapant le :exc:`KeyError` car les utilisateurs peuvent changer l'URL et leur présenter une page 400 bad request dans ce cas n'est pas convivial.

source: For a full list of methods and attributes of the request object, head over to the :class:`~flask.Request` documentation.
fr: Pour une liste complète des méthodes et des attributs de l'objet requête, consultez la documentation de la :class:`~flask.Request`.

source: File Uploads
fr: Téléchargements de fichiers

source: You can handle uploaded files with Flask easily. Just make sure not to forget to set the ``enctype="multipart/form-data"`` attribute on your HTML form, otherwise the browser will not transmit your files at all.
fr: Vous pouvez gérer les fichiers téléchargés avec Flask facilement. Veillez simplement à ne pas oublier de définir l'attribut ``enctype="multipart/form-data"`` sur votre formulaire HTML, sinon le navigateur ne transmettra pas du tout vos fichiers.

source: Uploaded files are stored in memory or at a temporary location on the filesystem. You can access those files by looking at the :attr:`~flask.request.files` attribute on the request object. Each uploaded file is stored in that dictionary. It behaves just like a standard Python :class:`file` object, but it also has a :meth:`~werkzeug.datastructures.FileStorage.save` method that allows you to store that file on the filesystem of the server. Here is a simple example showing how that works::
fr: Les fichiers téléchargés sont stockés en mémoire ou dans un emplacement temporaire du système de fichiers. Vous pouvez accéder à ces fichiers en consultant l'attribut :attr:`~flask.request.files` de l'objet requête. Chaque fichier téléchargé est stocké dans ce dictionnaire. Il se comporte comme un objet Python standard :class:`file`, mais il possède également une méthode :meth:`~werkzeug.datastructures.FileStorage.save` qui vous permet de stocker ce fichier sur le système de fichiers du serveur. Voici un exemple simple montrant comment cela fonctionne :

source: If you want to know how the file was named on the client before it was uploaded to your application, you can access the :attr:`~werkzeug.datastructures.FileStorage.filename` attribute. However please keep in mind that this value can be forged so never ever trust that value. If you want to use the filename of the client to store the file on the server, pass it through the :func:`~werkzeug.utils.secure_filename` function that Werkzeug provides for you::
fr: Si vous voulez savoir comment le fichier a été nommé sur le client avant d'être téléchargé dans votre application, vous pouvez accéder à l'attribut :attr:`~werkzeug.datastructures.FileStorage.filename`. Cependant, gardez à l'esprit que cette valeur peut être falsifiée et que vous ne devez donc jamais vous y fier. Si vous voulez utiliser le nom de fichier du client pour stocker le fichier sur le serveur, passez-le par la fonction :func:`~werkzeug.utils.secure_filename` que Werkzeug vous fournit : :

source: For some better examples, see :doc:`patterns/fileuploads`.
fr: Pour de meilleurs exemples, voir :doc:`patterns/fileuploads`.

source: To access cookies you can use the :attr:`~flask.Request.cookies` attribute. To set cookies you can use the :attr:`~flask.Response.set_cookie` method of response objects. The :attr:`~flask.Request.cookies` attribute of request objects is a dictionary with all the cookies the client transmits. If you want to use sessions, do not use the cookies directly but instead use the :ref:`sessions` in Flask that add some security on top of cookies for you.
fr: Pour accéder aux cookies, vous pouvez utiliser l'attribut :attr:`~flask.Request.cookies`. Pour définir les cookies, vous pouvez utiliser la méthode :attr:`~flask.Response.set_cookie` des objets réponses. L'attribut :attr:`~flask.Request.cookies` des objets requêtes est un dictionnaire contenant tous les cookies que le client transmet. Si vous souhaitez utiliser des sessions, n'utilisez pas directement les cookies mais plutôt les :ref:`sessions` de Flask qui ajoutent une certaine sécurité en plus des cookies pour vous.

source: Reading cookies::
fr: Cookies de lecture :

source: Storing cookies::
fr: Stockage des cookies :

source: Note that cookies are set on response objects. Since you normally just return strings from the view functions Flask will convert them into response objects for you. If you explicitly want to do that you can use the :meth:`~flask.make_response` function and then modify it.
fr: Notez que les cookies sont définis sur les objets réponses. Puisque vous ne retournez normalement que des chaînes de caractères depuis les fonctions de vue, Flask les convertira en objets réponses pour vous. Si vous voulez explicitement faire cela, vous pouvez utiliser la fonction :meth:`~flask.make_response` et ensuite la modifier.

source: Sometimes you might want to set a cookie at a point where the response object does not exist yet. This is possible by utilizing the :doc:`patterns/deferredcallbacks` pattern.
fr: Parfois, vous pouvez vouloir définir un cookie à un moment où l'objet réponse n'existe pas encore. Cela est possible en utilisant le motif :doc:`patterns/deferredcallbacks`.

source: For this also see :ref:`about-responses`.
fr: Pour cela, voir également :ref:`about-responses`.

source: Redirects and Errors
fr: Redirections et erreurs

source: To redirect a user to another endpoint, use the :func:`~flask.redirect` function; to abort a request early with an error code, use the :func:`~flask.abort` function::
fr: Pour rediriger un utilisateur vers un autre point de terminaison, utilisez la fonction :func:`~flask.redirect` ; pour interrompre une requête prématurément avec un code d'erreur, utilisez la fonction :func:`~flask.abort`: :

source: This is a rather pointless example because a user will be redirected from the index to a page they cannot access (401 means access denied) but it shows how that works.
fr: Cet exemple est plutôt inutile car un utilisateur sera redirigé de l'index vers une page à laquelle il ne peut pas accéder (401 signifie accès refusé) mais il montre comment cela fonctionne.

source: By default a black and white error page is shown for each error code. If you want to customize the error page, you can use the :meth:`~flask.Flask.errorhandler` decorator::
fr: Par défaut, une page d'erreur en noir et blanc est affichée pour chaque code d'erreur. Si vous voulez personnaliser la page d'erreur, vous pouvez utiliser le décorateur :meth:`~flask.Flask.errorhandler`: :

source: Note the ``404`` after the :func:`~flask.render_template` call. This tells Flask that the status code of that page should be 404 which means not found. By default 200 is assumed which translates to: all went well.
fr: Notez le ``404`` après l'appel :func:`~flask.render_template`. Cela indique à Flask que le code d'état de cette page doit être 404, ce qui signifie non trouvé. Par défaut, 200 est supposé, ce qui signifie : tout s'est bien passé.

source: See :doc:`errorhandling` for more details.
fr: Voir :doc:`errorhandling` pour plus de détails.

source: About Responses
fr: A propos des réponses

source: If a response object of the correct type is returned it's directly returned from the view.
fr: Si un objet réponse du type correct est renvoyé, il est directement renvoyé depuis la vue.

source: If it's a string, a response object is created with that data and the default parameters.
fr: S'il s'agit d'une chaîne de caractères, un objet réponse est créé avec ces données et les paramètres par défaut.

source: If a tuple is returned the items in the tuple can provide extra information. Such tuples have to be in the form ``(response, status)``, ``(response, headers)``, or ``(response, status, headers)``. The ``status`` value will override the status code and ``headers`` can be a list or dictionary of additional header values.
fr: Si un tuple est retourné, les éléments du tuple peuvent fournir des informations supplémentaires. De tels tuples doivent être sous la forme ``(response, status)``, ``(response, headers)``, ou ``(response, status, headers)``. La valeur ``status`` remplacera le code d'état et ``headers`` peut être une liste ou un dictionnaire de valeurs d'en-tête supplémentaires.

source: If none of that works, Flask will assume the return value is a valid WSGI application and convert that into a response object.
fr: Si rien de tout cela ne fonctionne, Flask supposera que la valeur de retour est une application WSGI valide et la convertira en un objet réponse.

source: If you want to get hold of the resulting response object inside the view you can use the :func:`~flask.make_response` function.
fr: Si vous voulez mettre la main sur l'objet réponse résultant dans la vue, vous pouvez utiliser la fonction :func:`~flask.make_response`.

source: Imagine you have a view like this::
fr: Imaginez que vous ayez une vue comme celle-ci :

source: You just need to wrap the return expression with :func:`~flask.make_response` and get the response object to modify it, then return it::
fr: Vous devez juste envelopper l'expression de retour avec :func:`~flask.make_response` et récupérer l'objet réponse pour le modifier, puis le retourner :

source: APIs with JSON
fr: API avec JSON

source: In addition to the request object there is also a second object called :class:`~flask.session` which allows you to store information specific to a user from one request to the next. This is implemented on top of cookies for you and signs the cookies cryptographically. What this means is that the user could look at the contents of your cookie but not modify it, unless they know the secret key used for signing.
fr: En plus de l'objet requête, il existe un second objet appelé :class:`~flask.session` qui permet de stocker des informations spécifiques à un utilisateur d'une requête à l'autre. Cet objet est implémenté par-dessus les cookies et signe les cookies de manière cryptographique. Cela signifie que l'utilisateur peut regarder le contenu de votre cookie mais ne peut pas le modifier, sauf s'il connaît la clé secrète utilisée pour la signature.

source: In order to use sessions you have to set a secret key. Here is how sessions work::
fr: Pour utiliser les sessions, vous devez définir une clé secrète. Voici comment les sessions fonctionnent :

source: How to generate good secret keys
fr: Comment générer de bonnes clés secrètes

source: A secret key should be as random as possible. Your operating system has ways to generate pretty random data based on a cryptographic random generator. Use the following command to quickly generate a value for :attr:`Flask.secret_key` (or :data:`SECRET_KEY`)::
fr: Une clé secrète doit être aussi aléatoire que possible. Votre système d'exploitation a des moyens de générer des données plutôt aléatoires basées sur un générateur aléatoire cryptographique. Utilisez la commande suivante pour générer rapidement une valeur pour :attr:`Flask.secret_key` (ou :data:`SECRET_KEY`): :

source: A note on cookie-based sessions: Flask will take the values you put into the session object and serialize them into a cookie. If you are finding some values do not persist across requests, cookies are indeed enabled, and you are not getting a clear error message, check the size of the cookie in your page responses compared to the size supported by web browsers.
fr: Une note sur les sessions basées sur les cookies : Flask prendra les valeurs que vous mettez dans l'objet session et les sérialisera dans un cookie. Si vous constatez que certaines valeurs ne persistent pas entre les requêtes, que les cookies sont bien activés et que vous n'obtenez pas de message d'erreur clair, vérifiez la taille du cookie dans les réponses de votre page par rapport à la taille prise en charge par les navigateurs web.

source: Besides the default client-side based sessions, if you want to handle sessions on the server-side instead, there are several Flask extensions that support this.
fr: Outre les sessions côté client par défaut, si vous souhaitez gérer les sessions côté serveur, plusieurs extensions Flask le permettent.

source: Message Flashing
fr: Message flash

source: Good applications and user interfaces are all about feedback. If the user does not get enough feedback they will probably end up hating the application. Flask provides a really simple way to give feedback to a user with the flashing system. The flashing system basically makes it possible to record a message at the end of a request and access it on the next (and only the next) request. This is usually combined with a layout template to expose the message.
fr: Les applications et les interfaces utilisateur de qualité reposent sur le retour d'information. Si l'utilisateur n'a pas assez de retour, il finira probablement par détester l'application. Flask fournit un moyen très simple de donner un retour à un utilisateur avec le système de flash. Ce système permet essentiellement d'enregistrer un message à la fin d'une requête et d'y accéder lors de la prochaine requête (et seulement la prochaine). Il est généralement associé à un modèle de mise en page pour exposer le message.

source: To flash a message use the :func:`~flask.flash` method, to get hold of the messages you can use :func:`~flask.get_flashed_messages` which is also available in the templates. See :doc:`patterns/flashing` for a full example.
fr: Pour flasher un message, utilisez la méthode :func:`~flask.flash`, pour obtenir les messages, vous pouvez utiliser :func:`~flask.get_flashed_messages` qui est également disponible dans les modèles. Voir :doc:`patterns/flashing` pour un exemple complet.

source: Logging
fr: Journalisation

source: Sometimes you might be in a situation where you deal with data that should be correct, but actually is not. For example you may have some client-side code that sends an HTTP request to the server but it's obviously malformed. This might be caused by a user tampering with the data, or the client code failing. Most of the time it's okay to reply with ``400 Bad Request`` in that situation, but sometimes that won't do and the code has to continue working.
fr: Parfois, vous pouvez vous trouver dans une situation où vous traitez des données qui devraient être correctes, mais qui ne le sont pas. Par exemple, vous pouvez avoir un code côté client qui envoie une requête HTTP au serveur mais qui est manifestement mal formée. Cela peut être dû à un utilisateur qui modifie les données ou à une défaillance du code client. La plupart du temps, il est normal de répondre par "400 Bad Request" dans cette situation, mais parfois, cela ne suffit pas et le code doit continuer à fonctionner.

source: You may still want to log that something fishy happened. This is where loggers come in handy. As of Flask 0.3 a logger is preconfigured for you to use.
fr: Vous pouvez toujours vouloir enregistrer que quelque chose de louche s'est produit. C'est là que la journalisation est utile. Depuis Flask 0.3, un logger est préconfiguré pour que vous puissiez l'utiliser.

source: Here are some example log calls::
fr: Voici quelques exemples d'appels de journal::

source: The attached :attr:`~flask.Flask.logger` is a standard logging :class:`~logging.Logger`, so head over to the official :mod:`logging` docs for more information.
fr: Le :attr:`~flask.Flask.logger` attaché est un journal standard :class:`~logging.Logger`, donc allez voir la doc officielle :mod:`logging` pour plus d'informations.

source: See :doc:`errorhandling`.
fr: Voir :doc:`errorhandling`.

source: Hooking in WSGI Middleware
fr: Accrochage dans les intergiciels WSGI

source: To add WSGI middleware to your Flask application, wrap the application's ``wsgi_app`` attribute. For example, to apply Werkzeug's :class:`~werkzeug.middleware.proxy_fix.ProxyFix` middleware for running behind Nginx:
fr: Pour ajouter un intergiciel WSGI à votre application Flask, enveloppez l'attribut ``wsgi_app`` de l'application. Par exemple, pour appliquer le intergiciel :class:`~werkzeug.middleware.proxy_fix.ProxyFix` de Werkzeug pour fonctionner derrière Nginx :

source: Wrapping ``app.wsgi_app`` instead of ``app`` means that ``app`` still points at your Flask application, not at the middleware, so you can continue to use and configure ``app`` directly.
fr: Envelopper ``app.wsgi_app`` au lieu de ``app`` signifie que ``app`` pointe toujours vers votre application Flask, et non vers l'intergiciel, donc vous pouvez continuer à utiliser et configurer ``app`` directement.

source: Using Flask Extensions
fr: Utiliser les extensions Flask

source: Extensions are packages that help you accomplish common tasks. For example, Flask-SQLAlchemy provides SQLAlchemy support that makes it simple and easy to use with Flask.
fr: Les extensions sont des paquets qui vous aident à accomplir des tâches courantes. Par exemple, Flask-SQLAlchemy fournit le support de SQLAlchemy qui rend son utilisation simple et facile avec Flask.

source: For more on Flask extensions, see :doc:`extensions`.
fr: Pour en savoir plus sur les extensions Flask, consultez :doc:`extensions`.

source: Deploying to a Web Server
fr: Déploiement sur un serveur Web

source: Ready to deploy your new Flask app? See :doc:`deploying/index`.
fr: Prêt à déployer votre nouvelle application Flask ? Voir :doc:`deploying/index`.
