Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/templating.po
Languages: fr, zh_cn

source: Templates
fr: Modèles
zh_cn: 模板渲染

source: Flask leverages Jinja2 as its template engine. You are obviously free to use a different template engine, but you still have to install Jinja2 to run Flask itself. This requirement is necessary to enable rich extensions. An extension can depend on Jinja2 being present.
fr: Flask utilise Jinja2 comme moteur de modèles. Vous êtes évidemment libre d'utiliser un autre moteur de modèles, mais vous devez toujours installer Jinja2 pour faire fonctionner Flask lui-même. Cette exigence est nécessaire pour permettre des extensions riches. Une extension peut dépendre de la présence de Jinja2.
zh_cn: Flask 使用 Jinja2 作为默认的模板渲染引擎。你可以自由更换其他的模板渲染引擎，但是你必须安装 Jinja2 来运行 Flask 本身。这个要求对于实现丰富的扩展是必要的。因为有些扩展使用 Jinja2 来实现功能。

source: This section only gives a very quick introduction into how Jinja2 is integrated into Flask. If you want information on the template engine's syntax itself, head over to the official `Jinja2 Template Documentation <https://jinja.palletsprojects.com/templates/>`_ for more information.
fr: Cette section ne donne qu'une introduction très rapide sur la façon dont Jinja2 est intégré dans Flask. Si vous voulez des informations sur la syntaxe du moteur de modèles lui-même, rendez-vous sur le site officiel `Jinja2 Template Documentation <https://jinja.palletsprojects.com/templates/>`_ pour plus d'informations.
zh_cn: 本节只简要介绍了 Jinja2 是如何集成到Flask中的。如果你想知道有关 Jinja2 的更多语法，请访问官方的 `Jinja2 模板文档 <https://jinja.palletsprojects.com/templates/>`_ 来获取更多信息。

source: Jinja Setup
fr: Configuration de Jinja
zh_cn: Jinja 设置

source: Unless customized, Jinja2 is configured by Flask as follows:
fr: A moins d'être personnalisé, Jinja2 est configuré par Flask comme suit :
zh_cn: 除非被自定义，Jinja2 被 Flask 配置为以下内容

source: autoescaping is enabled for all strings when using :func:`~flask.templating.render_template_string`.
fr: L'auto-échappement est activé pour toutes les chaînes de caractères lors de l'utilisation de :func:`~flask.templating.render_template_string`.
zh_cn: 当使用 :func:`~flask.templating.render_template_string` 时，所有字符串会被自动转义。

source: a template has the ability to opt in/out autoescaping with the ``{% autoescape %}`` tag.
fr: Un modèle a la possibilité d'activer ou de désactiver l'auto-échappement à l'aide de la balise ``{% autoescape %}``.
zh_cn: 模板可以使用 ``{% autoescape %}`` 以选择是否使用自动转义。

source: Flask inserts a couple of global functions and helpers into the Jinja2 context, additionally to the values that are present by default.
fr: Flask insère quelques fonctions et aides globales dans le contexte Jinja2, en plus des valeurs présentes par défaut.
zh_cn: 除了默认值之外，Flask 还在 Jinja2 上下文中插入了一些全局函数和辅助函数。

source: Standard Context
fr: Contexte standard
zh_cn: 标准上下文

source: The following global variables are available within Jinja2 templates by default:
fr: Les variables globales suivantes sont disponibles par défaut dans les modèles Jinja2 :
zh_cn: 默认情况下，以下全局变量在 Jinja2 模板中可用：

source: The current configuration object (:data:`flask.Flask.config`)
fr: L'objet de configuration actuel (:data:`flask.Flask.config`)
zh_cn: 当前配置对象（:data:`flask.Flask.config`）

source: This is now always available, even in imported templates.
fr: Cette fonction est désormais toujours disponible, même dans les modèles importés.
zh_cn: 即使是在导入的模板中，这些也始终可用。

source: The current request object (:class:`flask.request`). This variable is unavailable if the template was rendered without an active request context.
fr: L'objet de requête actuel (:class:`flask.request`). Cette variable n'est pas disponible si le modèle a été rendu sans contexte de requête actif.
zh_cn: 当前请求对象（:class:`flask.request`）。如果模板在没有激活请求上下文的情况下被渲染，则此变量不可用。

source: The current session object (:class:`flask.session`). This variable is unavailable if the template was rendered without an active request context.
fr: L'objet de session actuel (:class:`flask.session`). Cette variable n'est pas disponible si le modèle a été rendu sans contexte de requête actif.
zh_cn: 当前会话对象（:class:`flask.session`）。如果模板在没有激活请求上下文的情况下被渲染，则此变量不可用。

source: The request-bound object for global variables (:data:`flask.g`). This variable is unavailable if the template was rendered without an active request context.
fr: L'objet lié à la requête pour les variables globales (:data:`flask.g`). Cette variable n'est pas disponible si le modèle a été rendu sans contexte de requête actif.
zh_cn: 请求绑定全局变量（:data:`flask.g`）。如果模板在没有激活请求上下文的情况下被渲染，则此变量不可用。

source: The :func:`flask.url_for` function.
fr: La fonction :func:`flask.url_for`.
zh_cn: :func:`flask.url_for` 函数。

source: The :func:`flask.get_flashed_messages` function.
fr: La fonction :func:`flask.get_flashed_messages`.
zh_cn: :func:`flask.get_flashed_messages` 函数

source: The Jinja Context Behavior
fr: Le comportement du contexte Jinja
zh_cn: Jinja 上下文控制

source: These variables are added to the context of variables, they are not global variables. The difference is that by default these will not show up in the context of imported templates. This is partially caused by performance considerations, partially to keep things explicit.
fr: Ces variables sont ajoutées au contexte des variables, ce ne sont pas des variables globales. La différence est que par défaut, elles n'apparaîtront pas dans le contexte des modèles importés. Ceci est en partie dû à des considérations de performance, et en partie pour garder les choses explicites.
zh_cn: 这些变量被添加到变量的上下文中，它们不是全局变量。不同之处在于，默认情况下，这些不会出现在导入模板的上下文中。这样做一部分是由于性能方面的考虑，另一部分是为了保持显式。

source: What does this mean for you? If you have a macro you want to import, that needs to access the request object you have two possibilities:
fr: Qu'est-ce que cela signifie pour vous ? Si vous voulez importer une macro qui doit accéder à l'objet de requête, vous avez deux possibilités :
zh_cn: 这对你来说意味着什么？如果你有一个要导入的宏，需要访问请求对象，则有两种可能性：

source: you explicitly pass the request to the macro as parameter, or the attribute of the request object you are interested in.
fr: vous passez explicitement la requête à la macro en tant que paramètre, ou l'attribut de l'objet de la requête qui vous intéresse.
zh_cn: 显式地将请求作为参数或感兴趣的请求对象的属性传递给宏。

source: you import the macro "with context".
fr: vous importez la macro "avec le contexte".
zh_cn: 导入宏并“携带上下文”.

source: Importing with context looks like this:
fr: L'importation avec le contexte ressemble à ceci :
zh_cn: 像下面这样导入上下文：

source: Controlling Autoescaping
fr: Contrôle de l'auto-échappement
zh_cn: 自动转义控制

source: Autoescaping is the concept of automatically escaping special characters for you. Special characters in the sense of HTML (or XML, and thus XHTML) are ``&``, ``>``, ``<``, ``"`` as well as ``'``. Because these characters carry specific meanings in documents on their own you have to replace them by so called "entities" if you want to use them for text. Not doing so would not only cause user frustration by the inability to use these characters in text, but can also lead to security problems. (see :ref:`security-xss`)
fr: L'auto-échappement est le concept d'échappement automatique des caractères spéciaux pour vous. Les caractères spéciaux au sens de HTML (ou XML, et donc XHTML) sont ``&``, ``>``, ``<``, ``"`` ainsi que ``'``. Comme ces caractères ont des significations spécifiques dans les documents, vous devez les remplacer par des "entités" si vous voulez les utiliser pour le texte. Ne pas le faire ne causerait pas seulement la frustration des utilisateurs par l'impossibilité d'utiliser ces caractères dans le texte, mais peut également conduire à des problèmes de sécurité. (voir :ref:`security-xss`)
zh_cn: 自动转义是指为你自动转义特殊字符。HTML（或 XML，以及 XHTML）意义上的特殊字符是 ``&``，``>``，``<``，``"`` 以及 ``'``。因为这些字符在文档中本身就有特定的含义，如果你想在文本中使用它们，你就必须用所谓的“实体”来代替它们。不这样做不仅会让用户因为无法在文本中用这些字符而感到沮丧，还会导致安全问题。（请参阅 :ref:`security-xss`）

source: Sometimes however you will need to disable autoescaping in templates. This can be the case if you want to explicitly inject HTML into pages, for example if they come from a system that generates secure HTML like a markdown to HTML converter.
fr: Parfois, cependant, vous devrez désactiver l'auto-échappement dans les modèles. Cela peut être le cas si vous voulez injecter explicitement du HTML dans les pages, par exemple si elles proviennent d'un système qui génère du HTML sécurisé comme un convertisseur markdown vers HTML.
zh_cn: 但是，有时你需要在模板中禁用自动转义。如果你想将 HTML 显式地注入页面，例如，如果它们来自生成安全 HTML 的系统（如 markdown 到 HTML 转换器），则可能会出现这种情况。

source: There are three ways to accomplish that:
fr: Il y a trois façons d'y parvenir :
zh_cn: 有三种方法可以做到这一点：

source: Inside the template, use the ``|safe`` filter to explicitly mark a string as safe HTML (``{{ myvariable|safe }}``)
fr: À l'intérieur du modèle, utilisez le filtre ``|safe`` pour marquer explicitement une chaîne comme étant du HTML sûr (``{{monvariable|safe }}``)
zh_cn: 在模板中，使用 ``|safe`` 筛选器将字符串显式标记为安全 HTML（``{{ myvariable|safe }}``）

source: Temporarily disable the autoescape system altogether.
fr: Désactiver temporairement le système d'auto-échappement.
zh_cn: 暂时完全禁用自动转义系统。

source: To disable the autoescape system in templates, you can use the ``{% autoescape %}`` block:
fr: Pour désactiver le système d'auto-échappement dans les modèles, vous pouvez utiliser le bloc ``{% autoescape %}`` :
zh_cn: 要禁用模板中的自动转义系统，可以使用 ``{% autoescape %}`` 块：

source: Whenever you do this, please be very cautious about the variables you are using in this block.
fr: Si vous le faites, soyez très prudent quant aux variables que vous utilisez dans ce bloc.
zh_cn: 每当你这样做的时候，请对你在这个块中使用的变量非常谨慎。

source: Registering Filters
fr: Enregistrement des filtres
zh_cn: 注册筛选器

source: If you want to register your own filters in Jinja2 you have two ways to do that. You can either put them by hand into the :attr:`~flask.Flask.jinja_env` of the application or use the :meth:`~flask.Flask.template_filter` decorator.
fr: Si vous voulez enregistrer vos propres filtres dans Jinja2, vous avez deux façons de le faire. Vous pouvez soit les mettre à la main dans le :attr:`~flask.Flask.jinja_env` de l'application, soit utiliser le décorateur :meth:`~flask.Flask.template_filter`.
zh_cn: 如果你想在 Jinja2 中注册你自己的过滤器，你有两种方法。你可以手动将它们放入应用程序的 :attr:`~flask.flask.jinja_env` 中，也可以使用 :meth:`~flask.flask.template_filter` 装饰器。

source: The two following examples work the same and both reverse an object::
fr: Les deux exemples suivants fonctionnent de la même manière et inversent tous deux un objet :
zh_cn: 以下两个示例的工作原理相同，都反转了一个对象：

source: In case of the decorator the argument is optional if you want to use the function name as name of the filter. Once registered, you can use the filter in your templates in the same way as Jinja2's builtin filters, for example if you have a Python list in context called `mylist`::
fr: Dans le cas du décorateur, l'argument est optionnel si vous voulez utiliser le nom de la fonction comme nom du filtre. Une fois enregistré, vous pouvez utiliser le filtre dans vos modèles de la même manière que les filtres intégrés de Jinja2, par exemple si vous avez une liste Python dans le contexte appelé `mylist` :
zh_cn: 在使用装饰器的情况下，如果你想使用函数名作为过滤器的名称，那么参数是可选的。注册后，你可以在模板中使用与 Jinja2 内置过滤器相同的过滤器，例如，如果你在上下文中有一个名为 `mylist` 的 Python 列表：

source: Context Processors
fr: Processeurs de contexte
zh_cn: 上下文处理器

source: To inject new variables automatically into the context of a template, context processors exist in Flask. Context processors run before the template is rendered and have the ability to inject new values into the template context. A context processor is a function that returns a dictionary. The keys and values of this dictionary are then merged with the template context, for all templates in the app::
fr: Pour injecter automatiquement de nouvelles variables dans le contexte d'un modèle, il existe des processeurs de contexte dans Flask. Les processeurs de contexte s'exécutent avant que le modèle ne soit rendu et ont la capacité d'injecter de nouvelles valeurs dans le contexte du modèle. Un processeur de contexte est une fonction qui renvoie un dictionnaire. Les clés et les valeurs de ce dictionnaire sont ensuite fusionnées avec le contexte du modèle, pour tous les modèles de l'application :
zh_cn: Flask 中的上下文处理器可以将新变量自动注入到模板的上下文中。上下文处理器在渲染模板之前运行，并且能够将新值注入到模板上下文中。上下文处理器是一个返回字典的函数。此字典的键和值将与应用程序中所有模板的模板上下文合并：

source: The context processor above makes a variable called `user` available in the template with the value of `g.user`. This example is not very interesting because `g` is available in templates anyways, but it gives an idea how this works.
fr: Le processeur de contexte ci-dessus retourne une variable appelée `user` disponible dans le modèle avec la valeur de `g.user`. Cet exemple n'est pas très intéressant car `g` est disponible dans les modèles de toute façon, mais il donne une idée de comment cela fonctionne.
zh_cn: 上面的上下文处理器使一个名为 `user` 的变量在模板中可用，值为 `g.user`。这个例子不是很有趣，因为 `g` 在模板中无论如何都是可用的，但它给出了一个如何工作的想法。

source: Variables are not limited to values; a context processor can also make functions available to templates (since Python allows passing around functions)::
fr: Les variables ne sont pas limitées aux valeurs ; un processeur de contexte peut également mettre des fonctions à la disposition des modèles (puisque Python permet de passer des fonctions en arguments) :
zh_cn: 变量不限于值；上下文处理器还可以使函数可用于模板（因为 Python 允许传递函数）：

source: The context processor above makes the `format_price` function available to all templates::
fr: Le processeur de contexte ci-dessus retourne la fonction `format_price` disponible pour tous les modèles :
zh_cn: 上面的上下文处理器使 `format_price` 函数可用于所有模板：

source: You could also build `format_price` as a template filter (see :ref:`registering-filters`), but this demonstrates how to pass functions in a context processor.
fr: Vous pourriez aussi construire `format_price` comme un filtre de modèle (voir :ref:`registering-filters`), mais ceci démontre comment passer des fonctions dans un processeur de contexte.
zh_cn: 你也可以将 `format_price` 构建为模板过滤器（请参阅 :ref:`registering-filters`），但这演示了如何在上下文处理器中传递函数。
