Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/patterns/celery.po
Languages: es

source: Background Tasks with Celery
es: Tareas en segundo plano con Celery

source: If your application has a long running task, such as processing some uploaded data or sending email, you don't want to wait for it to finish during a request. Instead, use a task queue to send the necessary data to another process that will run the task in the background while the request returns immediately.
es: Si su aplicación tiene una tarea de larga duración, como el procesamiento de algunos datos cargados o el envío de correo electrónico, no querrá esperar a que termine durante una solicitud. En su lugar, utilice una cola de tareas para enviar los datos necesarios a otro proceso que ejecutará la tarea en segundo plano mientras la solicitud vuelve inmediatamente.

source: `Celery`_ is a powerful task queue that can be used for simple background tasks as well as complex multi-stage programs and schedules. This guide will show you how to configure Celery using Flask. Read Celery's `First Steps with Celery`_ guide to learn how to use Celery itself.
es: `Celery`_ es una potente cola de tareas que se puede utilizar tanto para tareas simples en segundo plano como para complejos programas y planificaciones multietapa. Esta guía te mostrará cómo configurar Celery utilizando Flask. Lea la guía de Celery `Primeros pasos con Celery`_ para aprender a utilizar Celery.

source: The Flask repository contains `an example <https://github.com/pallets/flask/tree/main/examples/celery>`_ based on the information on this page, which also shows how to use JavaScript to submit tasks and poll for progress and results.
es: El repositorio de Flask contiene `un ejemplo <https://github.com/pallets/flask/tree/main/examples/celery>`_ basado en la información de esta pagina, que también muestra cómo utilizar JavaScript para enviar tareas y sondear el progreso y los resultados.

source: Install
es: Instalar

source: Install Celery from PyPI, for example using pip:
es: Instala Celery desde PyPI, por ejemplo utilizando pip:

source: Integrate Celery with Flask
es: Integra Celery con Flask

source: You can use Celery without any integration with Flask, but it's convenient to configure it through Flask's config, and to let tasks access the Flask application.
es: Puedes usar Celery sin ninguna integración con Flask, pero es conveniente configurarlo a través de la configuración de Flask, y dejar que las tareas accedan a la aplicación de Flask.

source: Celery uses similar ideas to Flask, with a ``Celery`` app object that has configuration and registers tasks. While creating a Flask app, use the following code to create and configure a Celery app as well.
es: Celery utiliza ideas similares a Flask, con un objeto de aplicación ``Celery`` que tiene tareas de configuración y registro. Mientras creas una app Flask, utiliza el siguiente código para crear y configurar también una app Celery.

source: This creates and returns a ``Celery`` app object. Celery `configuration`_ is taken from the ``CELERY`` key in the Flask configuration. The Celery app is set as the default, so that it is seen during each request. The ``Task`` subclass automatically runs task functions with a Flask app context active, so that services like your database connections are available.
es: Esto crea y devuelve un objeto de aplicación ``Celery``. Celery `configuration`_ se toma de la llave ``CELERY`` en la configuración de Flask. La aplicación Celery se establece por defecto, de forma que se vea durante cada petición. La subclase ``Task`` ejecuta automáticamente funciones de tarea con un contexto de aplicación Flask activo, para que los servicios como las conexiones a bases de datos estén disponibles.

source: Here's a basic ``example.py`` that configures Celery to use Redis for communication. We enable a result backend, but ignore results by default. This allows us to store results only for tasks where we care about the result.
es: Aquí hay un ``example.py`` básico que configura Celery para usar Redis para la comunicación. Habilitamos un backend de resultados, pero ignoramos los resultados por defecto. Esto nos permite almacenar los resultados sólo para las tareas en las que nos importa el resultado.

source: Point the ``celery worker`` command at this and it will find the ``celery_app`` object.
es: Apunta el comando ``celery worker`` a esto y encontrará el objeto ``celery_app``.

source: You can also run the ``celery beat`` command to run tasks on a schedule. See Celery's docs for more information about defining schedules.
es: También puedes ejecutar el comando ``celery beat`` para ejecutar tareas de forma programada. Consulta la documentación de Celery para obtener más información acerca de la definición de horarios.

source: Application Factory
es: Fábrica de aplicaciones

source: When using the Flask application factory pattern, call the ``celery_init_app`` function inside the factory. It sets ``app.extensions["celery"]`` to the Celery app object, which can be used to get the Celery app from the Flask app returned by the factory.
es: Cuando uses el patrón de fábrica de aplicaciones Flask, llama a la función ``celery_init_app`` dentro de la fábrica. Establece ``app.extensions["celery"]`` al objeto de la aplicación Celery, que se puede utilizar para obtener la aplicación Celery de la aplicación Flask devuelta por la fábrica.

source: To use ``celery`` commands, Celery needs an app object, but that's no longer directly available. Create a ``make_celery.py`` file that calls the Flask app factory and gets the Celery app from the returned Flask app.
es: Para usar los comandos ``celery``, Celery necesita un objeto app, pero eso ya no está disponible directamente. Crea un archivo ``make_celery.py`` que llame a la fábrica de aplicaciones Flask y obtenga la aplicación Celery de la aplicación Flask devuelta.

source: Point the ``celery`` command to this file.
es: Apunta el comando ``celery`` a este archivo.

source: Defining Tasks
es: Definición de Tareas

source: Using ``@celery_app.task`` to decorate task functions requires access to the ``celery_app`` object, which won't be available when using the factory pattern. It also means that the decorated tasks are tied to the specific Flask and Celery app instances, which could be an issue during testing if you change configuration for a test.
es: El uso de ``@celery_app.task`` para decorar funciones de tareas requiere el acceso al objeto ``celery_app``, que no estará disponible cuando se utiliza el patrón de fábrica. También significa que las tareas decoradas están vinculadas a las instancias específicas de Flask y Celery app, lo que podría ser un problema durante las pruebas si se cambia la configuración para una prueba.

source: Instead, use Celery's ``@shared_task`` decorator. This creates task objects that will access whatever the "current app" is, which is a similar concept to Flask's blueprints and app context. This is why we called ``celery_app.set_default()`` above.
es: En su lugar, utiliza el decorador ``@shared_task`` de Celery. Esto crea objetos de tarea que accederán a cualquiera que sea la "aplicación actual", que es un concepto similar a blueprint de Flask y el contexto de la aplicación. Esta es la razón por la que llamamos ``celery_app.set_default()`` arriba.

source: Here's an example task that adds two numbers together and returns the result.
es: Aquí hay una tarea de ejemplo que suma dos números y devuelve el resultado.

source: Earlier, we configured Celery to ignore task results by default. Since we want to know the return value of this task, we set ``ignore_result=False``. On the other hand, a task that didn't need a result, such as sending an email, wouldn't set this.
es: Anteriormente, hemos configurado Celery para ignorar los resultados de la tarea por defecto. Como queremos conocer el valor de retorno de esta tarea, configuramos ``ignore_result=False``. Por otra parte, una tarea que no necesita un resultado, como el envío de un correo electrónico, no requiere esto.

source: Calling Tasks
es: Llamada a Tareas

source: The decorated function becomes a task object with methods to call it in the background. The simplest way is to use the ``delay(*args, **kwargs)`` method. See Celery's docs for more methods.
es: La función decorada se convierte en un objeto tarea con métodos para llamarla en segundo plano. La forma más sencilla es utilizar el método ``delay(*args, **kwargs)``. Ve la documentación de Celery para más métodos.

source: A Celery worker must be running to run the task. Starting a worker is shown in the previous sections.
es: Un Celery worker debe estar en ejecución para ejecutar la tarea. El inicio de un worker se muestra en las secciones anteriores.

source: The route doesn't get the task's result immediately. That would defeat the purpose by blocking the response. Instead, we return the running task's result id, which we can use later to get the result.
es: La ruta no obtiene el resultado de la tarea de inmediato. Eso iría en contra del objetivo al bloquear la respuesta. En su lugar, devolvemos el id de resultado de la tarea en ejecución, que podemos utilizar más tarde para obtener el resultado.

source: Getting Results
es: Obtener Resultados

source: To fetch the result of the task we started above, we'll add another route that takes the result id we returned before. We return whether the task is finished (ready), whether it finished successfully, and what the return value (or error) was if it is finished.
es: Para obtener el resultado de la tarea que iniciamos anteriormente, añadiremos otra ruta que toma el identificador de resultado que devolvimos antes. Devolvemos si la tarea está terminada (lista), si terminó con éxito, y cuál fue el valor de retorno (o error) si está terminada.

source: Now you can start the task using the first route, then poll for the result using the second route. This keeps the Flask request workers from being blocked waiting for tasks to finish.
es: Ahora puede iniciar la tarea utilizando la primera ruta, y luego sondear el resultado utilizando la segunda ruta. Esto evita que los request workers de Flask se bloqueen esperando a que las tareas terminen.

source: The Flask repository contains `an example <https://github.com/pallets/flask/tree/main/examples/celery>`_ using JavaScript to submit tasks and poll for progress and results.
es: El repositorio de Flask contiene `un ejemplo <https://github.com/pallets/flask/tree/main/examples/celery>`_ usando JavaScript para enviar tareas y sondear el progreso y los resultados.

source: Passing Data to Tasks
es: Pasar datos a las tareas

source: The "add" task above took two integers as arguments. To pass arguments to tasks, Celery has to serialize them to a format that it can pass to other processes. Therefore, passing complex objects is not recommended. For example, it would be impossible to pass a SQLAlchemy model object, since that object is probably not serializable and is tied to the session that queried it.
es: La tarea "add" anterior tomó dos enteros como argumentos. Para pasar argumentos a las tareas, Celery tiene que serializarlos a un formato que pueda pasar a otros procesos. Por lo tanto, no se recomienda pasar objetos complejos. Por ejemplo, sería imposible pasar un objeto modelo SQLAlchemy, ya que ese objeto probablemente no es serializable y está ligado a la sesión que lo consultó.

source: Pass the minimal amount of data necessary to fetch or recreate any complex data within the task. Consider a task that will run when the logged in user asks for an archive of their data. The Flask request knows the logged in user, and has the user object queried from the database. It got that by querying the database for a given id, so the task can do the same thing. Pass the user's id rather than the user object.
es: Pase la cantidad mínima de datos necesaria para obtener o recrear cualquier dato complejo dentro de la tarea. Consideremos una tarea que se ejecutará cuando el usuario conectado solicite un archivo de sus datos. La petición de Flask conoce el usuario conectado, y tiene el objeto usuario consultado desde la base de datos. Para ello, consulta la base de datos con un identificador determinado, por lo que la tarea puede hacer lo mismo. Pasa el id del usuario en lugar del objeto usuario.
