Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/tutorial/database.po
Languages: fr, per, zh_cn

source: Define and Access the Database
fr: Définir et accéder à la base de données
per: تعریف و دسترسی به دیتا بیس
zh_cn: 定义并访问数据库

source: The application will use a `SQLite`_ database to store users and posts. Python comes with built-in support for SQLite in the :mod:`sqlite3` module.
fr: L'application utilisera une base de données `SQLite`_ pour stocker les utilisateurs et les messages. Python offre un support intégré pour SQLite dans le module :mod:`sqlite3`.
per: این برنامه میخواهد از دیتا بیس `SQLite`_ انبار کردن کاربران و پست ها استفاده کند. پایتون با پشتیبانی داخلی از SQLite در ماژول :mod:`sqlite3` آمده است.
zh_cn: 这个应用将会使用 `SQLite`_ 数据库来存储用户和帖子。Python 在自带的 :mod:`sqlite3` 模块内置了对 SQLite 的支持。

source: SQLite is convenient because it doesn't require setting up a separate database server and is built-in to Python. However, if concurrent requests try to write to the database at the same time, they will slow down as each write happens sequentially. Small applications won't notice this. Once you become big, you may want to switch to a different database.
fr: SQLite est pratique car il ne nécessite pas la mise en place d'un serveur de base de données distinct et est intégré à Python. Cependant, si des requêtes SQL concurrentes essaient d'écrire en même temps dans la base de données, elles ralentiront car chaque écriture se fait de manière séquentielle. Les petites applications ne le remarqueront pas. Une fois que vous aurez atteint une certaine taille, vous voudrez peut-être passer à une autre base de données.
per: SQLite راحت است زیرا هیچ الزامی برای راه‌اندازی جداگانه سرور ندارد و همچنین به صورت داخلی در پایتون قرار دارد. با این حال اگر چند درخواست همزمان بخواهند، به صورت همزمان در دیتا بیس داده بنویسند، سرعت بسیار کاهش میابد. البته این کاهش سرعت در برنامه های کوچک محسوس نیست. هنگامی که بزرگ شدید، شاید بخواهید از دیتا بیس دیگری استفاده کنید.
zh_cn: SQLite 很方便，因为它不需要设置一个额外的数据库服务器，而且 Python 内置了对它的支持。然而，如果并发的请求试图同时写入数据库，它们会让应用变慢，因为每一个写入操作会依次进行。小的应用不会注意到这一点。当你的应用变大，你也许想要切换到不同的数据库。

source: The tutorial doesn't go into detail about SQL. If you are not familiar with it, the SQLite docs describe the `language`_.
fr: Le tutoriel n'entre pas dans les détails de SQL. Si vous n'êtes pas familier avec ce langage, les documents de SQLite décrivent le `language`_.
per: این آموزش درباره SQL نیست. اگر شما به این آشنا نیستید، مستندات SQLite در `language`_ شرح داده شده است.
zh_cn: 这个教程没有详细介绍 SQL。如果你对它不熟悉，SQLite 文档描述了 `这个语言`_。

source: Connect to the Database
fr: Connectez-vous à la base de données
per: اتصال به دیتابیس
zh_cn: 连接数据库

source: The first thing to do when working with a SQLite database (and most other Python database libraries) is to create a connection to it. Any queries and operations are performed using the connection, which is closed after the work is finished.
fr: La première chose à faire lorsqu'on travaille avec une base de données SQLite (et la plupart des autres bibliothèques de bases de données Python) est de créer une connexion à celle-ci. Toutes les requêtes et opérations SQL sont effectuées en utilisant cette connexion, qui est fermée une fois le travail terminé.
per: اولین چیز این است که کجا با دیتا بیس SQLite (و سایر کتابخانه های دیتا بیس پایتون) یک اتصال بسازید؛ اکثر کوئری ها و عملیات ها در پلتفرم با استفاده از اتصال انجام میشوند و پس از اتمام کار بسته میشوند.
zh_cn: 使用 SQLite 数据库（和其他大多数 Python 数据库包）时，要做的第一件事是和它建立一个连接。任何查询和操作都使用这个连接进行，当工作完成后它会被关闭。

source: In web applications this connection is typically tied to the request. It is created at some point when handling a request, and closed before the response is sent.
fr: Dans les applications Web, cette connexion est généralement liée à la requête HTTP en cours. Elle est créée à un moment donné lors du traitement d'une requête HTTP, et fermée avant l'envoi de la réponse.
per: در برنامه های وب، این اتصال معمولا به درخواست مرتبط است. این اتصال در زمان رسیدگی به درخواست ایجاد میشود و قبل از ارسال پاسخ، بسته می شود.
zh_cn: 在 web 应用中，这个连接通常会绑定到请求上。它会在处理一个请求时被创建，然后在响应发送之前被关闭。

source: :data:`g` is a special object that is unique for each request. It is used to store data that might be accessed by multiple functions during the request. The connection is stored and reused instead of creating a new connection if ``get_db`` is called a second time in the same request.
fr: :data:`g` est un objet spécial qui est unique pour chaque requête HTTP. Il est utilisé pour stocker les données qui pourraient être accédées par plusieurs fonctions au cours de la requête. La connexion est stockée et réutilisée au lieu de créer une nouvelle connexion si ``get_db`` est appelé une seconde fois dans la même requête.
per: :data:`g` یک شی خاص است که برای هر درخواست، منحصر بفرد است. برای ذخیره داده هایی استفاده میشود که ممکن است توسط چندین تابع در طول درخواست قابل دسترسی باشد. اگر ``get_db`` برای بار دوم در آن درخواست، فراخوانی شود، به جای ایجاد یک اتصال جدید، اتصال ذخیره و دوباره استفاده می شود.
zh_cn: :data:`g` 是一个特殊的对象，它对每一个请求都是唯一的。它被用来存储在处理请求时可能会被多个函数访问的数据。如果 ``get_db`` 在同一个请求中被二次调用，该连接会被存储和复用，而不是创建一个新的连接。

source: :data:`current_app` is another special object that points to the Flask application handling the request. Since you used an application factory, there is no application object when writing the rest of your code. ``get_db`` will be called when the application has been created and is handling a request, so :data:`current_app` can be used.
fr: :data:`current_app` est un autre objet spécial qui pointe vers l'application Flask qui traite la requête HTTP. Puisque vous avez utilisé une fabrique d'application, il n'y a pas d'objet application lorsque vous écrivez le reste de votre code. ``get_db`` sera appelé lorsque l'application aura été créée et traitera une requête, donc :data:`current_app` peut être utilisé.
per: :data:`current_app` یک شی خاص دیگر است که به برنامه فلاسک اشاره میکند تا درخواست را مدیریت کند. از آنجایی که شما از کارخانه برنامه کاربردی استفاده می‌کنید، هنگام نوشتن بقیه کد، شما هیچ شی دیگری برای برنامه نمیسازید. ``get_db`` زمانی فراخوانده می شود که برنامه ایجاد شود . در حال رسیدگی به درخواست باشد، بنابراین میتوان از :data:`current_app` استفاده کرد.
zh_cn: :data:`current_app` 是另一个特殊的对象，它指向处理请求的 Flask 应用。因为你使用了一个应用工厂，所以当写其他部分代码时没有应用对象。当应用被创建并且正在处理一个请求时，``get_db`` 将会被调用，所以可以使用 :data:`current_app`。

source: :func:`sqlite3.connect` establishes a connection to the file pointed at by the ``DATABASE`` configuration key. This file doesn't have to exist yet, and won't until you initialize the database later.
fr: :func:`sqlite3.connect` établit une connexion au fichier pointé par la clé de configuration ``DATABASE``. Ce fichier n'a pas besoin d'exister encore, et n'existera pas tant que vous n'aurez pas initialisé la base de données plus tard.
per: :func:`sqlite3.connect` ارتباطی را با فایلی که توسط کلید پیکربندی که به`DATABASE`` اشاره شده است، برقرار میکند. این فایل هنوز لازم نیست وجود داشته باشد و تا زمانی که دیتابیس را بعدا مقداردهی نکنید، وجود نخواهد داشت.
zh_cn: :func:`sqlite3.connect` 建立一个连接到配置键 ``DATABASE`` 指向的文件。这个文件还不存在，直到你之后初始化数据库才会被创建。

source: :class:`sqlite3.Row` tells the connection to return rows that behave like dicts. This allows accessing the columns by name.
fr: :class:`sqlite3.Row` indique à la connexion de retourner des lignes qui se comportent comme des dictionnaires. Cela permet d'accéder aux colonnes par leur nom.
per: :class:`sqlite3.Row` به اتصال می گوید که ردیف هایی را که مانند دیکشنری ها رفتار می کنند، برگرداند. این اجازه می دهد تا به ستون ها با نام دسترسی داشته باشید.
zh_cn: :class:`sqlite3.Row` 告诉这个连接返回行为和字典一样的行。这允许你通过名称访问列。

source: ``close_db`` checks if a connection was created by checking if ``g.db`` was set. If the connection exists, it is closed. Further down you will tell your application about the ``close_db`` function in the application factory so that it is called after each request.
fr: ``close_db`` vérifie si une connexion a été créée en vérifiant si ``g.db`` a été défini. Si la connexion existe, elle est fermée. Plus loin, vous indiquerez à votre application la fonction ``close_db`` dans la fabrique de l'application afin qu'elle soit appelée après chaque requête HTTP.
per: ``close_db`` با بررسی اینکه `g.db`` تنظیم شده است، بررسی می‌کند که آیا یک اتصال ایجاد شده است. اگر اتصال وجود داشته باشد، بسته است. در ادامه به برنامه خود در مورد عملکرد ``close_db`` در کارخانه برنامه خواهید گفت تا پس از هر درخواست فراخوانی شود.
zh_cn: ``close_db`` 通过判断 ``g.db`` 是否被设置来检查一个连接是否被创建。如果连接存在，它将被关闭。接下来，你将会在应用工厂里把 ``close_db`` 函数引入你的应用，以便在每个请求之后调用它。

source: Create the Tables
fr: Créer les tables
per: ساخته جدول ها
zh_cn: 创建表

source: In SQLite, data is stored in *tables* and *columns*. These need to be created before you can store and retrieve data. Flaskr will store users in the ``user`` table, and posts in the ``post`` table. Create a file with the SQL commands needed to create empty tables:
fr: Dans SQLite, les données sont stockées dans des *tables* et des *colonnes*. Ceux-ci doivent être créés avant que vous puissiez stocker et récupérer des données. Flaskr va stocker les utilisateurs dans la table ``user``, et les messages dans la table ``post``. Créez un fichier avec les commandes SQL nécessaires pour créer des tables vides :
per: در SQLite، داده ها در *tables* و *columns* انبار میشوند. آنها نیاز دارند، قبل از انبار شدن و پس گرفتن داده ها، ساخته شوند. Flaskr میخواهد کاربران را در جدول ``user`` و پست ها را در جدول ``post`` انبار کند. یک فایل با دستور های SQL نیاز است تا جدول خالی ساخته شود. آن را بسازید:
zh_cn: 在 SQLite 中，数据被存储在 *表* 和 *列* 中。在你可以存储和获取数据之前，需要先创建它们。Flaskr 将会存储用户到 ``user`` 表，存储帖子到 ``post`` 表。创建一个文件来存储创建空表所需的 SQL 命令：

source: Add the Python functions that will run these SQL commands to the ``db.py`` file:
fr: Ajoutez les fonctions Python qui exécuteront ces commandes SQL au fichier ``db.py`` :
per: و توابع پایتون دستورات SQL را در فایل ``db.py`` اجرا خواهند کرد:
zh_cn: 把将会运行这些 SQL 命令的的 Python 函数添加到 ``db.py`` 文件：

source: :meth:`open_resource() <Flask.open_resource>` opens a file relative to the ``flaskr`` package, which is useful since you won't necessarily know where that location is when deploying the application later. ``get_db`` returns a database connection, which is used to execute the commands read from the file.
fr: :meth:`open_resource() <Flask.open_resource>` ouvre un fichier relatif au paquet ``flaskr``, ce qui est utile puisque vous ne saurez pas nécessairement où se trouve cet emplacement lors du déploiement ultérieur de l'application. ``get_db`` retourne une connexion à la base de données, qui est utilisée pour exécuter les commandes lues dans le fichier.
per: :meth:`open_resource() <Flask.open_resource>` فایلی را نسبت به بسته ``flaskr`` باز می کند، که مفید است زیرا در زمان استقرار برنامه لزوماً نمی دانید آن مکان کجاست. ``get_db`` یک اتصال پایگاه داده را برمی گرداند که برای اجرای دستورات خوانده شده از فایل استفاده می شود.
zh_cn: :meth:`open_resource() <Flask.open_resource>` 打开一个相对于 ``flaskr`` 包的文件，这很有用，因为当后续部署应用的时候你不用知道文件的位置在哪里。``get_db`` 返回一个数据库连接，用来执行从文件中读取的命令。

source: :func:`click.command` defines a command line command called ``init-db`` that calls the ``init_db`` function and shows a success message to the user. You can read :doc:`/cli` to learn more about writing commands.
fr: :func:`click.command` définit une commande de ligne de commande appelée ``init-db`` qui appelle la fonction ``init_db`` et affiche un message de réussite à l'utilisateur. Vous pouvez lire :doc:`/cli` pour en savoir plus sur l'écriture des commandes.
per: :func:`click.command` یک خط فرمان به نام ``init-db`` را تعریف می کند که تابع ``init_db`` را فراخوانی می کند و پیام موفقیت آمیز را به کاربر نشان می دهد. برای کسب اطلاعات بیشتر در مورد نوشتن دستورات می توانید :doc:`/cli` را بخوانید.
zh_cn: :func:`click.command` 定义了一个名为 ``init-db`` 的命令行命令，这个命令会调用 ``init_db`` 函数并向用户显示一个成功消息。你可以阅读 :doc:`/cli` 学习更多关于编写命令的内容。

source: Register with the Application
fr: S'enregistrer auprès de l'application
per: ثبت نام با برنامه
zh_cn: 注册到应用

source: The ``close_db`` and ``init_db_command`` functions need to be registered with the application instance; otherwise, they won't be used by the application. However, since you're using a factory function, that instance isn't available when writing the functions. Instead, write a function that takes an application and does the registration.
fr: Les fonctions ``close_db`` et ``init_db_command`` doivent être enregistrées avec l'instance de l'application ; sinon, elles ne seront pas utilisées par l'application. Cependant, puisque vous utilisez une fonction de fabrique, cette instance n'est pas disponible lors de l'écriture des fonctions. Au lieu de cela, écrivez une fonction qui prend une application et effectue l'enregistrement.
per: توابع ``close_db`` و ``indit_db_command‍‍`` باید در نمونه برنامه ثبت شوند. در غیر این صورت، آنها توسط برنامه استفاده نخواهند شد. با این حال، از آنجایی که شما از یک تابع کارخانه استفاده می کنید، این نمونه هنگام نوشتن توابع در دسترس نیست. در عوض، تابعی بنویسید که یک برنامه کاربردی را می گیرد و ثبت را انجام می دهد.
zh_cn: ``close_db`` 和 ``init_db_command`` 函数需要被注册到应用实例；否则的话，他们不会被应用使用。然而，因为你正在使用工厂函数，该实例没法在这些函数里使用。取而代之的是，写一个函数，接受一个应用作为参数并实现注册。

source: :meth:`app.teardown_appcontext() <Flask.teardown_appcontext>` tells Flask to call that function when cleaning up after returning the response.
fr: :meth:`app.teardown_appcontext() <Flask.teardown_appcontext>` indique à Flask d'appeler cette fonction lors du nettoyage après le renvoie de la réponse.
per: :meth:`app.teardown_appcontext() <Flask.teardown_appcontext>` به فلاسک می گوید که هنگام پاکسازی پس از بازگرداندن پاسخ، آن تابع را فراخوانی کند.
zh_cn: :meth:`app.teardown_appcontext() <Flask.teardown_appcontext>` 告诉 Flask在返回响应以后进行清理时调用该函数。

source: :meth:`app.cli.add_command() <click.Group.add_command>` adds a new command that can be called with the ``flask`` command.
fr: :meth:`app.cli.add_command() <click.Group.add_command>` ajoute une nouvelle commande qui peut être appelée avec la commande ``flask``.
per: :meth:`app.cli.add_command() <click.Group.add_command>` یک دستور جدید اضافه می کند که می تواند با دستور ``flask`` فراخوانی شود.
zh_cn: :meth:`app.cli.add_command() <click.Group.add_command>` 添加一个新的命令，可以使用 ``flask`` 命令调用。

source: Import and call this function from the factory. Place the new code at the end of the factory function before returning the app.
fr: Importez et appelez cette fonction depuis la fabrique. Placez le nouveau code à la fin de la fonction de la fabrique avant de retourner l'application.
per: این تابع را از کارخانه وارد کرده و فراخوانی کنید. قبل از بازگرداندن برنامه، کد جدید را در انتهای عملکرد کارخانه قرار دهید.
zh_cn: 在工厂里导入并调用这个函数。把新的代码放到工厂函数的末尾，在返回应用之前。

source: Initialize the Database File
fr: Initialiser le fichier de la base de données
per: راه اندازی فایل پایگاه داده
zh_cn: 初始化数据库文件

source: Now that ``init-db`` has been registered with the app, it can be called using the ``flask`` command, similar to the ``run`` command from the previous page.
fr: Maintenant que ``init-db`` a été enregistré avec l'application, il peut être appelé en utilisant la commande ``flask``, similaire à la commande ``run`` de la page précédente.
per: اکنون که ``init-db`` در برنامه ثبت شده است، می توان با استفاده از دستور ``flask``، مشابه دستور ``run`` از صفحه قبل، آن را فراخوانی کرد.
zh_cn: 现在 ``init-db`` 已经注册到应用，你可以使用 ``flask`` 命令调用它，类似上一章的 ``run`` 命令。

source: Run the ``init-db`` command:
fr: Exécutez la commande ``init-db`` :
per: دستور ``init-db`` را اجرا کنید:
zh_cn: 运行 ``init-db`` 命令：

source: There will now be a ``flaskr.sqlite`` file in the ``instance`` folder in your project.
fr: Il y aura maintenant un fichier ``flaskr.sqlite`` dans le dossier ``instance`` de votre projet.
per: اکنون فایل ``flaskr.sqlite`` در پوشه ``instance`` در پروژه خواهد بود.
zh_cn: 现在在你项目的 ``instance`` 文件夹中会有一个 ``flaskr.sqlite`` 文件。

source: Continue to :doc:`views`.
fr: Continuer vers :doc:`views`.
per: با :doc:`views` ادامه دهید.
zh_cn: 继续阅读 :doc:`views`。
