Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/tutorial/deploy.po
Languages: fr

source: Deploy to Production
fr: Déployer en production

source: This part of the tutorial assumes you have a server that you want to deploy your application to. It gives an overview of how to create the distribution file and install it, but won't go into specifics about what server or software to use. You can set up a new environment on your development computer to try out the instructions below, but probably shouldn't use it for hosting a real public application. See :doc:`/deploying/index` for a list of many different ways to host your application.
fr: Cette partie du tutoriel suppose que vous disposez d'un serveur sur lequel vous souhaitez déployer votre application. Elle donne un aperçu de la manière de créer le fichier de distribution et de l'installer, mais n'entre pas dans les détails concernant le serveur ou le logiciel à utiliser. Vous pouvez configurer un nouvel environnement sur votre ordinateur de développement pour essayer les instructions ci-dessous, mais vous ne devriez probablement pas l'utiliser pour héberger une véritable application publique. Voir :doc:`/deploying/index` pour une liste des différentes manières d'héberger votre application.

source: Build and Install
fr: Construction et installation

source: You can find the file in ``dist/flaskr-1.0.0-py3-none-any.whl``. The file name is in the format of {project name}-{version}-{python tag} -{abi tag}-{platform tag}.
fr: Vous pouvez trouver le fichier dans ``dist/flaskr-1.0.0-py3-none-any.whl``. Le nom du fichier est au format {nom du projet}-{version}-{balises python} -{balise abi}-{balise plateforme}.

source: Copy this file to another machine, :ref:`set up a new virtualenv <install-create-env>`, then install the file with ``pip``.
fr: Copiez ce fichier sur une autre machine, :ref:`mettez en place un nouveau virtualenv <install-create-env>`, puis installez le fichier avec ``pip``.

source: Pip will install your project along with its dependencies.
fr: Pip installera votre projet ainsi que ses dépendances.

source: Since this is a different machine, you need to run ``init-db`` again to create the database in the instance folder.
fr: Comme il s'agit d'une machine différente, vous devez relancer ``init-db`` pour créer la base de données dans le dossier de l'instance.

source: Configure the Secret Key
fr: Configurer la clé secrète

source: In the beginning of the tutorial that you gave a default value for :data:`SECRET_KEY`. This should be changed to some random bytes in production. Otherwise, attackers could use the public ``'dev'`` key to modify the session cookie, or anything else that uses the secret key.
fr: Au début du tutoriel, vous avez donné une valeur par défaut pour :data:`SECRET_KEY`. Cette valeur doit être remplacée par des octets aléatoires en production. Sinon, les attaquants pourraient utiliser la clé publique ``'dev'`` pour modifier le cookie de session, ou tout autre élément qui utilise la clé secrète.

source: You can use the following command to output a random secret key:
fr: Vous pouvez utiliser la commande suivante pour générer une clé secrète aléatoire :

source: Create the ``config.py`` file in the instance folder, which the factory will read from if it exists. Copy the generated value into it.
fr: Créez le fichier ``config.py`` dans le dossier de l'instance, que la fabrique lira s'il existe. Copiez la valeur générée dans ce fichier.

source: You can also set any other necessary configuration here, although ``SECRET_KEY`` is the only one needed for Flaskr.
fr: Vous pouvez également définir toute autre configuration nécessaire ici, bien que ``SECRET_KEY`` soit la seule nécessaire pour Flaskr.

source: Run with a Production Server
fr: Exécution avec un serveur de production

source: When running publicly rather than in development, you should not use the built-in development server (``flask run``). The development server is provided by Werkzeug for convenience, but is not designed to be particularly efficient, stable, or secure.
fr: Lorsque vous exécutez publiquement plutôt qu'en développement, vous ne devriez pas utiliser le serveur de développement intégré (``flask run``). Le serveur de développement est fourni par Werkzeug pour des raisons pratiques, mais il n'est pas conçu pour être particulièrement efficace, stable ou sécurisé.

source: Instead, use a production WSGI server. For example, to use `Waitress`_, first install it in the virtual environment:
fr: A la place, utilisez un serveur WSGI de production. Par exemple, pour utiliser `Waitress`_, installez-le d'abord dans l'environnement virtuel :

source: See :doc:`/deploying/index` for a list of many different ways to host your application. Waitress is just an example, chosen for the tutorial because it supports both Windows and Linux. There are many more WSGI servers and deployment options that you may choose for your project.
fr: Voir :doc:`/deploying/index` pour une liste des différentes manières d'héberger votre application. Waitress est juste un exemple, choisi pour le tutoriel parce qu'il supporte à la fois Windows et Linux. Il existe de nombreux autres serveurs WSGI et options de déploiement que vous pouvez choisir pour votre projet.

source: Continue to :doc:`next`.
fr: Passez à :doc:`next`.
