Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/tutorial/factory.po
Languages: fr, zh_cn

source: Application Setup
fr: Configuration de l'application
zh_cn: 应用设置

source: A Flask application is an instance of the :class:`Flask` class. Everything about the application, such as configuration and URLs, will be registered with this class.
fr: Une application Flask est une instance de la classe :class:`Flask`. Tout ce qui concerne l'application, comme la configuration et les URLs, sera enregistré avec cette classe.
zh_cn: Flask 应用是 :class:`Flask` 类的实例。关于这个应用的一切，比如配置和 URL，都会使用这个类注册。

source: The most straightforward way to create a Flask application is to create a global :class:`Flask` instance directly at the top of your code, like how the "Hello, World!" example did on the previous page. While this is simple and useful in some cases, it can cause some tricky issues as the project grows.
fr: La façon la plus simple de créer une application Flask est de créer une instance globale :class:`Flask` directement en haut de votre code, comme dans l'exemple "Hello, World !" de la page précédente. Bien que cette méthode soit simple et utile dans certains cas, elle peut poser des problèmes délicats lorsque le projet se développe.
zh_cn: 创建一个 Flask 应用最直接的方式是直接在你的代码顶部创建一个全局的 :class:`Flask` 实例，就像上一页的“Hello, World!”示例做的那样。虽然这在某些情况下很简单也很有用，但它在项目变大时会带来一些棘手的问题。

source: Instead of creating a :class:`Flask` instance globally, you will create it inside a function. This function is known as the *application factory*. Any configuration, registration, and other setup the application needs will happen inside the function, then the application will be returned.
fr: Au lieu de créer une instance :class:`Flask` globalement, vous la créerez dans une fonction. Cette fonction est connue sous le nom de *fabrique d'applications*. Toute configuration, tout enregistrement et tout autre réglage dont l'application a besoin se fera dans la fonction, puis l'application sera retournée.
zh_cn: 与其全局创建一个 :class:`Flask` 类实例，不如在一个函数里创建它。这个函数被称为 *应用工厂*。应用所需要的任何配置、注册和其他设置都将在这个函数里进行，然后应用会被返回。

source: The Application Factory
fr: Fabrique d'applications
zh_cn: 应用工厂

source: It's time to start coding! Create the ``flaskr`` directory and add the ``__init__.py`` file. The ``__init__.py`` serves double duty: it will contain the application factory, and it tells Python that the ``flaskr`` directory should be treated as a package.
fr: C'est le moment de commencer à coder ! Créez le répertoire ``flaskr`` et ajoutez le fichier ``__init__.py``. Le fichier ``__init__.py`` a une double fonction : il contiendra la fabrique de l'application, et il indique à Python que le répertoire ``flaskr`` doit être traité comme un paquet.
zh_cn: 是时候开始写代码了！创建 ``flaskr`` 目录并添加 ``__init__.py`` 文件。``__init__.py`` 有两个作用：它将包含应用工厂，而且告诉 Python，``flaskr`` 目录应该被看做一个包。

source: ``create_app`` is the application factory function. You'll add to it later in the tutorial, but it already does a lot.
fr: ``create_app`` est la fonction de fabrique de l'application. Vous la compléterez plus tard dans le tutoriel, mais elle fait déjà beaucoup.
zh_cn: ``create_app`` 是应用工厂函数。你会在教程后面对它进行补充，不过它已经做了很多事情。

source: ``app = Flask(__name__, instance_relative_config=True)`` creates the :class:`Flask` instance.
fr: ``app = Flask(__name__, instance_relative_config=True)`` crée l'instance :class:`Flask`.
zh_cn: ``app = Flask(__name__, instance_relative_config=True)`` 创建 :class:`Flask` 实例。

source: ``__name__`` is the name of the current Python module. The app needs to know where it's located to set up some paths, and ``__name__`` is a convenient way to tell it that.
fr: ``__name__`` est le nom du module Python actuel. L'application a besoin de savoir où il se trouve pour configurer certains chemins, et ``__name__`` est un moyen pratique de le lui dire.
zh_cn: ``__name__`` 是当前 Python 模块的名称。为了设置一些路径，应用需要知道它的位置，而 ``__name__`` 是告诉它当前位置的一个便捷方式。

source: ``instance_relative_config=True`` tells the app that configuration files are relative to the :ref:`instance folder <instance-folders>`. The instance folder is located outside the ``flaskr`` package and can hold local data that shouldn't be committed to version control, such as configuration secrets and the database file.
fr: ``instance_relative_config=True`` indique à l'application que les fichiers de configuration sont relatifs au dossier :ref:`instance <instance-folders>`. Le dossier d'instance est situé en dehors du paquet ``flaskr`` et peut contenir des données locales qui ne doivent pas être soumises au contrôle de version, comme les secrets de configuration et le fichier de base de données.
zh_cn: ``instance_relative_config=True`` 用来告诉应用，配置文件的位置相对于 :ref:`实例文件夹 <instance-folders>`。实例文件夹位于 ``flaskr`` 包的外层，它用来存放不应该提交到版本控制软件的本地数据，比如包含私密信息的配置和数据库文件。

source: :meth:`app.config.from_mapping() <Config.from_mapping>` sets some default configuration that the app will use:
fr: :meth:`app.config.from_mapping() <Config.from_mapping>` définit une certaine configuration par défaut que l'application utilisera :
zh_cn: :meth:`app.config.from_mapping() <Config.from_mapping>` 设置一些应用将会使用的默认配置：

source: :data:`SECRET_KEY` is used by Flask and extensions to keep data safe. It's set to ``'dev'`` to provide a convenient value during development, but it should be overridden with a random value when deploying.
fr: :data:`SECRET_KEY` est utilisé par Flask et les extensions pour garder les données en sécurité. Elle est définie à ``'dev'`` pour fournir une valeur pratique pendant le développement, mais elle doit être remplacée par une valeur aléatoire lors du déploiement.
zh_cn: :data:`SECRET_KEY` 被 Flask 和扩展用来保持数据安全。为了方便，在开发时可以将它设为 ``'dev'``，但是它在部署时应该被一个随机值覆写。

source: ``DATABASE`` is the path where the SQLite database file will be saved. It's under :attr:`app.instance_path <Flask.instance_path>`, which is the path that Flask has chosen for the instance folder. You'll learn more about the database in the next section.
fr: ``DATABASE`` est le chemin où le fichier de la base de données SQLite sera enregistré. Il se trouve sous :attr:`app.instance_path <Flask.instance_path>`, qui est le chemin que Flask a choisi pour le dossier de l'instance. Vous en apprendrez plus sur la base de données dans la section suivante.
zh_cn: ``DATABASE`` 是保存 SQLite 数据库文件的路径。它在 :attr:`app.instance_path <Flask.instance_path>` 路径下，这是 Flask 为实例文件夹选择的路径。你会在下一节了解到更多关于数据库的内容。

source: :meth:`app.config.from_pyfile() <Config.from_pyfile>` overrides the default configuration with values taken from the ``config.py`` file in the instance folder if it exists. For example, when deploying, this can be used to set a real ``SECRET_KEY``.
fr: :meth:`app.config.from_pyfile() <Config.from_pyfile>` remplace la configuration par défaut par des valeurs prises dans le fichier ``config.py`` du dossier de l'instance s'il existe. Par exemple, lors du déploiement, cela peut être utilisé pour définir une véritable ``SECRET_KEY``.
zh_cn: 如果实例文件夹里存在 ``config.py`` 文件，:meth:`app.config.from_pyfile() <Config.from_pyfile>` 会使用从这个文件中获取到的值来覆写默认配置。例如，当部署时，这可以被用来设置一个真正的 ``SECRET_KEY`` 配置值。

source: ``test_config`` can also be passed to the factory, and will be used instead of the instance configuration. This is so the tests you'll write later in the tutorial can be configured independently of any development values you have configured.
fr: ``test_config`` peut aussi être passé à la fabrique, et sera utilisé à la place de la configuration de l'instance. Ceci afin que les tests que vous écrirez plus tard dans le tutoriel puissent être configurés indépendamment des valeurs de développement que vous avez configurées.
zh_cn: ``test_config`` 也可以传递给工厂函数，这时传入的测试配置会被使用，而不是实例文件夹内的配置。这样可以让你在稍后的教程中会编写的测试被独立配置，以区别于任何开发时使用的值。

source: :func:`os.makedirs` ensures that :attr:`app.instance_path <Flask.instance_path>` exists. Flask doesn't create the instance folder automatically, but it needs to be created because your project will create the SQLite database file there.
fr: :func:`os.makedirs` assure que :attr:`app.instance_path <Flask.instance_path>` existe. Flask ne crée pas le dossier d'instance automatiquement, mais il doit être créé car votre projet y créera le fichier de la base de données SQLite.
zh_cn: :func:`os.makedirs` 确保 :attr:`app.instance_path <Flask.instance_path>` 指向的路径存在。Flask 不会自动创建实例文件夹，但它需要被创建，因为你的项目将在那里创建 SQLite 数据库文件。

source: :meth:`@app.route() <Flask.route>` creates a simple route so you can see the application working before getting into the rest of the tutorial. It creates a connection between the URL ``/hello`` and a function that returns a response, the string ``'Hello, World!'`` in this case.
fr: :meth:`@app.route() <Flask.route>` crée une route simple pour que vous puissiez voir l'application fonctionner avant d'aborder le reste du tutoriel. Elle crée une connexion entre l'URL ``/hello`` et une fonction qui renvoie une réponse, la chaîne de caractères ``'Hello, World!'`` dans ce cas.
zh_cn: :meth:`@app.route() <Flask.route>` 创建了一个简单的路由，这样在开始下面的教程之前你可以看到应用能够正常工作。它在 URL ``/hello`` 和一个函数之间创建了一个连接，这个函数会返回一个响应，在这里即 ``'Hello, World!'`` 字符串。

source: Run The Application
fr: Démarrer l'application
zh_cn: 运行应用

source: You'll see output similar to this:
fr: Vous verrez un résultat similaire à celui-ci :
zh_cn: 你会看到类似下面的输出：

source: Visit http://127.0.0.1:5000/hello in a browser and you should see the "Hello, World!" message. Congratulations, you're now running your Flask web application!
fr: Visitez http://127.0.0.1:5000/hello dans un navigateur et vous devriez voir le message "Hello, World !". Félicitations, vous avez démarré votre première application web Flask !
zh_cn: 在浏览器中访问 http://127.0.0.1:5000/hello，你应该会看到“Hello, World!”信息。恭喜，你现在正在运行你的 Flask web 应用！

source: Continue to :doc:`database`.
fr: Passez à :doc:`database`.
zh_cn: 继续阅读 :doc:`database`。
