Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/tutorial/install.po
Languages: fr, zh_cn

source: Make the Project Installable
fr: Rendre le projet installable
zh_cn: 让项目可安装

source: Installing also comes with other benefits that might not be obvious from the tutorial or as a new Python user, including:
fr: L'installation s'accompagne également d'autres avantages qui ne sont peut-être pas évidents à la lecture du tutoriel ou en tant que nouvel utilisateur de Python, notamment :
zh_cn: 安装项目也会带来一些也许在这个教程中或对于 Python 新用户来说并不明显的其他好处，这包括：

source: Currently, Python and Flask understand how to use the ``flaskr`` package only because you're running from your project's directory. Installing means you can import it no matter where you run from.
fr: Actuellement, Python et Flask comprennent comment utiliser le paquet ``flaskr`` uniquement parce que vous vous exécutez depuis le répertoire de votre projet. L'installation signifie que vous pouvez l'importer quel que soit l'endroit d'où vous vous exécutez.
zh_cn: 目前，Python 和 Flask 理解如何使用 ``flaskr`` 包仅仅因为你是从项目文件夹运行它。安装则意味着不论从哪里运行都可以导入它。

source: You can manage your project's dependencies just like other packages do, so ``pip install yourproject.whl`` installs them.
fr: Vous pouvez gérer les dépendances de votre projet comme les autres paquets, pour que ``pip install yourproject.whl`` les installe.
zh_cn: 你可以像其他包一样管理项目依赖，如此便可以执行 ``pip install yourproject.whl`` 安装它们。

source: Test tools can isolate your test environment from your development environment.
fr: Les outils de test peuvent isoler votre environnement de test de votre environnement de développement.
zh_cn: 测试工具可以将测试环境与你的开发环境隔离开来。

source: This is being introduced late in the tutorial, but in your future projects you should always start with this.
fr: Cette fonction est introduite tardivement dans le tutoriel, mais dans vos futurs projets, vous devriez toujours commencer par cette fonction.
zh_cn: 这一章被放到了教程的后面，但是你未来的项目应该始终从这一步开始。

source: Describe the Project
fr: Décrire le projet
zh_cn: 描述项目

source: Install the Project
fr: Installer le projet
zh_cn: 安装项目

source: Use ``pip`` to install your project in the virtual environment.
fr: Utilisez ``pip`` pour installer votre projet dans l'environnement virtuel.
zh_cn: 使用 ``pip`` 在虚拟环境中安装你的项目。

source: You can observe that the project is now installed with ``pip list``.
fr: Vous pouvez observer que le projet est maintenant installé avec ``pip list``.
zh_cn: 项目现在已经被安装了，你可以在 ``pip list`` 命令的输出里找到它。

source: Continue to :doc:`tests`.
fr: Continuer vers :doc:`tests`.
zh_cn: 继续阅读 :doc:`tests`。
