Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/tutorial/layout.po
Languages: fr

source: Project Layout
fr: Plan du projet

source: Create a project directory and enter it:
fr: Créez un répertoire de projet et entrez-y :

source: Then follow the :doc:`installation instructions </installation>` to set up a Python virtual environment and install Flask for your project.
fr: Suivez ensuite les :doc:`instructions d'installation </installation>` pour configurer un environnement virtuel Python et installer Flask pour votre projet.

source: The tutorial will assume you're working from the ``flask-tutorial`` directory from now on. The file names at the top of each code block are relative to this directory.
fr: Le tutoriel supposera que vous travaillez dans le répertoire ``flask-tutorial`` à partir de maintenant. Les noms de fichiers en haut de chaque bloc de code sont relatifs à ce répertoire.

source: A Flask application can be as simple as a single file.
fr: Une application Flask peut être aussi simple qu'un simple fichier.

source: However, as a project gets bigger, it becomes overwhelming to keep all the code in one file. Python projects use *packages* to organize code into multiple modules that can be imported where needed, and the tutorial will do this as well.
fr: Cependant, lorsqu'un projet prend de l'ampleur, il devient difficile de conserver tout le code dans un seul fichier. Les projets Python utilisent des *paquets* pour organiser le code en plusieurs modules qui peuvent être importés là où c'est nécessaire, et le tutoriel fera de même.

source: The project directory will contain:
fr: Le répertoire du projet contiendra :

source: ``flaskr/``, a Python package containing your application code and files.
fr: ``flaskr/``, un paquet Python contenant le code et les fichiers de votre application.

source: ``tests/``, a directory containing test modules.
fr: ``tests/``, un répertoire contenant les modules de test.

source: Installation files telling Python how to install your project.
fr: Les fichiers d'installation indiquant à Python comment installer votre projet.

source: Version control config, such as `git`_. You should make a habit of using some type of version control for all your projects, no matter the size.
fr: La configuration du contrôle de version, tel que `git`_. Vous devriez prendre l'habitude d'utiliser un certain type de contrôle de version pour tous vos projets, quelle que soit leur taille.

source: Any other project files you might add in the future.
fr: Tout autre fichier du projet que vous pourriez ajouter à l'avenir.

source: By the end, your project layout will look like this:
fr: À la fin, la mise en page de votre projet ressemblera à ceci :

source: If you're using version control, the following files that are generated while running your project should be ignored. There may be other files based on the editor you use. In general, ignore files that you didn't write. For example, with git:
fr: Si vous utilisez le contrôle de version, les fichiers suivants, générés lors de l'exécution de votre projet, doivent être ignorés. Il peut y avoir d'autres fichiers en fonction de l'éditeur que vous utilisez. En général, ignorez les fichiers que vous n'avez pas écrits. Par exemple, avec git :

source: Continue to :doc:`factory`.
fr: Continuer vers :doc:`factory`.
