Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/tutorial/tests.po
Languages: fr

source: Test Coverage
fr: Couverture des tests

source: Writing unit tests for your application lets you check that the code you wrote works the way you expect. Flask provides a test client that simulates requests to the application and returns the response data.
fr: L'écriture de tests unitaires pour votre application vous permet de vérifier que le code que vous avez écrit fonctionne comme vous l'attendez. Flask fournit un client de test qui simule les requêtes adressées à l'application et renvoie les données de réponse.

source: You should test as much of your code as possible. Code in functions only runs when the function is called, and code in branches, such as ``if`` blocks, only runs when the condition is met. You want to make sure that each function is tested with data that covers each branch.
fr: Vous devez tester votre code autant que possible. Le code des fonctions ne s'exécute que lorsque la fonction est appelée, et le code des embranchements, comme les blocs ``if``, ne s'exécute que lorsque la condition est remplie. Vous devez vous assurer que chaque fonction est testée avec des données qui couvrent chaque branche.

source: The closer you get to 100% coverage, the more comfortable you can be that making a change won't unexpectedly change other behavior. However, 100% coverage doesn't guarantee that your application doesn't have bugs. In particular, it doesn't test how the user interacts with the application in the browser. Despite this, test coverage is an important tool to use during development.
fr: Plus vous vous rapprochez d'une couverture de 100 %, plus vous pouvez être sûr qu'un changement ne modifiera pas de manière inattendue d'autres comportements. Cependant, une couverture à 100 % ne garantit pas que votre application ne comporte pas de bogues. En particulier, elle ne permet pas de tester la manière dont l'utilisateur interagit avec l'application dans le navigateur. Malgré cela, la couverture des tests est un outil important à utiliser pendant le développement.

source: This is being introduced late in the tutorial, but in your future projects you should test as you develop.
fr: Ce point est introduit tardivement dans le tutoriel, mais dans vos futurs projets, vous devriez tester au fur et à mesure que vous développez.

source: You'll use `pytest`_ and `coverage`_ to test and measure your code. Install them both:
fr: Vous utiliserez `pytest`_ et `coverage`_ pour tester et mesurer votre code. Installez-les tous les deux :

source: Setup and Fixtures
fr: Installation et *fixtures*

source: The test code is located in the ``tests`` directory. This directory is *next to* the ``flaskr`` package, not inside it. The ``tests/conftest.py`` file contains setup functions called *fixtures* that each test will use. Tests are in Python modules that start with ``test_``, and each test function in those modules also starts with ``test_``.
fr: Le code de test est situé dans le répertoire ``tests``. Ce répertoire se trouve *à côté* du paquet ``flaskr``, pas à l'intérieur. Le fichier ``tests/conftest.py`` contient des fonctions de configuration appelées *fixtures* que chaque test utilisera. Les tests sont dans des modules Python qui commencent par ``test_``, et chaque fonction de test dans ces modules commence aussi par ``test_``.

source: Each test will create a new temporary database file and populate some data that will be used in the tests. Write a SQL file to insert that data.
fr: Chaque test créera un nouveau fichier de base de données temporaire et alimentera certaines données qui seront utilisées dans les tests. Écrivez un fichier SQL pour insérer ces données.

source: The ``app`` fixture will call the factory and pass ``test_config`` to configure the application and database for testing instead of using your local development configuration.
fr: La *fixture* ``app`` appelle la fabrique et passe ``test_config`` pour configurer l'application et la base de données pour les tests au lieu d'utiliser votre configuration de développement locale.

source: :func:`tempfile.mkstemp` creates and opens a temporary file, returning the file descriptor and the path to it. The ``DATABASE`` path is overridden so it points to this temporary path instead of the instance folder. After setting the path, the database tables are created and the test data is inserted. After the test is over, the temporary file is closed and removed.
fr: :func:`tempfile.mkstemp` crée et ouvre un fichier temporaire, renvoyant le descripteur de fichier et le chemin d'accès à celui-ci. Le chemin d'accès à la ``DATABASE`` est remplacé par le chemin d'accès temporaire au lieu du dossier de l'instance. Après avoir défini le chemin, les tables de la base de données sont créées et les données du test sont insérées. Une fois le test terminé, le fichier temporaire est fermé et supprimé.

source: :data:`TESTING` tells Flask that the app is in test mode. Flask changes some internal behavior so it's easier to test, and other extensions can also use the flag to make testing them easier.
fr: :data:`TESTING` indique à Flask que l'application est en mode test. Flask modifie certains comportements internes pour faciliter les tests, et d'autres extensions peuvent également utiliser ce *flag* pour faciliter leurs tests.

source: The ``client`` fixture calls :meth:`app.test_client() <Flask.test_client>` with the application object created by the ``app`` fixture. Tests will use the client to make requests to the application without running the server.
fr: La *fixture* ``client`` appelle :meth:`app.test_client() <Flask.test_client>` avec l'objet application créé par la *fixture* ``app``. Les tests utiliseront le client pour faire des requêtes à l'application sans démarrer le serveur.

source: The ``runner`` fixture is similar to ``client``. :meth:`app.test_cli_runner() <Flask.test_cli_runner>` creates a runner that can call the Click commands registered with the application.
fr: La *fixture* ``runner`` est similaire à ``client``. :meth:`app.test_cli_runner() <Flask.test_cli_runner>` crée un runner qui peut appeler les commandes Click enregistrées avec l'application.

source: Pytest uses fixtures by matching their function names with the names of arguments in the test functions. For example, the ``test_hello`` function you'll write next takes a ``client`` argument. Pytest matches that with the ``client`` fixture function, calls it, and passes the returned value to the test function.
fr: Pytest utilise les *fixtures* en faisant correspondre leurs noms de fonctions avec les noms des arguments dans les fonctions de test. Par exemple, la fonction ``test_hello`` que vous allez écrire ensuite prend un argument ``client``. Pytest fait correspondre cet argument avec la fonction *fixture* ``client``, l'appelle et passe la valeur retournée à la fonction de test.

source: Factory
fr: Fabrique

source: There's not much to test about the factory itself. Most of the code will be executed for each test already, so if something fails the other tests will notice.
fr: Il n'y a pas grand chose à tester sur l'usine elle-même. La plupart du code sera déjà exécuté pour chaque test, donc si quelque chose échoue, les autres tests le remarqueront.

source: The only behavior that can change is passing test config. If config is not passed, there should be some default configuration, otherwise the configuration should be overridden.
fr: Le seul comportement qui peut changer est le passage du test config. Si la configuration n'est pas passée, il doit y avoir une configuration par défaut, sinon la configuration doit être remplacée.

source: You added the ``hello`` route as an example when writing the factory at the beginning of the tutorial. It returns "Hello, World!", so the test checks that the response data matches.
fr: Vous avez ajouté la route ``hello`` comme exemple lors de l'écriture de la fabrique au début du tutoriel. Il retourne "Hello, World !", donc le test vérifie que les données de la réponse correspondent.

source: Database
fr: Base de données

source: Within an application context, ``get_db`` should return the same connection each time it's called. After the context, the connection should be closed.
fr: Dans un contexte d'application, ``get_db`` doit retourner la même connexion à chaque fois qu'il est appelé. Après le contexte, la connexion doit être fermée.

source: The ``init-db`` command should call the ``init_db`` function and output a message.
fr: La commande ``init-db`` devrait appeler la fonction ``init_db`` et produire un message.

source: This test uses Pytest's ``monkeypatch`` fixture to replace the ``init_db`` function with one that records that it's been called. The ``runner`` fixture you wrote above is used to call the ``init-db`` command by name.
fr: Ce test utilise la *fixture* ``monkeypatch`` de Pytest pour remplacer la fonction ``init_db`` par une fonction qui enregistre qu'elle a été appelée. La *fixture* ``runner`` que vous avez écrite ci-dessus est utilisée pour appeler la commande ``init-db`` par son nom.

source: Authentication
fr: Authentification

source: For most of the views, a user needs to be logged in. The easiest way to do this in tests is to make a ``POST`` request to the ``login`` view with the client. Rather than writing that out every time, you can write a class with methods to do that, and use a fixture to pass it the client for each test.
fr: Pour la plupart des vues, un utilisateur doit être connecté. La façon la plus simple de faire cela dans les tests est de faire une requête ``POST`` vers la vue ``login`` avec le client. Plutôt que d'écrire cela à chaque fois, vous pouvez écrire une classe avec des méthodes pour le faire, et utiliser une *fixture* pour lui passer le client pour chaque test.

source: With the ``auth`` fixture, you can call ``auth.login()`` in a test to log in as the ``test`` user, which was inserted as part of the test data in the ``app`` fixture.
fr: Avec la *fixture* ``auth``, vous pouvez appeler ``auth.login()`` dans un test pour vous connecter en tant qu'utilisateur ``test``, qui a été inséré comme partie des données de test dans l'interface ``app``.

source: The ``register`` view should render successfully on ``GET``. On ``POST`` with valid form data, it should redirect to the login URL and the user's data should be in the database. Invalid data should display error messages.
fr: La vue ``register`` doit être rendue avec succès sur ``GET``. Sur ``POST`` avec des données de formulaire valides, elle devrait rediriger vers l'URL de connexion et les données de l'utilisateur devraient être dans la base de données. Les données non valides doivent afficher des messages d'erreur.

source: :meth:`client.get() <werkzeug.test.Client.get>` makes a ``GET`` request and returns the :class:`Response` object returned by Flask. Similarly, :meth:`client.post() <werkzeug.test.Client.post>` makes a ``POST`` request, converting the ``data`` dict into form data.
fr: :meth:`client.get() <werkzeug.test.Client.get>` fait une requête ``GET`` et renvoie l'objet :class:`Response` retourné par Flask. De même, :meth:`client.post() <werkzeug.test.Client.post>` fait une requête ``POST``, convertissant le dictionnaire ``data`` en données de formulaire.

source: To test that the page renders successfully, a simple request is made and checked for a ``200 OK`` :attr:`~Response.status_code`. If rendering failed, Flask would return a ``500 Internal Server Error`` code.
fr: Pour tester que la page s'affiche correctement, une simple requête est effectuée et on vérifie si elle renvoie un code ``200 OK`` :attr:`~Response.status_code``. Si le rendu échoue, Flask renvoie un code ``500 Internal Server Error``.

source: :attr:`~Response.headers` will have a ``Location`` header with the login URL when the register view redirects to the login view.
fr: :attr:`~Response.headers` aura un en-tête ``Location`` avec l'URL de connexion lorsque la vue d'enregistrement redirige vers la vue de connexion.

source: :attr:`~Response.data` contains the body of the response as bytes. If you expect a certain value to render on the page, check that it's in ``data``. Bytes must be compared to bytes. If you want to compare text, use :meth:`get_data(as_text=True) <werkzeug.wrappers.Response.get_data>` instead.
fr: :attr:`~Response.data` contient le corps de la réponse sous forme d'octets. Si vous vous attendez à ce qu'une certaine valeur soit rendue sur la page, vérifiez qu'elle se trouve dans ``data``. Les octets doivent être comparés à des octets. Si vous voulez comparer du texte, utilisez :meth:`get_data(as_text=True) <werkzeug.wrappers.Response.get_data>` à la place.

source: ``pytest.mark.parametrize`` tells Pytest to run the same test function with different arguments. You use it here to test different invalid input and error messages without writing the same code three times.
fr: ``pytest.mark.parametrize`` indique à Pytest d'exécuter la même fonction de test avec différents arguments. Vous l'utilisez ici pour tester différentes entrées invalides et différents messages d'erreur sans écrire le même code trois fois.

source: The tests for the ``login`` view are very similar to those for ``register``. Rather than testing the data in the database, :data:`session` should have ``user_id`` set after logging in.
fr: Les tests pour la vue ``login`` sont très similaires à ceux de ``register``. Plutôt que de tester les données dans la base de données, :data:`session` devrait avoir ``user_id`` défini après la connexion.

source: Using ``client`` in a ``with`` block allows accessing context variables such as :data:`session` after the response is returned. Normally, accessing ``session`` outside of a request would raise an error.
fr: L'utilisation de ``client`` dans un bloc ``with`` permet d'accéder à des variables contextuelles telles que :data:`session` après le retour de la réponse. Normalement, l'accès à ``session`` en dehors d'une requête soulève une erreur.

source: Testing ``logout`` is the opposite of ``login``. :data:`session` should not contain ``user_id`` after logging out.
fr: Le test ``logout`` est le contraire de ``login``. :data:`session` ne doit pas contenir ``user_id`` après la déconnexion.

source: All the blog views use the ``auth`` fixture you wrote earlier. Call ``auth.login()`` and subsequent requests from the client will be logged in as the ``test`` user.
fr: Toutes les vues du blog utilisent la *fixture* ``auth`` que vous avez écrit plus tôt. Appelez ``auth.login()`` et les requêtes suivantes du client seront connectées en tant qu'utilisateur ``test``.

source: The ``index`` view should display information about the post that was added with the test data. When logged in as the author, there should be a link to edit the post.
fr: La vue ``index`` doit afficher des informations sur le message qui a été ajouté avec les données de test. Lorsque l'on est connecté en tant qu'auteur, il doit y avoir un lien pour modifier le message.

source: You can also test some more authentication behavior while testing the ``index`` view. When not logged in, each page shows links to log in or register. When logged in, there's a link to log out.
fr: Vous pouvez également tester d'autres comportements d'authentification en testant la vue ``index``. Lorsque vous n'êtes pas connecté, chaque page affiche des liens pour se connecter ou s'enregistrer. Lorsqu'on est connecté, il y a un lien pour se déconnecter.

source: A user must be logged in to access the ``create``, ``update``, and ``delete`` views. The logged in user must be the author of the post to access ``update`` and ``delete``, otherwise a ``403 Forbidden`` status is returned. If a ``post`` with the given ``id`` doesn't exist, ``update`` and ``delete`` should return ``404 Not Found``.
fr: Un utilisateur doit être connecté pour accéder aux vues ``create``, ``update`` et ``delete``. L'utilisateur connecté doit être l'auteur du message pour accéder à ``update`` et ``delete``, sinon un état ``403 Forbidden`` est renvoyé. Si un ``message`` avec l\'``id`` donné n'existe pas, ``update`` et ``delete`` doivent retourner ``404 Not Found``.

source: The ``create`` and ``update`` views should render and return a ``200 OK`` status for a ``GET`` request. When valid data is sent in a ``POST`` request, ``create`` should insert the new post data into the database, and ``update`` should modify the existing data. Both pages should show an error message on invalid data.
fr: Les vues ``create`` et ``update`` doivent afficher et renvoyer un état ``200 OK`` pour une requête ``GET``. Lorsque des données valides sont envoyées dans une requête ``POST``, la vue ``create`` doit insérer les nouvelles données du message dans la base de données et la vue ``update`` doit modifier les données existantes. Les deux pages doivent afficher un message d'erreur en cas de données invalides.

source: The ``delete`` view should redirect to the index URL and the post should no longer exist in the database.
fr: La vue ``delete`` doit rediriger vers l'URL de l'index et le message ne doit plus exister dans la base de données.

source: Running the Tests
fr: Exécution des tests

source: To run the tests, use the ``pytest`` command. It will find and run all the test functions you've written.
fr: Pour exécuter les tests, utilisez la commande ``pytest``. Elle trouvera et exécutera toutes les fonctions de test que vous avez écrites.

source: If any tests fail, pytest will show the error that was raised. You can run ``pytest -v`` to get a list of each test function rather than dots.
fr: Si un test échoue, pytest affichera l'erreur qui a été levée. Vous pouvez lancer ``pytest -v`` pour obtenir une liste de chaque fonction de test plutôt que des points.

source: To measure the code coverage of your tests, use the ``coverage`` command to run pytest instead of running it directly.
fr: Pour mesurer la couverture de code de vos tests, utilisez la commande ``coverage`` pour lancer pytest au lieu de le lancer directement.

source: You can either view a simple coverage report in the terminal:
fr: Vous pouvez soit afficher un simple rapport de couverture dans le terminal :

source: An HTML report allows you to see which lines were covered in each file:
fr: Un rapport HTML vous permet de voir quelles lignes ont été couvertes dans chaque fichier :

source: This generates files in the ``htmlcov`` directory. Open ``htmlcov/index.html`` in your browser to see the report.
fr: Cela génère des fichiers dans le répertoire ``htmlcov``. Ouvrez ``htmlcov/index.html`` dans votre navigateur pour voir le rapport.

source: Continue to :doc:`deploy`.
fr: Passez à :doc:`deploy`.
