Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/tutorial/views.po
Languages: fr

source: Blueprints and Views
fr: *Blueprints* et vues

source: A view function is the code you write to respond to requests to your application. Flask uses patterns to match the incoming request URL to the view that should handle it. The view returns data that Flask turns into an outgoing response. Flask can also go the other direction and generate a URL to a view based on its name and arguments.
fr: Une fonction de vue est le code que vous écrivez pour répondre aux requêtes adressées à votre application. Flask utilise des modèles pour faire correspondre l'URL de la requête entrante à la vue qui doit la traiter. La vue renvoie des données que Flask transforme en une réponse sortante. Flask peut également aller dans l'autre sens et générer une URL vers une vue basée sur son nom et ses arguments.

source: Create a Blueprint
fr: Créer un *blueprint*

source: A :class:`Blueprint` is a way to organize a group of related views and other code. Rather than registering views and other code directly with an application, they are registered with a blueprint. Then the blueprint is registered with the application when it is available in the factory function.
fr: Un :class:`Blueprint` est un moyen d'organiser un groupe de vues et d'autres codes connexes. Plutôt que d'enregistrer des vues et d'autres codes directement dans une application, ils sont enregistrés dans un *blueprint*. Le *blueprint* est ensuite enregistré auprès de l'application lorsqu'il est disponible dans la fonction de fabrique.

source: Flaskr will have two blueprints, one for authentication functions and one for the blog posts functions. The code for each blueprint will go in a separate module. Since the blog needs to know about authentication, you'll write the authentication one first.
fr: Flaskr aura deux *blueprints*, un pour les fonctions d'authentification et un pour les fonctions des articles de blog. Le code de chaque *blueprint* sera placé dans un module séparé. Puisque le blog a besoin de connaître l'authentification, vous écrirez le module d'authentification en premier.

source: This creates a :class:`Blueprint` named ``'auth'``. Like the application object, the blueprint needs to know where it's defined, so ``__name__`` is passed as the second argument. The ``url_prefix`` will be prepended to all the URLs associated with the blueprint.
fr: Ceci crée un :class:`Blueprint` nommé ``'auth'``. Comme l'objet application, le *blueprint* doit savoir où il est défini, donc ``__name__`` est passé comme deuxième argument. Le préfixe ``url_prefix`` sera ajouté à toutes les URLs associées au *blueprint*.

source: Import and register the blueprint from the factory using :meth:`app.register_blueprint() <Flask.register_blueprint>`. Place the new code at the end of the factory function before returning the app.
fr: Importez et enregistrez le *blueprint* depuis la fabrique en utilisant :meth:`app.register_blueprint() <Flask.register_blueprint>`. Placez le nouveau code à la fin de la fonction de la fabrique avant de retourner l'application.

source: The authentication blueprint will have views to register new users and to log in and log out.
fr: Le *blueprint* d'authentification comportera des vues permettant d'enregistrer de nouveaux utilisateurs, de se connecter et de se déconnecter.

source: The First View: Register
fr: La première vue : S'inscrire

source: When the user visits the ``/auth/register`` URL, the ``register`` view will return `HTML`_ with a form for them to fill out. When they submit the form, it will validate their input and either show the form again with an error message or create the new user and go to the login page.
fr: Lorsque l'utilisateur visite l'URL ``/auth/register``, la vue ``register`` renvoie du `HTML`_ avec un formulaire qu'il doit remplir. Lorsqu'il soumettra le formulaire, il validera son entrée et soit affichera à nouveau le formulaire avec un message d'erreur, soit créera le nouvel utilisateur et ira à la page de connexion.

source: For now you will just write the view code. On the next page, you'll write templates to generate the HTML form.
fr: Pour l'instant, vous allez juste écrire le code de la vue. À la page suivante, vous écrirez des modèles pour générer le formulaire HTML.

source: Here's what the ``register`` view function is doing:
fr: Voici ce que fait la fonction de vue ``register`` :

source: :meth:`@bp.route <Blueprint.route>` associates the URL ``/register`` with the ``register`` view function. When Flask receives a request to ``/auth/register``, it will call the ``register`` view and use the return value as the response.
fr: :meth:`@bp.route <Blueprint.route>` associe l'URL ``/register`` à la fonction de vue ``register``. Lorsque Flask reçoit une requête vers ``/auth/register``, il appelle la vue ``register`` et utilise la valeur de retour comme réponse.

source: If the user submitted the form, :attr:`request.method <Request.method>` will be ``'POST'``. In this case, start validating the input.
fr: Si l'utilisateur a soumis le formulaire, :attr:`request.method <Request.method>` sera ``'POST'``. Dans ce cas, commencer à valider l'entrée.

source: :attr:`request.form <Request.form>` is a special type of :class:`dict` mapping submitted form keys and values. The user will input their ``username`` and ``password``.
fr: :attr:`request.form <Request.form>` est un type spécial de :class:`dict` mettant en correspondance les clés et les valeurs du formulaire soumis. L'utilisateur saisira son ``username`` et son ``password``.

source: Validate that ``username`` and ``password`` are not empty.
fr: Valider que ``username`` et ``password`` ne sont pas vides.

source: After storing the user, they are redirected to the login page. :func:`url_for` generates the URL for the login view based on its name. This is preferable to writing the URL directly as it allows you to change the URL later without changing all code that links to it. :func:`redirect` generates a redirect response to the generated URL.
fr: Après avoir enregistré l'utilisateur, il est redirigé vers la page de connexion. :func:`url_for` génère l'URL de la vue de connexion en fonction de son nom. C'est préférable à l'écriture directe de l'URL car cela vous permet de changer l'URL plus tard sans modifier tout le code qui y est lié. :func:`redirect` génère une réponse de redirection vers l'URL générée.

source: If validation fails, the error is shown to the user. :func:`flash` stores messages that can be retrieved when rendering the template.
fr: Si la validation échoue, l'erreur est affichée à l'utilisateur. :func:`flash` stocke les messages qui peuvent être récupérés lors du rendu du modèle.

source: When the user initially navigates to ``auth/register``, or there was a validation error, an HTML page with the registration form should be shown. :func:`render_template` will render a template containing the HTML, which you'll write in the next step of the tutorial.
fr: Lorsque l'utilisateur navigue initialement vers ``auth/register``, ou qu'il y a une erreur de validation, une page HTML avec le formulaire d'enregistrement devrait être affichée. :func:`render_template` rendra un modèle contenant le HTML, que vous écrirez dans la prochaine étape du tutoriel.

source: Login
fr: Connexion

source: This view follows the same pattern as the ``register`` view above.
fr: Cette vue suit le même modèle que la vue ``register`` ci-dessus.

source: There are a few differences from the ``register`` view:
fr: Il y a quelques différences par rapport à la vue ``register`` :

source: The user is queried first and stored in a variable for later use.
fr: L'utilisateur est d'abord interrogé et stocké dans une variable pour une utilisation ultérieure.

source: :func:`~werkzeug.security.check_password_hash` hashes the submitted password in the same way as the stored hash and securely compares them. If they match, the password is valid.
fr: :func:`~werkzeug.security.check_password_hash` hache le mot de passe soumis de la même manière que le hash stocké et les compare de manière sécurisée. S'ils correspondent, le mot de passe est valide.

source: :data:`session` is a :class:`dict` that stores data across requests. When validation succeeds, the user's ``id`` is stored in a new session. The data is stored in a *cookie* that is sent to the browser, and the browser then sends it back with subsequent requests. Flask securely *signs* the data so that it can't be tampered with.
fr: La :data:`session` est un :class:`dict` qui stocke les données entre les requêtes. Lorsque la validation réussit, l\'``id`` de l'utilisateur est stocké dans une nouvelle session. Les données sont stockées dans un *cookie* qui est envoyé au navigateur, et le navigateur le renvoie ensuite avec les requêtes suivantes. Flask signe les données de manière sécurisée afin qu'elles ne puissent pas être modifiées.

source: Now that the user's ``id`` is stored in the :data:`session`, it will be available on subsequent requests. At the beginning of each request, if a user is logged in their information should be loaded and made available to other views.
fr: Maintenant que l'identifiant de l'utilisateur est stocké dans la :data:`session`, il sera disponible lors des requêtes suivantes. Au début de chaque requête, si un utilisateur est connecté, ses informations doivent être chargées et mises à la disposition des autres vues.

source: :meth:`bp.before_app_request() <Blueprint.before_app_request>` registers a function that runs before the view function, no matter what URL is requested. ``load_logged_in_user`` checks if a user id is stored in the :data:`session` and gets that user's data from the database, storing it on :data:`g.user <g>`, which lasts for the length of the request. If there is no user id, or if the id doesn't exist, ``g.user`` will be ``None``.
fr: :meth:`bp.before_app_request() <Blueprint.before_app_request>` enregistre une fonction qui s'exécute avant la fonction de vue, quelle que soit l'URL demandée. ``load_logged_in_user`` vérifie si un id d'utilisateur est stocké dans la :data:`session` et récupère les données de cet utilisateur depuis la base de données, en les stockant sur :data:`g.user <g>`, qui dure le temps de la requête. S'il n'y a pas d'id utilisateur, ou si l'id n'existe pas, ``g.user`` sera ``None``.

source: Logout
fr: Déconnexion

source: To log out, you need to remove the user id from the :data:`session`. Then ``load_logged_in_user`` won't load a user on subsequent requests.
fr: Pour vous déconnecter, vous devez supprimer l'identifiant de l'utilisateur de la session :data:`session`. Ensuite, ``load_logged_in_user`` ne chargera pas un utilisateur lors des requêtes suivantes.

source: Require Authentication in Other Views
fr: Exiger l'authentification dans d'autres vues

source: Creating, editing, and deleting blog posts will require a user to be logged in. A *decorator* can be used to check this for each view it's applied to.
fr: Pour créer, modifier et supprimer des articles de blog, l'utilisateur doit être connecté. Un *décorateur* peut être utilisé pour vérifier cela pour chaque vue à laquelle il est appliqué.

source: This decorator returns a new view function that wraps the original view it's applied to. The new function checks if a user is loaded and redirects to the login page otherwise. If a user is loaded the original view is called and continues normally. You'll use this decorator when writing the blog views.
fr: Ce décorateur renvoie une nouvelle fonction de vue qui englobe la vue originale à laquelle il est appliqué. La nouvelle fonction vérifie si l'utilisateur existe ou alors redirige vers la page de connexion. Si un utilisateur est défini, la vue originale est appelée et continue normalement. Vous utiliserez ce décorateur lors de l'écriture des vues du blog.

source: Endpoints and URLs
fr: Points de terminaison et URLs

source: The :func:`url_for` function generates the URL to a view based on a name and arguments. The name associated with a view is also called the *endpoint*, and by default it's the same as the name of the view function.
fr: La fonction :func:`url_for` génère l'URL d'une vue à partir d'un nom et d'arguments. Le nom associé à une vue est également appelé le *point de terminaison*, et par défaut, il est identique au nom de la fonction de vue.

source: For example, the ``hello()`` view that was added to the app factory earlier in the tutorial has the name ``'hello'`` and can be linked to with ``url_for('hello')``. If it took an argument, which you'll see later, it would be linked to using ``url_for('hello', who='World')``.
fr: Par exemple, la vue ``hello()`` qui a été ajoutée à la fabrique d'application plus tôt dans le tutoriel a le nom ``'hello'`` et peut être liée avec ``url_for('hello')``. Si elle prenait un argument, ce que vous verrez plus tard, elle serait liée en utilisant ``url_for('hello', who='World')``.

source: When using a blueprint, the name of the blueprint is prepended to the name of the function, so the endpoint for the ``login`` function you wrote above is ``'auth.login'`` because you added it to the ``'auth'`` blueprint.
fr: Lorsque vous utilisez un *blueprint*, le nom du *blueprint* est ajouté au nom de la fonction. Ainsi, le point de terminaison de la fonction ``login`` que vous avez écrite ci-dessus est ``auth.login`` car vous l'avez ajoutée au *blueprint* ``auth``.

source: Continue to :doc:`templates`.
fr: Continuer vers :doc:`templates`.
