Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/deploying/mod_wsgi.po
Languages: es

source: `mod_wsgi`_ is a WSGI server integrated with the `Apache httpd`_ server. The modern `mod_wsgi-express`_ command makes it easy to configure and start the server without needing to write Apache httpd configuration.
es: `mod_wsgi`_ es un servidor WSGI integrado con el servidor `Apache httpd`_. El moderno comando `mod_wsgi-express`_ facilita la configuración e inicio del servidor sin necesidad de escribir la configuración de Apache httpd.

source: Tightly integrated with Apache httpd.
es: Estrechamente integrado con Apache httpd.

source: Supports Windows directly.
es: Es compatible directamente con Windows.

source: Requires a compiler and the Apache development headers to install.
es: Requiere un compilador y las cabeceras de desarrollo de Apache para su instalación.

source: Does not require a reverse proxy setup.
es: No requiere la configuración de un proxy inverso.

source: This page outlines the basics of running mod_wsgi-express, not the more complex installation and configuration with httpd. Be sure to read the `mod_wsgi-express`_, `mod_wsgi`_, and `Apache httpd`_ documentation to understand what features are available.
es: Esta página describe los aspectos básicos de la ejecución de mod_wsgi-express, no la instalación y configuración más compleja con httpd. Asegúrese de leer la documentación de `mod_wsgi-express`_, `mod_wsgi`_ y `Apache httpd`_ para entender qué características están disponibles.

source: Installing
es: Instalación

source: Installing mod_wsgi requires a compiler and the Apache server and development headers installed. You will get an error if they are not. How to install them depends on the OS and package manager that you use.
es: La instalación de mod_wsgi requiere un compilador y el servidor Apache y las cabeceras de desarrollo instaladas. Obtendrá un error si no lo están. La forma de instalarlos depende del sistema operativo y del gestor de paquetes que utilices.

source: Create a virtualenv, install your application, then install ``mod_wsgi``.
es: Crea un virtualenv, instala tu aplicación y luego instala ``mod_wsgi``.

source: Running
es: Ejecutando

source: The only argument to ``mod_wsgi-express`` specifies a script containing your Flask application, which must be called ``application``. You can write a small script to import your app with this name, or to create it if using the app factory pattern.
es: El único argumento de ``mod_wsgi-express`` especifica un script que contiene tu aplicación Flask, que debe llamarse ``application``. Puedes escribir un pequeño script para importar tu aplicación con este nombre, o para crearla si utilizas el patrón de fábrica de aplicaciones.

source: Now run the ``mod_wsgi-express start-server`` command.
es: Ahora ejecute el comando ``mod_wsgi-express start-server``.

source: The ``--processes`` option specifies the number of worker processes to run; a starting value could be ``CPU * 2``.
es: La opción ``--processes`` especifica el número de procesos de trabajo a ejecutar; un valor inicial podría ser ``CPU * 2``.

source: Logs for each request aren't show in the terminal. If an error occurs, its information is written to the error log file shown when starting the server.
es: Los registros de cada solicitud no se muestran en el terminal. Si se produce un error, su información se escribe en el archivo de registro de errores que se muestra al iniciar el servidor.

source: Binding Externally
es: Vinculación externa

source: Unlike the other WSGI servers in these docs, mod_wsgi can be run as root to bind to privileged ports like 80 and 443. However, it must be configured to drop permissions to a different user and group for the worker processes.
es: A diferencia de los otros servidores WSGI de esta documentación, mod_wsgi puede ejecutarse como root para enlazar con puertos privilegiados como el 80 y el 443. Sin embargo, debe ser configurado para dejar los permisos a un usuario y grupo diferente para los procesos trabajadores.

source: For example, if you created a ``hello`` user and group, you should install your virtualenv and application as that user, then tell mod_wsgi to drop to that user after starting.
es: Por ejemplo, si creaste un usuario y un grupo ``hello``, deberías instalar tu virtualenv y tu aplicación como ese usuario, y luego decirle a mod_wsgi que se pase a ese usuario después de arrancar.
