Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/deploying/uwsgi.po
Languages: es

source: `uWSGI`_ is a fast, compiled server suite with extensive configuration and capabilities beyond a basic server.
es: `uWSGI`_ es un conjunto de servidores rápidos y compilados con una amplia configuración y capacidades que van más allá de un servidor básico.

source: It can be very performant due to being a compiled program.
es: Puede ser muy eficiente debido a que es un programa compilado.

source: It is complex to configure beyond the basic application, and has so many options that it can be difficult for beginners to understand.
es: Es complejo de configurar más allá de la aplicación básica, y tiene tantas opciones que puede ser difícil de entender para los principiantes.

source: It does not support Windows (but does run on WSL).
es: No es compatible con Windows (pero sí con WSL).

source: It requires a compiler to install in some cases.
es: En algunos casos es necesario instalar un compilador.

source: This page outlines the basics of running uWSGI. Be sure to read its documentation to understand what features are available.
es: Esta página describe los aspectos básicos de la ejecución de uWSGI. Asegúrese de leer su documentación para entender qué características están disponibles.

source: Installing
es: Instalación

source: uWSGI has multiple ways to install it. The most straightforward is to install the ``pyuwsgi`` package, which provides precompiled wheels for common platforms. However, it does not provide SSL support, which can be provided with a reverse proxy instead.
es: uWSGI tiene múltiples formas de instalarse. La más sencilla es instalar el paquete ``pyuwsgi``, que proporciona ruedas precompiladas para plataformas comunes. Sin embargo, no proporciona soporte SSL, que puede ser proporcionado con un proxy inverso en su lugar.

source: Create a virtualenv, install your application, then install ``pyuwsgi``.
es: Crea un virtualenv, instala tu aplicación y luego instala ``pyuwsgi``.

source: If you have a compiler available, you can install the ``uwsgi`` package instead. Or install the ``pyuwsgi`` package from sdist instead of wheel. Either method will include SSL support.
es: Si tienes un compilador disponible, puedes instalar el paquete ``uwsgi`` en su lugar. O instalar el paquete ``pyuwsgi`` desde sdist en lugar de wheel. Cualquiera de los dos métodos incluirá soporte para SSL.

source: Running
es: Ejecutando

source: The most basic way to run uWSGI is to tell it to start an HTTP server and import your application.
es: La forma más básica de ejecutar uWSGI es decirle que inicie un servidor HTTP e importe su aplicación.

source: If you're using the app factory pattern, you'll need to create a small Python file to create the app, then point uWSGI at that.
es: Si utiliza el patrón de fábrica de aplicaciones, tendrá que crear un pequeño archivo de Python para crear la aplicación, y luego apuntar a uWSGI.

source: The ``--http`` option starts an HTTP server at 127.0.0.1 port 8000. The ``--master`` option specifies the standard worker manager. The ``-p`` option starts 4 worker processes; a starting value could be ``CPU * 2``. The ``-w`` option tells uWSGI how to import your application
es: La opción ``--http`` inicia un servidor HTTP en el puerto 8000 de 127.0.0.1. La opción ``--master`` especifica el gestor de trabajadores estándar. La opción ``-p`` inicia 4 procesos de trabajo; un valor inicial podría ser ``CPU * 2``. La opción ``-w`` indica a uWSGI cómo importar su aplicación

source: Binding Externally
es: Vinculación externa

source: uWSGI should not be run as root with the configuration shown in this doc because it would cause your application code to run as root, which is not secure. However, this means it will not be possible to bind to port 80 or 443. Instead, a reverse proxy such as :doc:`nginx` or :doc:`apache-httpd` should be used in front of uWSGI. It is possible to run uWSGI as root securely, but that is beyond the scope of this doc.
es: uWSGI no debe ser ejecutado como root con la configuración mostrada en este documento porque causaría que el código de su aplicación se ejecute como root, lo cual no es seguro. Sin embargo, esto significa que no será posible enlazar con el puerto 80 o 443. En su lugar, debe utilizarse un proxy inverso como :doc:`nginx` o :doc:`apache-httpd` delante de uWSGI. Es posible ejecutar uWSGI como root de forma segura, pero eso está fuera del alcance de este documento.

source: uWSGI has optimized integration with `Nginx uWSGI`_ and `Apache mod_proxy_uwsgi`_, and possibly other servers, instead of using a standard HTTP proxy. That configuration is beyond the scope of this doc, see the links for more information.
es: uWSGI ha optimizado la integración con `Nginx uWSGI`_ y `Apache mod_proxy_uwsgi`_, y posiblemente otros servidores, en lugar de utilizar un proxy HTTP estándar. Esa configuración está más allá del alcance de este documento, vea los enlaces para más información.

source: You can bind to all external IPs on a non-privileged port using the ``--http 0.0.0.0:8000`` option. Don't do this when using a reverse proxy setup, otherwise it will be possible to bypass the proxy.
es: Puedes enlazar con todas las IPs externas en un puerto no privilegiado usando la opción ``--http 0.0.0.0:8000``. No hagas esto cuando utilices una configuración de proxy inverso, de lo contrario será posible eludir el proxy.

source: ``0.0.0.0`` is not a valid address to navigate to, you'd use a specific IP address in your browser.
es: ``0.0.0.0`` no es una dirección válida para navegar, sino que debes utilizar una dirección IP específica en tu navegador.

source: Async with gevent
es: Async con gevent

source: The default sync worker is appropriate for many use cases. If you need asynchronous support, uWSGI provides a `gevent`_ worker. This is not the same as Python's ``async/await``, or the ASGI server spec. You must actually use gevent in your own code to see any benefit to using the worker.
es: El sync worker por defecto es apropiado para muchos casos de uso. Si necesitas soporte asíncrono, uWSGI proporciona un trabajador `gevent`_. Esto no es lo mismo que el ``async/await`` de Python, o la especificación del servidor ASGI. Debes usar gevent en tu propio código para ver algún beneficio al usar el worker.

source: When using gevent, greenlet>=1.0 is required, otherwise context locals such as ``request`` will not work as expected. When using PyPy, PyPy>=7.3.7 is required.
es: Cuando se utiliza gevent, se requiere greenlet>=1.0, de lo contrario los contextos locales como ``request`` no funcionarán como se espera. Cuando se utiliza PyPy, se requiere PyPy>=7.3.7.
