Repository: pallets-eco/flask-docs-translations
Catalog: locales/*/LC_MESSAGES/deploying/waitress.po
Languages: es

source: `Waitress`_ is a pure Python WSGI server.
es: `Waitress`_ es un servidor WSGI hecho en Python puro.

source: It is easy to configure.
es: Es fácil de configurar.

source: It supports Windows directly.
es: Es compatible directamente con Windows.

source: It is easy to install as it does not require additional dependencies or compilation.
es: Es fácil de instalar, ya que no requiere dependencias adicionales ni compilación.

source: It does not support streaming requests, full request data is always buffered.
es: No admite las solicitudes de flujo, los datos de las solicitudes completas siempre se almacenan en el búfer.

source: It uses a single process with multiple thread workers.
es: Utiliza un único proceso con múltiples hilos de trabajo.

source: This page outlines the basics of running Waitress. Be sure to read its documentation and ``waitress-serve --help`` to understand what features are available.
es: Esta página describe los aspectos básicos de la ejecución de Waitress. Asegúrese de leer su documentación y ``waitress-serve --help`` para entender qué características están disponibles.

source: Installing
es: Instalación

source: Create a virtualenv, install your application, then install ``waitress``.
es: Crea un virtualenv, instala tu aplicación y luego instala ``waitress``.

source: Running
es: Ejecutando

source: The only required argument to ``waitress-serve`` tells it how to load your Flask application. The syntax is ``{module}:{app}``. ``module`` is the dotted import name to the module with your application. ``app`` is the variable with the application. If you're using the app factory pattern, use ``--call {module}:{factory}`` instead.
es: El único argumento necesario para ``waitress-serve`` le indica cómo cargar tu aplicación Flask. La sintaxis es ``{module}:{app}``. ``module`` es el nombre de importación con puntos del módulo con tu aplicación. ``app`` es la variable con la aplicación. Si estás utilizando el patrón de fábrica de aplicaciones, utiliza ``--call {module}:{factory}`` en su lugar.

source: The ``--host`` option binds the server to local ``127.0.0.1`` only.
es: La opción ``--host`` vincula el servidor sólo con el local ``127.0.0.1``.

source: Logs for each request aren't shown, only errors are shown. Logging can be configured through the Python interface instead of the command line.
es: No se muestran los registros de cada solicitud, sólo se muestran los errores. El registro se puede configurar a través de la interfaz de Python en lugar de la línea de comandos.

source: Binding Externally
es: Vinculación externa

source: Waitress should not be run as root because it would cause your application code to run as root, which is not secure. However, this means it will not be possible to bind to port 80 or 443. Instead, a reverse proxy such as :doc:`nginx` or :doc:`apache-httpd` should be used in front of Waitress.
es: Waitress no debe ejecutarse como root porque provocaría que el código de su aplicación se ejecutara como root, lo cual no es seguro. Sin embargo, esto significa que no será posible enlazar con el puerto 80 o 443. En su lugar, debe utilizarse un proxy inverso como :doc:`nginx` o :doc:`apache-httpd` delante de Waitress.

source: ``0.0.0.0`` is not a valid address to navigate to, you'd use a specific IP address in your browser.
es: ``0.0.0.0`` no es una dirección válida para navegar, sino que debes utilizar una dirección IP específica en tu navegador.
